{"_id":"q61676968","text":"What is the average effect on the DVA (Debt Valuation Adjustment) resulting from a 1 basis point increase in the credit spread of JPMorgan Chase for the years 2007 and 2008, and how can this be calculated using historical financial data?"}
{"_id":"q6165d620","text":"What is the formula to calculate the current portion of the present value of lease obligations, and what data is needed to perform this calculation?"}
{"_id":"q616523c4","text":"What is the total impairment cost recorded in millions from 2003 to 2005, and how can I find the relevant financial data for this calculation?"}
{"_id":"q6168676e","text":"What was the growth rate of operating expenses in 2013, and how can I calculate it using financial data from that year?"}
{"_id":"q616abdde","text":"What is the formula to calculate the net change in cash for the year 2016, and what specific cash flow data points should I consider from financial statements?"}
{"_id":"q616a3986","text":"What percentage does JKHY's total 5-year return represent compared to the average return of its peer group?"}
{"_id":"q61667c92","text":"What is the calculation for the net increase in outstanding shares, measured in millions, for the period from 2016 to 2018 based on available financial data?"}
{"_id":"q61671ce2","text":"What percentage of the total leased locations are situated in the United States, and how can I calculate this using the available leasing data?"}
{"_id":"q616a1438","text":"To find the ratio of Priceline Group Inc. to the NASDAQ Composite Index at the measurement point of December 31, 2016, what are the specific price values for both Priceline Group Inc. and the NASDAQ Composite Index on that date?"}
{"_id":"q6165fe2a","text":"What is the total cost of share repurchases in the 4th quarter of 2004, calculated using the total average price paid per share and the number of shares repurchased during that period?"}
{"_id":"q6167d60a","text":"What was the total expenditure on stock repurchases by companies in December 2012, and where can I find the relevant financial data or reports?"}
{"_id":"q61687ba0","text":"What is the increase in the lowest price of MTKX stock from 2011 to March 2012, and how can I calculate this using historical stock price data?"}
{"_id":"q6167e154","text":"What is the formula to calculate the percentage of total net assets acquired that are classified as property, plant, and equipment (PP&E)? Please provide relevant financial data or examples to illustrate this calculation."}
{"_id":"q61671e90","text":"What is the total amount, in millions, of other comprehensive income (OCI) reclassified into net income for the years ending December 31 for 2012, 2011, and 2010? Please provide the specific figures for each year."}
{"_id":"q61689f9a","text":"What is the percentage of non-U.S. dollar-denominated securities and overnight cash deposits included in the total average GCE for the year 2012? Please provide the calculation method and relevant data sources."}
{"_id":"q6165cc3e","text":"To determine if the rent expense in 2014 was greater than the operating lease expense in 2015, what data sources or financial reports can I use to compare these two specific expense figures?"}
{"_id":"q61650c9a","text":"To determine if the five-year total return of the 2019 peer group exceeded that of the 2018 peer group, what are the specific total return figures for both peer groups, and how can I compare them effectively?"}
{"_id":"q616652b2","text":"What is the percentage of total contractual obligations that is represented by long-term debt, and how can I calculate this using financial statements or relevant data?"}
{"_id":"q6165bd20","text":"What is the calculation for the ratio of tons hedged in 2017 compared to 2018, and what data sources provide this information?"}
{"_id":"q616835be","text":"What is the total amount, in billions, of event-driven loans and commitments that will mature in 2014, based on the data from December 31, 2013?"}
{"_id":"q6167ef50","text":"To find the difference between the highest and lowest share prices for the period from October 1, 2011, to December 31, 2011, what data sources or financial tools can I use to calculate this?"}
{"_id":"q616ac1da","text":"To determine the mathematical range of chemical revenue from 2014 to 2016 in millions, what are the minimum and maximum revenue figures for each year, and how can I calculate the range based on these values?"}
{"_id":"q616972da","text":"What is the percentage of net revenue in 2015 that can be attributed to the growth in retail electric prices, and how can this be calculated using available financial data?"}
{"_id":"q6168d668","text":"What is the calculation for the difference in net outflows in billions between December 31, 2014, and December 31, 2015, based on available financial data?"}
{"_id":"q6167acb6","text":"To enhance the relevance of the search results for this query, I will clarify the calculation process and specify the data points involved. Here’s the rewritten query:\n\n'What is the ratio of amortization expense for other intangible assets between the years 2018 and 2019, and how can I calculate it using financial statements?'"}
{"_id":"q616559de","text":"Did the compensation expense associated with the company's employee stock purchase plan increase from 2004 to 2005, and what are the specific figures for both years?"}
{"_id":"q6169d3a6","text":"What is the method to calculate the difference between the carrying amount and the fair value of notes and other long-term assets for the year 2004, and what data sources provide this information?"}
{"_id":"q616707e8","text":"What is the total fair value of the granted shares in 2013, expressed in thousands of dollars, based on the available financial data?"}
{"_id":"q61650092","text":"What is the formula to calculate the percentage change in total rental expense under operating leases from July 2, 2005, to July 1, 2006, and what are the relevant data points needed for this calculation?"}
{"_id":"q6165e12e","text":"What was the percentage of Canadian NOLs (Net Operating Losses) compared to state NOLs in 2014, and how can I calculate this using available financial data?"}
{"_id":"q61657d88","text":"What was the percentage of Brazilian paper sales in relation to total printing paper sales in 2006, and how can I find the relevant data to perform this calculation?"}
{"_id":"q61696272","text":"What is the calculation for the amortized costs of total securities available for sale, excluding the $367 million attributed to corporate stocks, as of December 31, 2012? Please provide the necessary data points and formulas to perform this calculation."}
{"_id":"q6169bc9a","text":"What is the formula to calculate the percentage increase in rent from 2008 to 2009, and what were the specific rent values for those years?"}
{"_id":"q6167ca5c","text":"What was the amount or portion of the ATI 7.25% notes that was paid off in the year 2006, and how does this figure compare to the total outstanding balance at the beginning of that year?"}
{"_id":"q61676be8","text":"What is the formula to calculate the yearly depreciation rate for land improvements, and what factors should be considered in this calculation?"}
{"_id":"q61691aba","text":"To enhance the relevance of the search results for this query, I will clarify the calculation process and specify the data points involved. Here’s the rewritten query:\n\n'What is the method to calculate the average value of settlements from 2011 to 2013 using available data?'"}
{"_id":"q616a51b4","text":"What is the percentage change in losses on debt extinguishment from 2017 to 2018, and how can I calculate it using financial data?"}
{"_id":"q61679712","text":"What was the percentage of pipeline barrels handled that were attributed to crude oil trunk lines in 2007, based on available pipeline transportation data?"}
{"_id":"q61690d90","text":"To determine the percentage of the firm's total pledged assets in 2010 that were classified as loans, what is the calculation process using the total pledged assets and the amount of loans from the firm's 2010 financial data?"}
{"_id":"q61684dec","text":"What is the method to calculate cumulative three-year dividends in millions for a specific company or sector, and what data sources provide this information?"}
{"_id":"q6168dda2","text":"To find the percentage of revenue by geographic area from the United States for the year ending December 31, 2012, what is the formula or method to calculate this using available financial data?"}
{"_id":"q616a8e0e","text":"What was the profit margin for industrial packaging in 2004, and what factors influenced this margin during that year?"}
{"_id":"q61674ad2","text":"To calculate the percentage change in the weighted-average fair value at grant date from 2008 to 2009, what are the specific values for the weighted-average fair value for both years, and how can I find the formula or method to compute this percentage change?"}
{"_id":"q6165e39a","text":"What is the calculation for the change in impairment charges, measured in millions, included in SG&A expenses from 2006 to 2007? Please provide the relevant financial data for both years."}
{"_id":"q616a95e8","text":"What was the percentage increase in the share repurchase program approved by the board of directors in 2008?"}
{"_id":"q616a0ef2","text":"What is the percentage of the 2010 beginning balance that was vested throughout the year, and how can I calculate this using the relevant financial data?"}
{"_id":"q6166f730","text":"What is the percentage difference in the cumulative 5-year total stockholder return between Cadence Design Systems Inc. and the NASDAQ Composite Index for the period ending January 3, 2015? Please provide the calculation method and relevant data sources."}
{"_id":"q6166f5c8","text":"To determine the midpoint earnings exposure in US dollars (millions) for the year ending December 31, 2005, what is the calculation process for finding the average earnings exposure resulting from a 100 basis point (bp) and a 200 bp change in interest rates?"}
{"_id":"q61692f6e","text":"What is the percentage growth rate in the price of aircraft fuel per gallon from 2012 to 2013, and how can I calculate it using historical fuel price data?"}
{"_id":"q61672b88","text":"What is the method to calculate the average amortization expense for customer-related intangible assets over a specified period, and what data sources provide this information?"}
{"_id":"q616736fa","text":"What is the total number of pipeline barrels handled (in thousands of barrels per day) over the three-year period, and how can I find the relevant data for this calculation?"}
{"_id":"q6167f32e","text":"What is the average square footage of each leased data center, and what factors influence their size?"}
{"_id":"q6167642c","text":"What is the percentage of the decrease in net revenue from 2011 to 2012 relative to the nuclear volume, and how can I calculate this using available financial and nuclear data?"}
{"_id":"q61667e90","text":"What was the percentage of capital spending from continuing operations attributed to consumer packaging in 2006, and how can I find the relevant financial data to calculate this?"}
{"_id":"q6165539e","text":"What is the formula to calculate the percentage change in receivables from brokers within other current assets between the years 2009 and 2010, and what are the relevant data points needed for this calculation?"}
{"_id":"q6164fd5e","text":"What is the percentage difference in cumulative total shareholder return between Masco common stock and the S&P 500 index for the five-year period ending in 2017? Please provide the necessary data and calculation methods to derive this comparison."}
{"_id":"q616531f2","text":"What is the percentage of unleased square footage compared to the total square footage in Alpharetta, Georgia, as of December 2012? Please provide the necessary data for this calculation."}
{"_id":"q616a2068","text":"To calculate the return on investment (ROI) for an investment of $100 in the S&P 500 at the end of 2008 and sold at the end of 2010, what are the specific S&P 500 index values at those dates, and how do I determine the percentage return based on those values?"}
{"_id":"q6169567e","text":"What is the percentage of total other liabilities and accrued expenses in 2014 that is attributed to compensation and benefits, based on available financial data?"}
{"_id":"q61664fc4","text":"What was the average number of berths per ship in the global cruise fleet at the end of 2016, and how does this figure compare to previous years?"}
{"_id":"q616aafc4","text":"What is the percentage of total obligations that operating lease obligations represented in 2008, and how can I calculate this using available financial data?"}
{"_id":"q616ad26a","text":"To clarify the intent and improve the search performance, the rewritten query could be:\n\n'What is the total sum of net sales for European papers from 2004 to 2006, and how can I find the relevant financial data for this calculation?'"}
{"_id":"q6166021c","text":"What was the increase in the company's gross liability from 2011 to 2012, and how can I calculate the change based on the financial data for 2019?"}
{"_id":"q616a917e","text":"What is the total amount of restructuring charges for the current year, excluding any charges from prior years, specifically 2014?"}
{"_id":"q61672a5c","text":"What is the change in the weighted average common shares outstanding (in millions) for diluted earnings per share calculations between 2013 and 2014, and how can I find the relevant financial data to compute this?"}
{"_id":"q616600e6","text":"What is the percentage of total debt repayments that constitutes the contractual obligations for future payments under existing debt, lease commitments, and purchase obligations due in 2007, based on data as of December 31, 2006?"}
{"_id":"q61686f2a","text":"What is the percentage of total contractual obligations that are due in 2012 or later, based on the available financial data?"}
{"_id":"q6169b92a","text":"What is the percentage increase in the average price of WTI crude oil from 2011 to 2013, and how can I calculate it using historical oil price data?"}
{"_id":"q6165cfd6","text":"What is the percentage of containerboard sales relative to the total industrial packaging sales in 2005, and how can I calculate this using available sales data?"}
{"_id":"q616aaa4c","text":"What is the calculation method for determining the ratio of total property and equipment net for the years 2006 and 2005? Please provide the relevant financial data for both years."}
{"_id":"q61688a00","text":"What is the formula to calculate the percentage change in reinsurance accounts from 2009 to 2010, and what are the relevant data points needed for this calculation?"}
{"_id":"q61686ba6","text":"What is the formula to calculate the growth rate in total sales for the year 2012, and what data points are needed to perform this calculation?"}
{"_id":"q616994d6","text":"What is the formula to calculate the percentage decline in equity from 2017 to 2018 based on actual financial data?"}
{"_id":"q61669222","text":"What is the formula to calculate the percentage change in non-interest revenue from 2006 to 2007, and what are the specific revenue figures for those years?"}
{"_id":"q6165ec14","text":"What was the maximum Tier 2 capital in millions for the years 2011 and 2012, and how can I find the relevant financial data for these years?"}
{"_id":"q61692e88","text":"What is the percentage change in the stock price of Priceline Group over the five-year period ending in 2016, and how can I calculate it using historical financial data?"}
{"_id":"q61659110","text":"What is the formula to calculate the percentage of total lease payments that will be paid out in the first year based on the lease agreement terms?"}
{"_id":"q6166203a","text":"What is the average impairment of construction in progress, measured in millions, for the years 2004 to 2006 based on available financial data?"}
{"_id":"q616ac450","text":"What is the formula to calculate the growth rate in net earnings attributable to Altria Group Inc. from 2013 to 2014, and what are the specific net earnings figures for those years?"}
{"_id":"q616678dc","text":"To determine whether the firm canceled more stock options in 2017 than it repurchased in common shares, what are the specific figures for stock options canceled and common shares repurchased in that year?"}
{"_id":"q616a4da4","text":"To determine the total net derivatives in millions, excluding the impact of foreign exchange hedges, what is the calculation process and the specific data points needed from the financial statements or reports?"}
{"_id":"q616a7bee","text":"What was the percentage of total capital spending from continuing operations allocated to each business segment for printing papers in 2005? Please provide the relevant financial data or reports for this calculation."}
{"_id":"q616560fa","text":"What was the percentage of total future estimated cash payments due in 2018 under existing contractual obligations related to long-term debt for the year 2017? Please provide the calculation process and relevant financial data."}
{"_id":"q61661bda","text":"What is the formula to calculate the percentage change in retained earnings balance for the year 2018 after accounting for adjustments, and what data points are needed for this calculation?"}
{"_id":"q6168fb34","text":"What is the percentage of the total expected cash outflow for capital leases that is due in 2018, and how can I calculate this using the available financial data?"}
{"_id":"q616a6afa","text":"What is the percentage of future commitments for service, maintenance, and business enhancement capital expenditure contracts that are paid within the first three years? Please provide data or analysis on the payment distribution over these years."}
{"_id":"q61697654","text":"What is the percentage of the total expected cash outflow required to meet contractual obligations and commitments as of December 31, 2010, that is due in the year 2012?"}
{"_id":"q6166ee7a","text":"What is the calculation for the change in backlog (in millions) at year-end between 2013 and 2014, based on available financial data?"}
{"_id":"q6167068a","text":"What percentage of the total non-cancelable future lease commitments for operating leases was due in 2020, based on the latest financial statements or lease disclosures?"}
{"_id":"q616625bc","text":"To enhance the relevance of the search results for this query, I will clarify the calculation process and the necessary data points involved. Here’s the rewritten query:\n\n'What is the expected weighted average grant-date fair value for options in 2008, assuming the same appreciation rate as observed in 2007? Please provide the calculation method and any relevant data sources.'"}
{"_id":"q616a6ec4","text":"What is the formula to calculate the percentage change in the reserve for product warranties from 2005 to 2006, and what are the specific reserve values for those years?"}
{"_id":"q616615b8","text":"What is the method to calculate the average employee contributions from 2012 to 2014, and what data sources provide this information?"}
{"_id":"q61697442","text":"What is the comparison of the company's exposure to the insurance industry versus the real estate industry within its derivative portfolio? Please provide data or analysis methods to evaluate the relative exposure levels."}
{"_id":"q61670e46","text":"What is the formula to calculate the percentage change in the impact of the euro on earnings from 2011 to 2012, and what are the relevant data points needed for this calculation?"}
{"_id":"q616a31c0","text":"What was the price per share at which AWK repurchased its common stock in 2017, and where can I find detailed information on these share repurchase transactions?"}
{"_id":"q6169f264","text":"What was the percentage of total pipeline barrels handled that were attributed to crude oil trunk lines in 2007, based on available industry data?"}
{"_id":"q61689018","text":"What was the growth rate for the GFS segment in 2016, and how is it calculated based on available financial data?"}
{"_id":"q6168f2ec","text":"What was the unfavorable impact on operating expenses in 2012 due to the appreciation of the U.S. dollar, and how can this be quantified using relevant financial data?"}
{"_id":"q61682600","text":"What was the net revenue growth rate for Entergy Wholesale Commodities in 2012, and how can I calculate it using the available financial data?"}
{"_id":"q6165b1fe","text":"To calculate the annualized return for the S&P 500 index from 2012 to 2017, what is the formula and the necessary data points needed for this calculation?"}
{"_id":"q616ab852","text":"To find the percentage of total future minimum lease commitments due in 2019 based on 2016 data, how can I calculate the proportion of commitments due in 2019 relative to the total commitments?"}
{"_id":"q6169a3fe","text":"What was the percentage of total costs and expenses attributed to costs of services (excluding depreciation, amortization, and restructuring costs) in fiscal year 2018? Please provide the calculation method and relevant financial data."}
{"_id":"q616989aa","text":"To find the ratio of trading assets derivatives receivables to payables for the year 2008, what are the specific values for trading assets derivatives receivables and payables? Please provide the relevant financial data or sources for calculating this ratio."}
{"_id":"q6168ff6c","text":"What is the percentage of the total expected cash outflow for operating leases that is due in 2018, based on the available financial data?"}
{"_id":"q61687966","text":"What percentage of the Boston property is available for sub-lease, and how does this compare to the total leased area?"}
{"_id":"q61694850","text":"What is the formula to calculate the percentage change in revenue generated from non-US currencies between 2016 and 2017, and what data is needed to perform this calculation?"}
{"_id":"q6168e6c6","text":"What is the percentage increase in the total liability for asset retirement obligations from 2004 to 2005, and how can I calculate it using the relevant financial data?"}
{"_id":"q6169b466","text":"What was the change in compensation and benefits liability in millions for the years 2014 and 2013, and how can I calculate this using the relevant financial data?"}
{"_id":"q61695552","text":"What percentage of the total Entergy staff is employed in Entergy Operations, and how can I find the relevant employment data for this calculation?"}
{"_id":"q61688b68","text":"What percentage do current assets represent of the net assets acquired in the Can and Alcan transactions? Please provide the relevant financial data for these transactions to perform the calculation."}
{"_id":"q6165b0c8","text":"What was the percentage of collateral sold, repledged, delivered, or otherwise utilized as of December 31, 2010, based on available financial data?"}
{"_id":"q6165520e","text":"What is the average number of shares issued to employees annually from 2013 to 2015, and how can I find the relevant data to perform this calculation?"}
{"_id":"q61694bca","text":"What is the calculated decrease in the additions for tax positions from prior years, expressed in millions of dollars, based on the available financial data?"}
{"_id":"q61693a36","text":"What is the percentage of the five-year cumulative return for Intel from 2008 to 2013, and how can I find the relevant financial data to calculate this?"}
{"_id":"q616607c6","text":"What is the average operating profit in millions for MFC from 2014 to 2016, and how can I find the relevant financial data to calculate this?"}
{"_id":"q61670428","text":"What is the calculation for the change in derivative receivables reported on the consolidated balance sheets from 2014 to 2015, and where can I find the relevant financial statements for these years?"}
{"_id":"q61699a76","text":"What was the ratio of unrealized losses from interest rate cash flow hedges to unrealized gains from foreign currency cash flow hedges in May 2015, and how can I calculate this using relevant financial data?"}
{"_id":"q616938f6","text":"What is the formula to calculate the ratio of the pre-tax gain from transferring securities from held-to-maturity to available-for-sale categories? Please provide relevant financial data or examples to illustrate this calculation."}
{"_id":"q61668142","text":"What was the total number of shares awarded to employees by the company in 2001, and what factors influenced this decision?"}
{"_id":"q616817fa","text":"What is the net change in unrecognized tax benefits for the year 2007, expressed in millions of dollars, based on available financial data?"}
{"_id":"q6168193a","text":"What is the calculation for the change in off-balance-sheet exposures in millions of dollars between the years 2016 and 2017, based on available financial data?"}
{"_id":"q6167abbc","text":"What is the increase in company 2019's gross liability for unrecognized tax benefits, excluding interest and penalties, from 2014 to 2019? Please provide the relevant financial data for both years to calculate this change."}
{"_id":"q6168bb1a","text":"What is the method to calculate the average number of shares held per registered holder as of February 17, 2017, using available shareholder data?"}
{"_id":"q61690f8e","text":"What is the calculation method for determining the net change in the balance of liabilities associated with employee separations for the year 2005, including relevant financial data and adjustments?"}
{"_id":"q61652e1e","text":"What was the percentage of net interest income from CIB markets in 2018 relative to the total managed interest income, and how can I calculate this using available financial data?"}
{"_id":"q6168b9bc","text":"To enhance the relevance of the search results for this query, I will clarify the calculation process and specify the data points involved. Here’s the rewritten query:\n\n'What is the weighted value of Devon's commercial paper borrowings as of December 31, 2014, expressed in millions, and how can it be calculated using the relevant financial data from 2019?'"}
{"_id":"q616992ce","text":"To determine if the B series stock outperformed the A series stock based on the 5-year total return, what is the calculation method for comparing their total returns over the past five years?"}
{"_id":"q6169589a","text":"Rewritten Query: 'What is the calculation for the annual interest expense associated with the Series First Mortgage Bonds maturing in May 2018, expressed in millions of dollars?'"}
{"_id":"q616604ec","text":"What was the percentage of the company's future minimum payments scheduled for 2019 compared to the total future minimum sponsorship and other marketing payments for 2008, as of December 31, 2007?"}
{"_id":"q61699fb2","text":"What was the percentage of the company's significant contractual obligations related to the global headquarters operating lease that was due in 2016, as of December 31, 2016?"}
{"_id":"q6166bf4a","text":"What is the formula to calculate the percentage change in rental expenses for operating leases between the years 2014 and 2015, and what are the specific rental expense figures for those years?"}
{"_id":"q616a93ae","text":"To find the ratio of gross realized gains to losses for the year 2006, what data sources or financial reports should I consult, and how can I calculate this ratio using the available figures?"}
{"_id":"q6167a0b8","text":"What was the percentage of non-U.S. dollar denominated assets in GCLA (Global Currency Liquidity Assessment) for the year 2014? Please provide the relevant data or sources for this calculation."}
{"_id":"q6166dfac","text":"What is the gross margin percentage for the year 2016, and how is it calculated using revenue and cost of goods sold (COGS) data?"}
{"_id":"q6169e8fa","text":"What percentage of the total consideration transferred is allocated specifically to trademarks in a business acquisition?"}
{"_id":"q616906e2","text":"What is the formula to calculate the percentage change in the total carrying amount of goodwill from 2016 to 2017, and what are the specific values for goodwill in those years?"}
{"_id":"q616a44a8","text":"What is the percentage of total purchase commitments for energy recorded in 2007 compared to the overall commitments for that year?"}
{"_id":"q61665bfe","text":"What is the percentage of total net revenue attributed to net interest income for the year 2014, and how can I calculate it using financial statements or reports?"}
{"_id":"q616a2770","text":"What is the percentage of total debt scheduled maturities that are due after 5 years, and how can I calculate this using available debt maturity data?"}
{"_id":"q616a2f2c","text":"What is the formula to calculate the percentage change in the daily weighted average interest rates from 2016 to 2017, and what are the specific data points needed for this calculation?"}
{"_id":"q61661e96","text":"What is the formula to calculate the gross margin percentage for the year 2017, and what were the relevant revenue and cost of goods sold figures for that year?"}
{"_id":"q61671fa8","text":"What is the calculation method to determine the portion of future minimum lease payments that will be due within the next 12 months based on the lease agreement details?"}
{"_id":"q6166e240","text":"What was the ratio of statutory capital and surplus to statutory net income for Bermuda subsidiaries in 2009, and how can I calculate this using available financial data?"}
{"_id":"q616a5e2a","text":"What is the percentage increase in base rent for the Danvers, Massachusetts facility when comparing the periods of 2008-2010 and 2010-2014, and how can I calculate this using available rental data?"}
{"_id":"q616ab1ea","text":"What percentage of total smokeless product shipments in 2013 is attributed to the Copenhagen segment, and how can this be calculated using available shipment data?"}
{"_id":"q6169ab10","text":"What is the formula to calculate the percentage of total net assets acquired that is attributed to goodwill, and what data points are needed for this calculation?"}
{"_id":"q61696d26","text":"What were the total rent expenses and office equipment expenses under lease agreements from 2013 to 2015, expressed in millions of dollars? Please provide a breakdown of these expenses for each year."}
{"_id":"q61693e3c","text":"To enhance the relevance of the search results for this query, I would rewrite it as follows:\n\n\"What were the variations in expenses for environmental remediation at sites compared to the reserves for environmental matters in millions for the year 2014? Please provide data sources or calculations that illustrate these differences.\""}
{"_id":"q6168dfbe","text":"What is the annual interest cost for remarketable or redeemable securities prior to the first remarketing date, specifically for the years 2018 and 2019? Please provide the calculation process and relevant data points needed to determine this cost."}
{"_id":"q6167fb62","text":"What is the calculation for cash from operating activities in 2017 expressed as a percentage of cash and cash equivalents for the same year? Please provide the necessary financial data or sources to perform this analysis."}
{"_id":"q61696a1a","text":"What is the calculation for the net change in Aon's unpaid restructuring liabilities for the year 2007, specifically focusing on the data from 2019?"}
{"_id":"q61687312","text":"What is the percentage of total debt scheduled maturities as of December 31, 2001, that are due in the year 2005? Please provide the necessary data or calculations to determine this percentage."}
{"_id":"q61694a80","text":"What percentage of the total consolidated revenues in 2016 was contributed by the GFS segment, and how can I calculate this using the available financial data?"}
{"_id":"q61672796","text":"To enhance the relevance of the search results for this query, I will clarify the calculation process and specify the data points involved. Here’s the rewritten query:\n\n'What is the total sum of liabilities based on the final purchase price allocation in a business acquisition? Please provide the relevant financial data and calculation methods.'"}
{"_id":"q61672e9e","text":"What percentage of the total principal and interest payments was due in 2020 and subsequent years? Please provide data sources or methods for calculating this percentage."}
{"_id":"q61660b22","text":"What was the total value of equity compensation plans approved by security holders for issuance upon the exercise of outstanding options, warrants, and rights as of December 2013?"}
{"_id":"q61669844","text":"What is the percentage of scheduled maturities of total debt as of December 31, 2001, that are due in the year 2002, based on available financial data?"}
{"_id":"q6166f14a","text":"To find the percentage of long-term debt obligations as contractual obligations in 2010, what data is needed to calculate the ratio of long-term debt obligations to total contractual obligations for that year?"}
{"_id":"q61660c58","text":"What is the calculation for the difference between the highest and lowest sales prices of the company during the fourth quarter of 2001?"}
{"_id":"q6169d072","text":"What is the calculation method for determining the five-year total return on the S&P 500 index, including dividends and price appreciation?"}
{"_id":"q6168d550","text":"To determine the total number of shares Mr. Oppenheimer would have after his RSUs vest, what is the current number of shares he holds, and how many RSUs are set to vest? Please provide the relevant data for an accurate calculation."}
{"_id":"q6168cd6c","text":"What is the percentage growth in the weighted-average estimated fair values of stock options granted from 2012 to 2013, and how can I calculate it using available financial data?"}
{"_id":"q6165eaa2","text":"What is the net change in research and development spending from 2015 to 2016, and how can I calculate this using available financial data?"}
{"_id":"q6169c1b8","text":"What is the percentage of professional fees relative to the total re-organization costs, and how can I calculate this using the available financial data?"}
{"_id":"q6165a484","text":"What were the total after-tax gains in millions from the sale of Mastercard shares between 2006 and 2007, and how can I calculate this using available financial data?"}
{"_id":"q616637b4","text":"What were the pre-tax earnings in billions for the year 2016, and where can I find the relevant financial data or reports?"}
{"_id":"q6167462c","text":"What methods can be used to estimate the fair value of Hologic common stock, and what are the key financial metrics or data points to consider in this calculation?"}
{"_id":"q61658062","text":"What is the net impact of cumulative effect adjustments, after accounting for income tax effects, on the beginning retained earnings for new accounting standards adopted by Cadence, specifically for the retained earnings balance as of December 30, 2017, expressed in thousands?"}
{"_id":"q61688da2","text":"What is the formula to calculate the percentage of consumer banking gains relative to the total pretax gains for the year 2007, and what data is available to perform this calculation?"}
{"_id":"q6168ad50","text":"How to determine the total reduction in shares outstanding (in millions) due to the stock repurchase program during the specified period?"}
{"_id":"q616a6d98","text":"What was the percentage of total freight revenues attributed to the intermodal commodity group in 2014, and how can I calculate this using available freight revenue data?"}
{"_id":"q6165d3aa","text":"To determine if CME Group Inc. outperformed the S&P 500 over the past 5 years, what are the specific metrics or performance indicators (such as total return, annualized return, or price appreciation) that can be used for comparison?"}
{"_id":"q61686dae","text":"What is the percentage decline in recorded international slot and route authorities from $736 million in 2009 to $708 million in 2010? Please provide the calculation process and any relevant economic data."}
{"_id":"q616a9ae8","text":"What is the formula to calculate the growth rate in net earnings attributable to Altria Group Inc. from 2012 to 2013, and what are the specific net earnings figures for those years?"}
{"_id":"q61682ab0","text":"What is the calculation for the cost difference using the LIFO (Last In, First Out) method over the past two years, and what specific data points are needed to perform this analysis?"}
{"_id":"q6168c5e2","text":"What was the average share price for employee purchases totaling 2.2 million shares in 2011, and how can this be calculated using available financial data?"}
{"_id":"q61662dc8","text":"What is the formula to calculate the percent change in the number of shares purchased by employees from 2010 to 2011, and what are the relevant data points needed for this calculation?"}
{"_id":"q6165ff74","text":"What is the growth rate of the S&P 500 index from December 31, 2004, to the end of 2007, and how can I calculate it using historical index values?"}
{"_id":"q616aa420","text":"To determine the percentual increase in the maturities of long-term debt between the years 2010 and 2011, what data points or financial reports should I analyze? Please provide the specific long-term debt figures for both years to calculate the percentage increase accurately."}
{"_id":"q616965d8","text":"What was the value in millions of non-cash assets involved in the acquisition transaction of OpCity?"}
{"_id":"q61695070","text":"What is the percentage of our total network route miles that are owned compared to those operated under trackage rights or leases? Please provide the calculation method and relevant data sources for this analysis."}
{"_id":"q6169ffb6","text":"What is the percentage of cumulative total shareholder return for Masco common stock over the five-year period ending in 2017, and how can I find the relevant financial data to perform this calculation?"}
{"_id":"q616761c0","text":"What was the total amount in billions of dollars for commitments to invest in funds managed by the firm for the years 2014 and 2015? Please provide the specific figures for each year."}
{"_id":"q61661a9a","text":"What is the percentage increase in long-term debt represented by the floating rate notes maturing in 2010, based on available financial data?"}
{"_id":"q616a09d4","text":"To enhance the relevance of the search results for this query, I will clarify the calculation process and specify the data points involved. Here’s the rewritten query:\n\n\"What is the percentage reduction in costs for second generation tenant improvements compared to first generation improvements, based on available construction data?\""}
{"_id":"q6166474a","text":"What is the total sum of annual long-term debt maturities outstanding as of December 31, 2017, projected for the next five years? Please provide the relevant financial data or sources to calculate this."}
{"_id":"q616a45ca","text":"What is the percentage change in the amount of anticipated natural gas purchases that were hedged to manage price risk between the first quarter of 2004 and the second quarter of 2004? Please provide the relevant data or calculations needed to determine this change."}
{"_id":"q61673038","text":"What is the formula to calculate the percentage change in total managed consumer loans from 2007 to 2008, and what are the specific loan amounts for those years?"}
{"_id":"q61671918","text":"What is the calculation for the difference between income taxes paid and income tax expense for the year 2013, expressed in millions of dollars? Please provide relevant financial data or resources to assist with this calculation."}
{"_id":"q61691948","text":"What is the average basic net income per share available for common shareholders from 2005 to 2007, and how can I calculate it using financial statements or relevant data?"}
{"_id":"q61683fc8","text":"What is the calculation for the difference in receivables from the money pool between the years 2009 and 2010, and what data sources provide this information?"}
{"_id":"q616944ae","text":"What is the percentage cumulative return of Masco Corporation for the five-year period ending in 2012, and how can I calculate it using historical stock price data?"}
{"_id":"q616557d6","text":"To determine the net change in Aon's unpaid restructuring liabilities for the year 2019 based on data from 2006, what specific figures or calculations should I consider? Please provide the relevant financial data or reports that detail the restructuring liabilities for both years."}
{"_id":"q6167e550","text":"What is the formula to calculate the percentage of goodwill relative to the total net assets acquired in a business acquisition?"}
{"_id":"q61680d3c","text":"What is the percentage increase in the Dow Jones U.S. Technology Index from 2011 to 2012, and how can I calculate it using historical index values?"}
{"_id":"q616937d4","text":"Rewritten Query: 'What is the average expected volatility parameter used in the Black-Scholes formula for option pricing, and how is it typically determined from historical data or market indicators?'"}
{"_id":"q6168508a","text":"What was the fluctuation between the effective tax expense rate and the statutory U.S. federal tax rate for the year 2016, and how can I calculate the difference using available tax data?"}
{"_id":"q616a3dc8","text":"To determine the total issuance amounts (in millions) of Texas securitization bonds, including transaction costs and related deferred income tax benefits, what are the specific figures for the issuance, transaction costs, and deferred income tax benefits?"}
{"_id":"q616a9c1e","text":"To find the cumulative rent expense in millions from 2004 to 2006, what is the total rent expense incurred during these years based on available financial data?"}
{"_id":"q6169495e","text":"To find the ratio of interest expense to interest income for the year 2007, what are the specific values for interest expense and interest income from that year? Please provide the relevant financial data or sources to calculate this ratio accurately."}
{"_id":"q61668930","text":"What is the formula to calculate the percentage of total contractual obligations that is attributed to long-term debt, and what data points are needed to perform this calculation?"}
{"_id":"q61684a04","text":"To determine if the fair value of the interest rate collar exceeded that of the interest rate swap, what specific data points or valuation methods should I consider for comparison?"}
{"_id":"q6166d26e","text":"What was the percentage change in net revenue for Entergy Corporation and its subsidiaries in 2011, and how can I calculate it using the available financial data?"}
{"_id":"q61695408","text":"What was the percentage growth in the company's matching contributions from 2007 to 2008, and how can I calculate it using the contribution amounts for those years?"}
{"_id":"q6168c1fa","text":"How to calculate the operating cash flows as a percentage of receivables from the money pool for the year 2003, including the relevant data points and formulas needed for this analysis?"}
{"_id":"q616709d2","text":"How to calculate the percent change in annual long-term debt maturities from 2018 to 2019 using financial data?"}
{"_id":"q61694d00","text":"To determine the total return on a $100,000 investment in Fidelity National Information Systems from December 11 to December 16, what is the calculation process for finding the total return, including the purchase price on December 11, the selling price on December 16, and any applicable fees or dividends?"}
{"_id":"q616a151e","text":"What were the net tax positions for various entities or sectors in 2012, and how can I access the relevant financial data or reports to analyze these figures?"}
{"_id":"q61691c68","text":"What is the formula to calculate the percent change in consulting and professional fees from 2006 to 2007, and what are the specific fee amounts for those years?"}
{"_id":"q61683ee2","text":"What is the percentage increase in dividend payments from 2017 to 2018, and how can I calculate it using available financial data?"}
{"_id":"q616a4b24","text":"To determine the percentage change in the weighted average risk-free interest rate from 2005 to 2007 based on the pricing model, what are the specific data points or formulas needed for this calculation?"}
{"_id":"q616913b2","text":"What is the total value of the balance of options in millions as of December 31, 2002, and what data sources or financial reports can provide this information?"}
{"_id":"q61682cb8","text":"To enhance the relevance of the search results for the given query, I will clarify the calculation process and specify the data points involved. Here’s the rewritten query:\n\n'What was the ratio of the Nasdaq Composite Index to the Nasdaq Pharmaceutical Index as of December 2000, and how can I find the historical values for these indices to perform this calculation?'"}
{"_id":"q61676332","text":"What percentage of the total full-time employees in mainline operations are classified as pilots and flight crew instructors? Please provide the necessary data or calculations to determine this ratio."}
{"_id":"q61690976","text":"To find the expenses associated with liabilities in millions of dollars based on the net interest income managed basis for 2017, what specific data points or financial reports should I reference?"}
{"_id":"q61667382","text":"What would the amount of unrecognized tax benefits be in millions of dollars on December 31, 2008, if settlements are excluded from the calculation? Please provide the relevant financial data or methodology needed to determine this figure."}
{"_id":"q616775c0","text":"To determine the projected operating ratio for 2010 based on the average increases from 2008 to 2009, what is the calculation method to apply the average increase from the operating ratios of 2008 and 2009 to estimate the 2010 operating ratio?"}
{"_id":"q61689220","text":"What was the effective tax rate applied to the $581 million pretax gain from the sale of Mastercard shares in 2007, given that the company reported an after-tax gain of $367 million?"}
{"_id":"q6166e79a","text":"What was the percentage ratio of interest and penalties to total unrecognized tax benefits as of December 31, 2013, and how can I calculate it using available financial data?"}
{"_id":"q61672228","text":"What was the percentage change in compensation expense related to the 2005 outperformance plan from 2009 to 2010, and how can I calculate it using the relevant financial data?"}
{"_id":"q6168f6ca","text":"What is the percentage increase in the performance of the S&P 500 index from 2008 to 2009, and how can I calculate it using historical index data?"}
{"_id":"q61659278","text":"What is the formula to calculate the percentage change in the total fair value of non-vested shares from 2009 to 2010, and what are the specific fair value figures for those years?"}
{"_id":"q61680fd0","text":"What is the formula to calculate the percentage change in securities purchased under agreements to resell from 2014 to 2015, and what are the specific data points needed for this calculation?"}
{"_id":"q6166ba0e","text":"To determine the hypothetical shares outstanding in millions for 2012 without the acquisition of Smith International, what calculations or adjustments need to be made based on the available financial data?"}
{"_id":"q6165a312","text":"What is the average worldwide net acreage that expired over the total three-year period, expressed in millions of acres? Please provide the relevant data sources or calculations needed to determine this average."}
{"_id":"q616550f6","text":"What is the formula to calculate the percentage change in the impact of the euro on earnings from 2010 to 2011, and what are the relevant data points needed for this calculation?"}
{"_id":"q6168a7a6","text":"What was the percentage of Brazilian paper sales in relation to total printing paper sales in 2005, and how can I find the relevant data to perform this calculation?"}
{"_id":"q6169f174","text":"What is the total value of the balance of options in millions as of January 1, 2000, and how can I find the relevant financial data to calculate this?"}
{"_id":"q61682722","text":"What is the formula to calculate the return on investment (ROI) for an investment in the S&P 500 from 2008 to 2009, and what were the specific index values at the beginning and end of that period?"}
{"_id":"q61674c08","text":"What is the calculation for the change in net income resulting from the cumulative effect of adopting new accounting standards? Please provide relevant financial data or examples."}
{"_id":"q61663a2a","text":"What is the calculation for determining the portion of total securities approved by security holders that have been issued? Please provide the relevant data points and any formulas needed for this analysis."}
{"_id":"q61691510","text":"What is the percentage of total minimum lease payments that are due in the year 2015, based on the available lease payment schedule?"}
{"_id":"q61688032","text":"What is the percentage increase in long-term debt represented by the floating rate notes maturing in 2010, based on available financial data?"}
{"_id":"q61698054","text":"What percentage of the capital expenditures incurred by the cable segment in 2007 was allocated to scalable infrastructure?"}
{"_id":"q616ac04a","text":"How to calculate the growth rate of the weighted average fair value for options granted from 2005 to 2006 using relevant financial data?"}
{"_id":"q61693d10","text":"To determine the yearly interest payment associated with a $375 million notional amount in a swap agreement, what is the interest rate applied to this notional amount, and how can I calculate the annual interest payment based on that rate?"}
{"_id":"q61696aec","text":"What is the formula to calculate the percentage change in after-tax share-based compensation costs from 2009 to 2010, and what are the specific cost figures for those years?"}
{"_id":"q6168ab34","text":"How to calculate the growth rate of employee-purchased shares from 2006 to 2007 using historical stock price data?"}
{"_id":"q6165dfee","text":"What is the percentage of future notes that are scheduled to mature by the year 2017 based on the available financial data?"}
{"_id":"q61698360","text":"What is the total sales figure in millions as of December 31, 2014, based on the available financial data?"}
{"_id":"q61689694","text":"What is the total value of intangible assets considered in the calculation of the estimated purchase price for a business acquisition?"}
{"_id":"q61662cc4","text":"What is the calculation method for determining the after-tax share-based compensation cost for the year 2010, including relevant tax rates and compensation data?"}
{"_id":"q616a6096","text":"To calculate the return on investment (ROI) for an investment in Altria Group Inc. from December 2011 to December 2013, what are the specific stock prices at the beginning and end of this period, and how do dividends during this time factor into the overall ROI calculation?"}
{"_id":"q616575f4","text":"What is the formula to calculate the return on investment (ROI) for an investment in UPS from 2008 to 2009, and what specific financial data is needed to perform this calculation?"}
{"_id":"q616a43cc","text":"What was the interest rate for the redeemed 6.25% notes issued in 2004, and how does it compare to current interest rates?"}
{"_id":"q616702de","text":"To find the ratio of the increase in cash in 2009 resulting from the issuance of debt compared to the reduction of debt instruments, what specific data points or financial reports should I reference for accurate calculations?"}
{"_id":"q616793ac","text":"What is the average square footage of residential properties in Massachusetts, and how does it vary by region or property type?"}
{"_id":"q6165144c","text":"What is the formula to calculate the average net revenue in millions for the years 2016 and 2017, and what are the specific net revenue figures for those years?"}
{"_id":"q6166e678","text":"To determine the gross amount of the recognized tax benefit for the year ended December 31, 2017, based on the effective tax rate, what calculation steps and data points should I consider? Please provide relevant financial data or formulas to assist in this calculation in billions."}
{"_id":"q6166e9d4","text":"To enhance the relevance of the search results for this query, I will clarify the calculation process and specify the data points involved. Here’s the rewritten query:\n\n'What was the ratio of pension costs to retiree medical and other service costs from 2016 to 2020, and how can I calculate this using available financial data?'"}
{"_id":"q616a2e28","text":"What is the formula to calculate the percentage change in net interest expense from 2017 to 2018, and what are the specific net interest expense values for both years?"}
{"_id":"q6166134c","text":"What was the percentage of restricted cash and marketable securities allocated to support our insurance programs as of December 31, 2018, and how can this be calculated using financial statements?"}
{"_id":"q61654912","text":"What is the total dollar value of shares that can be purchased using the warrant, based on the exercise price and the number of shares specified in the warrant agreement?"}
{"_id":"q61678358","text":"What were the net revenues in investment management for the year 2016, expressed in billions of dollars?"}
{"_id":"q61675748","text":"What is the calculation method for determining the net change in the total fair value balance of non-vested shares for the year 2013, including any relevant data points or adjustments needed?"}
{"_id":"q6169a886","text":"What is the percentage of trade and other accounts receivable classified as doubtful receivables for the year 2013, and how can I calculate this using financial statements or accounting data?"}
{"_id":"q6167f608","text":"What was the percentage growth of Priceline Group Inc. from 2014 to 2015 based on their financial measurements?"}
{"_id":"q61674992","text":"What was the approximate total workforce size prior to the implementation of the restructuring program, based on available organizational data?"}
{"_id":"q616a7d38","text":"What is the percentage of total minimum capital lease payments that are scheduled to be paid in the year 2020, based on the available financial data?"}
{"_id":"q616610e0","text":"What is the formula to calculate the percentage of current debt relative to long-term debt, and what data is needed to perform this calculation?"}
{"_id":"q6169d9be","text":"What is the formula to calculate the percentage change in the balance of short-term investments for the year 2010, and what data points are needed to perform this calculation?"}
{"_id":"q616876d2","text":"What is the percentage reduction in the carrying amount of a debt due to unamortized discount and debt issuance costs? Please provide the calculation method and relevant financial data needed to determine this percentage."}
{"_id":"q6168617e","text":"What is the total interest expense associated with the senior unsecured notes redeemed in August 2005, and how can I calculate it using the relevant financial data?"}
{"_id":"q616715e4","text":"What is the percentage of total debt that matured during the period from 2016 to 2017, and how can I calculate this using available financial data?"}
{"_id":"q6165394a","text":"What was the total value of granted share awards as of December 31, 2017, and how is this value calculated based on the relevant financial data?"}
{"_id":"q6168740c","text":"What is the total interest amount applied to the annual long-term debt maturities for the year 2018, and how can I calculate it using the relevant financial data?"}
{"_id":"q6167294e","text":"What is the minimum recorded foreign currency translation loss in millions for the latest financial period, and how is it calculated based on the available financial statements?"}
{"_id":"q6169e3c8","text":"What is the calculation method for determining the net income per common share for the year 2007, and what financial data is required to perform this calculation?"}
{"_id":"q61682baa","text":"What were the total liabilities categorized as other long-term liabilities in the consolidated balance sheets for December 31, 2012, and December 31, 2011, expressed in millions?"}
{"_id":"q6167c476","text":"What is the percentage of amortizable intangible assets relative to the total net assets acquired in a business acquisition?"}
{"_id":"q6169d16c","text":"What is the percentage difference in consolidated net sales between the years 2006 and 2008, and how can I calculate it using the available financial data?"}
{"_id":"q6167af36","text":"What is the percentage of total contractual obligations and commitments that are allocated to pension funding, and how can I calculate this using available financial data?"}
{"_id":"q616a1f1e","text":"What is the formula to calculate the percent change in indemnified securities financing from 2006 to 2007, and what are the relevant data points needed for this calculation?"}
{"_id":"q6168b34a","text":"What is the calculation method to determine the ratio of loans maturing in 2037 to those maturing in 2033 as of December 31, 2011, using available financial data?"}
{"_id":"q61669fa6","text":"What is the percentage of factory retail stores located in Europe as of March 29, 2008, based on available retail data?"}
{"_id":"q6165f6d2","text":"What is the calculation for the change in total expenses, net of tax, for share-based compensation from 2014 to 2015, expressed in millions?"}
{"_id":"q6168c0c4","text":"What percentage of the total contingent acquisition payments is attributed to deferred acquisition payments, and how can this relationship be calculated using available financial data?"}
{"_id":"q61684f0e","text":"What is the formula to calculate the percentage change in collateral posted from 2011 to 2012, and what are the specific data points needed for this calculation?"}
{"_id":"q616ad0b2","text":"What is the method to calculate the average total other income in millions for the years 2016 to 2018 using available financial data?"}
{"_id":"q6166cfd0","text":"What is the method to calculate the total fair value of non-vested shares as of May 31, 2010, using available financial data and valuation techniques?"}
{"_id":"q6168461c","text":"What was the productivity in the plastics industry in 2009, measured in million dollars of sales per employee? Please provide the relevant data or sources for this calculation."}
{"_id":"q61661982","text":"What percentage of the Woburn property is occupied by American Tower Corporation, and how does this compare to the total area of the property?"}
{"_id":"q61676b0c","text":"What is the percentage increase in Citigroup's allowance for loan losses related to the consumer portfolio from 2007 to 2008, based on the financial data for those years?"}
{"_id":"q6169311c","text":"What is the total value of issuable long-term securities in millions of dollars, and how can I calculate it using the latest financial data?"}
{"_id":"q616a8c4c","text":"What is the calculation for the change in free cash flow in millions of dollars from 2005 to 2007, and what data sources provide this financial information?"}
{"_id":"q616a117c","text":"What was the maximum collateral posted in millions for the years 2011 and 2012, and how can I find the relevant data sources or tables that provide this information?"}
{"_id":"q61679f3c","text":"What is the percentage of outstanding amounts that were current under the company's long-term financing arrangements in 2010, specifically for the year 2019? Please provide the necessary financial data for this calculation."}
{"_id":"q6167bf30","text":"To determine the remaining years of issuance for the restricted stock plan for non-management directors based on the pace of 2017, what is the total number of shares issued in 2017, and what is the current issuance rate? Please provide the relevant data on the restricted stock plan's total duration and any annual issuance limits."}
{"_id":"q61687f38","text":"What percentage of the 1999 accrual balance associated with restructurings is made up of canceled contracts, and how can this be calculated using available financial data?"}
{"_id":"q6166a41a","text":"What is the calculation method for determining the difference between the statutory U.S. income tax rate and the effective income tax rate for the year 2017, including relevant data sources?"}
{"_id":"q61693f90","text":"What is the total return for the peer group in 2015, and how does it compare to previous years? Please provide the relevant data sources or calculations needed to determine this figure."}
{"_id":"q6166ff6e","text":"What was the percentage change in employee liability for employee separations in 2004, and how can I calculate it using available financial data?"}
{"_id":"q616710b2","text":"What percentage do hard assets represent of the total net assets acquired in the CAN and Alcan acquisitions? Please provide the relevant financial data or calculations needed to determine this percentage."}
{"_id":"q616868b8","text":"What percentage of the R2 acquisition was paid in cash compared to other payment methods?"}
{"_id":"q61677282","text":"To find the greatest amount of derivatives in millions for the years 2017 and 2016, please clarify the specific types of derivatives you are interested in and the data sources available for these years."}
{"_id":"q6167b986","text":"To find the debt to equity ratio based on the target set on December 31, 2018, what are the specific debt and equity figures from that date, and how can I calculate the ratio using these values?"}
{"_id":"q6165894a","text":"How to determine AWK's unrecognized tax benefit for 2012 as a percentage of its gross liabilities using financial statements or relevant data?"}
{"_id":"q6166b266","text":"What is the calculation for the ratio of respirator mask and asbestos receivables to respirator mask and asbestos liabilities for the year 2007, based on available financial data?"}
{"_id":"q616985fe","text":"What is the total number of shares repurchased during the periods from November 1, 2013, to November 30, 2013, and from December 1, 2013, to December 31, 2013? Please provide the relevant data or sources for these share repurchase figures."}
{"_id":"q6166fcc6","text":"What were the total net revenues reported in the consolidated statements of earnings for the year 2016? Please provide the relevant financial data or sources for this information."}
{"_id":"q61672c96","text":"What is the calculation method for determining the net change in the balance of net foreign exchange translation from 2006 to 2007, including the relevant data points needed for this analysis?"}
{"_id":"q6169dacc","text":"What is the method to calculate the average amortization expense for the years 2015 to 2017 using financial statements or accounting records?"}
{"_id":"q616a0d6c","text":"What is the percentage of total future minimum lease commitments that is due in the year 2003, based on the available financial data?"}
{"_id":"q6166b3ba","text":"What was the ratio of Masco's common stock value to the S&P 500 index value in 2015, and how can I calculate this using historical stock market data?"}
{"_id":"q6165dea4","text":"What is the total value in thousands of unvested restricted stock and performance awards at the weighted-average grant-date fair value as of December 31, 2017, based on available financial reports?"}
{"_id":"q61665528","text":"What was the ratio of equity compensation plans approved by security holders that remained to be issued compared to the amount to be issued upon the exercise of outstanding options as of December 31, 2013?"}
{"_id":"q61692be0","text":"What is the formula to calculate the net change in the balance of unrecognized tax benefits for the year 2015, and what specific data points or financial statements should I reference to obtain this information?"}
{"_id":"q61657ee6","text":"To find the average operating income from 2014 to 2016, what is the calculation process and the specific data points needed for this analysis?"}
{"_id":"q6169c794","text":"To determine the debt to equity ratio based on the 2016 actual asset allocation, what are the specific values for total debt and total equity from the asset allocation data for that year?"}
{"_id":"q616acb12","text":"To enhance the relevance of the search results for this query, I will clarify the calculation process and specify the data points involved. Here’s the rewritten query:\n\n'What was the ratio of federal to foreign tax NOL (Net Operating Loss) carryforwards in 2015, and how can I calculate it using available tax data?'"}
{"_id":"q6168d0fa","text":"To enhance the relevance of the search results for this query, I will clarify the calculation process and specify the data points involved. Here’s the rewritten query:\n\n'What is the percentage change in the company's recorded and capitalized unrecognized tax benefits from the balance at December 31 of the previous year to the current year? Please provide the calculation method and relevant financial data.'"}
{"_id":"q61680abc","text":"What is the total cash inflow if all outstanding options, warrants, and rights are exercised, and how can I calculate this using the current exercise prices and quantities of each?"}
{"_id":"q6166ce54","text":"What percentage do consumer-related loans represent of the total corporate lending exposure for the company?"}
{"_id":"q616578a6","text":"What is the calculation for the increase in net gains from sales of available-for-sale securities in 2009 compared to 2008, and what are the specific figures for each year?"}
{"_id":"q616aa042","text":"What is the change in LIBOR interest rates from Year 1 to the average rates observed in Years 3 to 5? Please provide the relevant data or sources for this calculation."}
{"_id":"q6168c8da","text":"What is the formula to calculate the yearly amortization rate for trademarks, and what data points are needed to perform this calculation?"}
{"_id":"q61650326","text":"What is the percentage of total future minimum rental payments that are due in the year 2018, based on the provided rental payment schedule?"}
{"_id":"q616903a4","text":"What is the formula to calculate the percentage change in the weighted average common shares outstanding for basic computations between 2011 and 2012, and what are the relevant data points needed for this calculation?"}
{"_id":"q61695354","text":"What was the percentage of principal transactions revenue attributed to foreign exchange risks in 2017, and how can this be calculated using financial reports or data sources?"}
{"_id":"q616a8684","text":"What is the formula to calculate the percentage change in the risk-free rate between the years 2004 and 2005, and what are the specific risk-free rate values for those years?"}
{"_id":"q616a30c6","text":"To enhance the relevance of the search results for this query, I would rewrite it as follows:\n\n\"What was the ratio of discretionary contributions to postretirement benefit plans for non-US pension plans in 2010, and how can this be calculated using available financial data?\""}
{"_id":"q6167be18","text":"To enhance the relevance of the search results for this query, I will clarify the calculation process and specify the data points involved. Here’s the rewritten query:\n\n'What is the formula to calculate the ratio of the net increase in securities sold under agreements to repurchase compared to the net transfers in, and what data is needed for this calculation?'"}
{"_id":"q6167a4e6","text":"What were the maximum net derivative liabilities under bilateral agreements for the years 2011 and 2012, expressed in millions? Please provide the relevant financial data or sources for these figures."}
{"_id":"q6167c1e2","text":"What was the percentage of rental square feet available for re-lease in Boston in 2004 following the consolidation of business operations, and how does this figure compare to previous years?"}
{"_id":"q61695214","text":"What is the calculation method to determine the range of grant-date fair values for stock options or equity awards issued in 2014, and what specific data points or formulas should be used?"}
{"_id":"q616584fe","text":"What is the formula to calculate the return on investment (ROI) for the S&P 500 index from 2004 to 2006, and what are the specific annual returns or closing values needed for this calculation?"}
{"_id":"q6166e3bc","text":"What is the calculation for the net effect of adjustments from common shareholders' equity in 2019 to the Basel III Common Equity Tier 1 (CET1) capital ratio? Please provide the relevant financial data and adjustments needed for this analysis."}
{"_id":"q616a845e","text":"What is the formula to calculate the net change in cash for the year 2015, and what specific cash flow data points should I consider from financial statements?"}
{"_id":"q6167d132","text":"What was the increase in asset retirement obligations related to the closure of assets in the chemicals manufacturing sector for the year 2006, and what specific data or reports can provide insights into this calculation?"}
{"_id":"q6167e7ee","text":"What is the calculation for the net change in the balance of unrecognized tax benefits for the year 2008, and what data sources provide this information?"}
{"_id":"q61687826","text":"What is the calculation for the change in the number of vehicles, measured in millions, between the years 2015 and 2016 based on available automotive industry data?"}
{"_id":"q6167c336","text":"What is the calculation for the ratio of restricted cash and restricted marketable securities to the allowance for doubtful accounts as of December 31, 2010, using the relevant financial data?"}
{"_id":"q6168e39c","text":"What is the percentage decline in amortization expense for other intangible assets from 2016 to 2017, and how can I calculate it using the relevant financial data?"}
{"_id":"q616526bc","text":"What was the percentage of total operating revenues attributed to agricultural products in 2015, and how can I find the relevant financial data to calculate this?"}
{"_id":"q6165b33e","text":"To enhance the relevance of the search results for this query, I will clarify the calculation process and specify the required data points. Here’s the rewritten query:\n\n'What was the percentage of total shares purchased in December 2012 relative to the total number of shares outstanding as of December 31, 2012? Please provide the calculation method and relevant data sources.'"}
{"_id":"q6167f8c4","text":"What is the method to calculate the 3-year average net state effective tax rate using the most recent tax data available?"}
{"_id":"q6165ef02","text":"What is the formula to calculate the percentage change in minority interest from 2005 to 2006, and what are the specific values for minority interest in those years?"}
{"_id":"q6166d390","text":"What would the total diluted weighted-average shares outstanding be, in millions, for the year ended December 31, 2015, if anti-dilutive common shares were included in the calculation? Please provide the necessary data or formulas to perform this calculation."}
{"_id":"q61673a1a","text":"To determine if Altria outperformed its peer group, what metrics or financial indicators should I compare, such as stock price performance, revenue growth, or profit margins? Please provide the relevant data points for Altria and its peers for a comprehensive analysis."}
{"_id":"q6165bbfe","text":"What is the formula to calculate the percent change in total acquisition integration and other expenses from 2006 to 2007, and what are the specific expense values for those years?"}
{"_id":"q61676d00","text":"What is the formula to calculate the percent change in gain from land sales between the years 2000 and 2001, and what are the specific gain figures for those years?"}
{"_id":"q61651a32","text":"What is the percentage difference in the cumulative 5-year total shareholder return on common stock for Fidelity National Information Services, Inc. compared to the S&P 500 for the period ending December 16? Please provide the necessary data or calculations to determine this difference."}
{"_id":"q6168c2fe","text":"What is the formula to calculate the percentage change in OTTI (Other-Than-Temporary Impairment) from 2011 to 2012, and what are the relevant data points needed for this calculation?"}
{"_id":"q6169a232","text":"To determine if Series C investments outperformed the S&P 500 over a 4-year period, what are the specific returns or performance metrics for Series C and the S&P 500 during that time frame?"}
{"_id":"q616ac630","text":"What was the percentage of capital expenditures allocated to customer premise equipment in cable communications for the year 2015?"}
{"_id":"q6166fbae","text":"What is the percentage of non-U.S. dollar-denominated securities and overnight cash deposits included in the total average GCE for the year 2013? Please provide the relevant data and calculation methods."}
{"_id":"q616a877e","text":"What is the formula to calculate the percentage increase in base rent for the Danvers, Massachusetts facility from the period 2010-2014 compared to the period 2014-2016, and what are the specific base rent values for these timeframes?"}
{"_id":"q61663188","text":"What is the percentage change in domestic manufacturer deduction activity from 2012 to 2013, specifically comparing the data for those years?"}
{"_id":"q616a5f60","text":"To find the percentage of lease obligations compared to purchase obligations for total future minimum commitments under existing non-cancelable leases and purchase obligations as of December 31, 2009, what were the specific lease and purchase obligation amounts in 2012, and how can I calculate the percentage of lease obligations relative to purchase obligations?"}
{"_id":"q61653594","text":"What were the total shares of common stock issued to employees in 2003 and 2004, and how do these figures compare year-over-year?"}
{"_id":"q61682038","text":"What is the formula to calculate the percentage change in dividends declared per common share from 2016 to 2017, and what are the specific dividend amounts for those years?"}
{"_id":"q6167586a","text":"To determine the gross liability of the company for 2019 at the end of 2013, including interest and penalties, what specific financial data or calculations are needed? Please provide the relevant figures or formulas to calculate the total gross liability, considering interest and penalties accrued over the period."}
{"_id":"q61687524","text":"What is the formula to calculate the percent change in the number of shares purchased by employees from 2013 to 2014, and what are the specific data points needed for this calculation?"}
{"_id":"q6169435a","text":"What is the calculation method to determine the portion of total contractual obligations that is due within the next 12 months, based on the available financial data?"}
{"_id":"q616988b0","text":"What is the formula to calculate the percentage decline in the weighted-average estimated fair values of stock options from 2007 to 2008, and what are the specific fair value figures for those years?"}
{"_id":"q6166b130","text":"What are the net trading assets (excluding derivatives) for the year 2009, expressed in millions of dollars? Please provide the relevant financial data or sources for this calculation."}
{"_id":"q6165f1fa","text":"What were the minimum balances of cash instruments in millions for the years 2016 and 2017, and how can I find this data in financial reports or databases?"}
{"_id":"q6166a6ae","text":"How to calculate the annualized return for CME Group from 2012 to 2017 using historical stock price data and performance metrics?"}
{"_id":"q61668070","text":"What was the ratio of the aggregate cost to the fair value of loans held-for-sale carried at LOCOM as of December 31, 2009, and how can I calculate this using available financial data?"}
{"_id":"q616708f6","text":"What is the formula to calculate the percentage change in expected minimum payments from 2014 to 2015, and what are the specific values for those years?"}
{"_id":"q616968d0","text":"What is the net change in research and development spending from 2014 to 2015, and how can I calculate this using available financial data?"}
{"_id":"q616741b8","text":"What is the formula to calculate the percentage change in capital expenditures from 2017 to 2018, and what are the specific capital expenditure values for those years?"}
{"_id":"q616967e0","text":"What is the calculation for the increase in expenses per outstanding basic weighted-average share for the years ended December 31, 2013, and December 31, 2014, and how can I find the relevant financial data to perform this comparison?"}
{"_id":"q61684b30","text":"What is the percentage growth of consolidated net sales from 2005 to 2007, and how can I calculate it using the available financial data?"}
{"_id":"q616a5af6","text":"What is the formula to calculate the percentage change in collateral posted from 2012 to 2013, and what are the specific collateral values for those years?"}
{"_id":"q6166295e","text":"What is the net revenue growth rate for Entergy Mississippi, Inc. in 2016, and how can I calculate it using the company's financial data?"}
{"_id":"q616536b6","text":"What is the calculation for the net change in net revenue for Entergy Wholesale Commodities in 2012, and what specific financial data or reports should I reference to obtain this information?"}
{"_id":"q616acd6a","text":"What is the formula to calculate the return on investment (ROI) for an investment in the NASDAQ Composite Index from March 2007 to March 2010, and what are the specific index values or performance data needed for this calculation?"}
{"_id":"q6166b022","text":"What is the formula to calculate the percentage change in total rental expense under operating leases from July 1, 2006, to July 2, 2007, and what are the relevant data points needed for this calculation?"}
{"_id":"q61666180","text":"What is the percentage by which the K Series stock has outperformed the S&P 500 index over the past 5 years, and how can I calculate this using historical stock performance data?"}
{"_id":"q6167360a","text":"What is the annual amortization amount in millions for the technology acquired for the realtor.com AE website, based on the total acquisition cost and the amortization period?"}
{"_id":"q6165f984","text":"What were the total distillates sales in millions for the three-year period, specifically for the years represented by the figures 365, 346, and 345? Please provide a breakdown of the sales data for each year and the overall total."}
{"_id":"q6169d66c","text":"What is the formula to calculate the percentage change in cash flows from operations between the years 2015 and 2016, and what are the specific cash flow figures for those years?"}
{"_id":"q61697c94","text":"Rewritten Query: 'What are the projected annual payment amounts in millions for the Entergy New Orleans storm recovery bonds over the next three years, including interest and principal repayment details?'"}
{"_id":"q6168c7f4","text":"What was the growth rate for the IFS segment in 2016, and what data sources or reports can provide this information?"}
{"_id":"q6166c882","text":"What is the ratio of firm commitments to provide liquidity on an asset-specific basis for the years 2003 and 2002, given that the commitments were $18.0 billion on December 31, 2003, and $23.5 billion on December 31, 2002?"}
{"_id":"q616a17c6","text":"What is the calculation method to determine the portion of total contingent acquisition payments that is due within the next 12 months based on available financial data?"}
{"_id":"q6165381e","text":"What is the percentage difference in cumulative total return between Goldman Sachs Group Inc. and the S&P 500 Index for the five-year period ending December 31, 2013, and how can I calculate it using historical performance data?"}
{"_id":"q6167c80e","text":"What is the formula to calculate the percentage change in lending-related commitments from 2011 to 2012, and what are the specific values for those years?"}
{"_id":"q61688c76","text":"What is the calculation for the change in total shareholders' equity in millions from 2012 to 2013, and what data sources provide this financial information?"}
{"_id":"q61699bde","text":"What is the average contractual term in years for the years 2013, 2014, and 2015 based on available data?"}
{"_id":"q61668cd2","text":"What was the unrecorded amount in millions for trust preferred securities, common beneficial interests, and junior subordinated debt extinguished with a recognized gain in the third quarter of 2014?"}
{"_id":"q616847e8","text":"What is the formula to calculate the percentage change in loans retained from 2011 to 2012, and what are the specific loan retention figures for those years?"}
{"_id":"q6167b260","text":"What was the total tax expense for the year 2006, and how does it compare to previous years' tax expenses?"}
{"_id":"q6169eb48","text":"To find the average crack spread values for the years 2002 and 2003, what are the specific data points or sources that provide the crack spread values for these years?"}
{"_id":"q616a80ee","text":"What is the formula to calculate the percentage change in the risk-free rate between the years 2003 and 2004, and what are the specific risk-free rate values for those years?"}
{"_id":"q6168bf70","text":"What percentage of the total amount due for interest-only products was attributed to the year 2020 and subsequent years? Please provide relevant data or calculations to support this analysis."}
{"_id":"q616a7fe0","text":"What is the formula to calculate the growth rate of long-term debt balance for the year 2012, and what data points are needed to perform this calculation?"}
{"_id":"q6167488e","text":"What is the annual average of unrecognized compensation costs associated with unvested restricted stock, and how can I calculate this using available financial data?"}
{"_id":"q616aa196","text":"What is the net change in the accrued liability for unrecognized tax benefits between 2007 and 2008, and how can I calculate it using the relevant financial data from that period?"}
{"_id":"q6165cda6","text":"To find the average residential mortgage loan balance in millions for the years 2006 and 2007, what are the total loan balances for each year, and how do I calculate the average between these two years?"}
{"_id":"q61681ca0","text":"What is the total number of private investor repurchase claims for the years 2011 and 2012 combined, expressed in millions? Please provide the relevant data or sources for these figures."}
{"_id":"q616a46d8","text":"What is the formula to calculate the percentage change in rental expenses for operating leases between 2015 and 2016, and what are the relevant data points needed for this calculation?"}
{"_id":"q616a6668","text":"To determine the annual percent return on the company's investments based on the provided table, what is the formula or method to calculate it using the investment values and time period indicated in the data?"}
{"_id":"q6166a988","text":"What was the growth rate of total financial liabilities at fair value for the year 2013, and how can I calculate it using available financial data?"}
{"_id":"q61664c36","text":"What is the return on investment (ROI) for Applied Materials if an investment made in October 2013 was sold two years later, and what data or calculations are needed to determine this ROI?"}
{"_id":"q6169e242","text":"What is the total value of the shares granted, and how is it calculated based on the share price and the number of shares issued?"}
{"_id":"q6168c3d0","text":"To find the ratio of AAG Series A preferred stock to single-dip equity obligations, what is the calculation method and the specific data points needed for this comparison?"}
{"_id":"q61667f8a","text":"What is the formula to calculate the percentage change in aggregate rent expense from 2013 to 2014, and what are the specific rent expense figures for those years?"}
{"_id":"q61652f9a","text":"What is the calculation method to determine the fair value of total securities available for sale, excluding the fair value of corporate stocks, as of December 31, 2012, using relevant financial data?"}
{"_id":"q6166bc34","text":"What is the calculation for the change in the number of buildings, measured in millions, between the years 2015 and 2016 based on available construction data?"}
{"_id":"q6166596a","text":"To find the percentage of square footage in millions of owned facilities in the US compared to the total owned facilities, how can I calculate this ratio using available data on facility sizes and total counts?"}
{"_id":"q61659ffc","text":"What is the formula to calculate the percentage of net assets acquired that is classified as goodwill, and what data points are needed for this calculation?"}
{"_id":"q61654e58","text":"What is the formula to calculate the percentage change in the weighted average fair value of common stock on the award date, and what data points are needed for this calculation?"}
{"_id":"q6169977e","text":"What were the lowest amounts of alternative investments in billions for the years 2016, 2017, and 2018, and how can I find this data?"}
{"_id":"q6169203c","text":"What is the formula to calculate the debt-to-equity ratio for a company in 2016, and what are the specific financial data points needed to perform this calculation?"}
{"_id":"q616ab744","text":"What is the calculation for the difference in capital spending related to business acquisitions in millions of dollars between the years 2011 and 2012?"}
{"_id":"q61675ab8","text":"What percentage of the total bankruptcy settlement obligations is attributed to labor-related claims, and how can I calculate this using available financial data?"}
{"_id":"q6166ab68","text":"What is the percentage change in Level 3 financial assets, measured in millions, from 2016 to 2017 based on available financial data?"}
{"_id":"q6166b496","text":"What is the annual interest expense savings achieved by replacing the 4.50% notes with the 4.25% notes for the 201c series? Please provide the calculation process and relevant data points needed to determine this amount."}
{"_id":"q61696024","text":"What is the percentage change in the excess of current cost over LIFO cost from 2005 to 2006 based on available financial data?"}
{"_id":"q61670acc","text":"What was the current ratio of Blockbuster at the time of its acquisition, and how can I find the financial data needed to calculate it?"}
{"_id":"q61678538","text":"What percentage of the total contractual obligations for future payments, including existing debt, lease commitments, and purchase obligations due in 2011, are attributed to the maturities of long-term debt as of December 31, 2009?"}
{"_id":"q6167dfec","text":"To determine the portion of the redemption amount attributed to accrued interest for the 6.25% notes, what is the calculation method to identify the accrued interest component within the total redemption amount?"}
{"_id":"q61663002","text":"What was the growth rate of mutual fund balances in 2010, and how can I calculate it using available financial data?"}
{"_id":"q616a61d6","text":"What is the method to calculate the growth rate of equity balance for the year 2012 using financial statements or relevant data?"}
{"_id":"q616a32ba","text":"What was the percentage of costs associated with issuing notes under the 364-day facility for financing acquisitions in November 2015? Please provide the relevant financial data or calculations needed to determine this percentage."}
{"_id":"q61664646","text":"What were the total purchase amounts in millions for the company under purchase agreements for the years ended December 31, 2004, and December 31, 2003?"}
{"_id":"q6168d7e4","text":"To find the average liability for uncertain tax positions in millions for the years 2016 to 2018, what is the calculation process and the relevant data sources needed to obtain this information?"}
{"_id":"q61666c52","text":"To enhance the relevance of the search results for this query, I will clarify the calculation process and specify the data points involved. Here’s the rewritten query:\n\n'What was the ratio of Entergy's recorded regulatory liability to its tax liability in October 2015, and how can I find the relevant financial data to perform this calculation?'"}
{"_id":"q616530a8","text":"What would the ending balance for unrecognized tax benefits be on March 31, 2008, in millions, if the settlement levels are assumed to remain the same as in fiscal year 2007? Please provide the calculation process and any relevant data needed to determine this balance."}
{"_id":"q6165b5dc","text":"What is the total compensation expense recognized for restricted stock from 2008 to 2010, and how can I find the relevant financial data or reports that detail these expenses?"}
{"_id":"q6166708a","text":"What is the percentage change in High-Quality Liquid Assets (HQLA) between Q3 and Q4 of 2015, and how can I calculate it using available financial data?"}
{"_id":"q6168948c","text":"To enhance the relevance of the search results for this query, I will clarify the calculation process and specify the data points involved. Here’s the rewritten query:\n\n\"What was the percentage change in non-vested amounts as of May 31, 2009, compared to the previous period? Please provide the necessary data and calculation method.\""}
{"_id":"q6168b8c2","text":"Rewritten Query: 'What is the average basic net income available for common shareholders in millions from 2006 to 2008, and how can I calculate it using financial statements or reports?'"}
{"_id":"q616683cc","text":"What is the calculation method to determine the portion of future lease payments that will be due after a 5-year period, based on the total lease agreement terms and payment schedule?"}
{"_id":"q6167ecd0","text":"To project the risk-free interest rate for 2006 based on the growth rate observed in 2005, what calculation method should I use, and what specific data points or formulas are needed to derive this projection?"}
{"_id":"q6167b620","text":"What is the calculated increase in the operating margin from 2015 to 2016 based on the available financial data?"}
{"_id":"q6165c4a0","text":"What is the percentage increase in the carrying values of excess inventories for Protect from 2002 to 2003, and how can I calculate it using the relevant financial data?"}
{"_id":"q61689b26","text":"What is the percentage of U.S. Airways employees among the total number of active full-time equivalent employees based on the latest workforce data?"}
{"_id":"q616a4296","text":"What is the percentage of total facilities owned, calculated based on their total square footage? Please provide data or methods for determining this percentage."}
{"_id":"q6166fdd4","text":"What was the percentage of collateral sold, repledged, delivered, or otherwise utilized as of December 31, 2009, based on available financial data?"}
{"_id":"q616966c8","text":"What was the net profit margin for companies in 2015, and how can I calculate it using available financial data?"}
{"_id":"q61656852","text":"What is the total mileage of private crude oil pipelines and private refined products pipelines in the United States, and how can I find the most recent data on these figures?"}
{"_id":"q6169cbe0","text":"What is the calculation for the net change in net revenue for Entergy Mississippi, Inc. during the year 2016, based on available financial data?"}
{"_id":"q6165cee6","text":"To determine the hypothetical net revenue for 2015 in millions, excluding the effects of retail electric price changes and the influences of volume and weather, what calculation methods or data sources can be used to isolate these factors?"}
{"_id":"q6167c098","text":"What is the cumulative total stockholder return percentage for Illumina Inc. common stock compared to the NASDAQ Pharmaceutical Index for the four years ending in 2003, and how do I calculate the difference between these two returns?"}
{"_id":"q616a6960","text":"What is the formula to calculate the percentage change in total facility lease obligations from 2015 to 2016, and what are the specific values for those years?"}
{"_id":"q61691ed4","text":"What is the percentage of equity compensation plans that received disapproval from security holders, and how can I calculate this using available data on approved versus total plans?"}
{"_id":"q6165db48","text":"What is the total cash inflow from employee stock purchases in 2007, expressed in millions of dollars, and how can I calculate it using available financial data?"}
{"_id":"q616945b2","text":"What is the percentage increase in maximum borrowings outstanding from 2016 to 2017, and how can I calculate it using the relevant financial data?"}
{"_id":"q61663ec6","text":"What is the percentage of containerboard sales relative to the total industrial packaging sales in 2006, and how can I calculate this using available sales data?"}
{"_id":"q61659660","text":"What is the estimated percentage of the revolving credit facility compared to the total senior credit facility, expressed in millions? Please provide the necessary data or calculations to determine this ratio."}
{"_id":"q61687a42","text":"What is the percentage growth rate of dividends received in 2012 compared to 2011, and how can I calculate it using available financial data?"}
{"_id":"q61696146","text":"What is the percentage growth in outstanding borrowings from 2016 to 2017, and how can I calculate it using available financial data?"}
{"_id":"q61668fa2","text":"What is the method to calculate the average aggregate intrinsic value of stock options exercised between 2013 and 2015, and what data sources provide this information?"}
{"_id":"q61674000","text":"What is the percentage of restricted stock and deferred stock that vested in 2014 relative to the net earnings attributable to Altria Group Inc. for the same year? Please provide the calculation process and relevant financial data."}
{"_id":"q6165c7c0","text":"What would be the projected underlying operating profit in millions for 2014 if it increases at the same rate as the growth observed in 2013? Please provide the necessary data points for the 2013 operating profit and the growth rate."}
{"_id":"q616a219e","text":"What is the percentage change in unrecognized tax benefits from 2011 to 2012 based on the reconciliation data? Please provide the necessary figures or calculations to determine this percentage change."}
{"_id":"q616ab492","text":"What is the calculation for the change in average equity in millions of dollars from 2009 to 2010, and what data sources provide this information?"}
{"_id":"q6167f04a","text":"What is the average share price of employee-issued shares in the U.S. for the year 2015, and how can I find the relevant data to calculate this?"}
{"_id":"q6165adc6","text":"What percentage of the total bankruptcy settlement obligations is attributed to single-dip equity obligations, and how can this be calculated using available financial data?"}
{"_id":"q6166c29c","text":"What was the percentage change in the value of the euro in 2017 compared to the previous year, considering the total increase or decrease in its value?"}
{"_id":"q6166625c","text":"What is the total expected payment amount for Entergy Louisiana's Investment Recovery Funding bonds over the next 5 years, including principal and interest calculations?"}
{"_id":"q616511b8","text":"What is the method to calculate the average net annual change in discounted future net cash flows (in millions) for the years 2009, 2010, and 2011 using available financial data?"}
{"_id":"q6168658e","text":"What is the percentage of total contractual obligations in 2011 that is comprised of long-term debt obligations, and how can I calculate this using available financial data?"}
{"_id":"q616a8b2a","text":"To analyze the variation in lease obligations between the years 2011 and 2012, what specific data points or calculations should I consider, and how can I quantify the changes in lease obligations during this period?"}
{"_id":"q61663c96","text":"What is the formula to calculate the percent change in the aggregate net asset values of the collateral pools for SSgA lending funds from 2008 to 2009, and what are the specific net asset values for those years?"}
{"_id":"q6166f276","text":"What is the formula to calculate the yearly amortization rate for technology purchases, and what data points are needed to perform this calculation?"}
{"_id":"q61672d5e","text":"What percentage of the total estimated purchase price is typically paid in cash, and how can I calculate this using available financial data?"}
{"_id":"q6165acb8","text":"What is the calculation for the net change in tax positions for the year 2014, and what data sources provide this information?"}
{"_id":"q616621fc","text":"What is the formula to calculate the percentage change in non-interest revenue from 2007 to 2008, and what are the specific revenue figures for those years?"}
{"_id":"q6169221c","text":"What is the total value, in thousands, of unvested restricted stock and performance awards at the weighted-average grant date fair value as of December 31, 2018, based on available financial reports?"}
{"_id":"q616a487c","text":"What is the formula to calculate the percentage change in total financial liabilities at fair value for the year 2012, and what data sources provide this information?"}
{"_id":"q61659dae","text":"What is the formula to calculate the growth rate in share prices from the highest value during the quarter ending December 31, 2016, to the closing price on February 17, 2017, using historical stock data?"}
{"_id":"q616a1cbc","text":"What is the calculation for the change in total expenses, net of tax, for share-based compensation from 2013 to 2014, expressed in millions?"}
{"_id":"q616518a2","text":"What is the percentage change in the fair value of commercial mortgage loans designated for sale from 2008 to 2009, and how can I calculate it using available financial data?"}
{"_id":"q616570e0","text":"What is the calculation method to determine the ratio of purchases made in December 2012 compared to those made in January 2013 using available sales data?"}
{"_id":"q6169b27c","text":"What is the percentage decrease in net revenue from 2016 to 2017, and how can I calculate it using the net revenue figures for those years?"}
{"_id":"q61665a5a","text":"What is the formula to calculate the percentage change in aggregate rent expense from 2012 to 2013, and what are the specific values for rent expenses in those years?"}
{"_id":"q616a62e4","text":"What percentage of the total reserves allocated for environmental contingencies in 2018 is specifically associated with New Jersey Chrome? Please provide the relevant data or calculations needed to determine this percentage."}
{"_id":"q6166f834","text":"What is the formula to calculate the percentage change in expected volatility from 2012 to 2013, and what are the specific volatility values for those years?"}
{"_id":"q6169b33a","text":"What is the calculation for the net change in net revenue for Entergy Mississippi, Inc. in 2003, and what data sources provide this financial information?"}
{"_id":"q61656712","text":"What is the percentage change in the weighted-average estimated fair value of employee stock options granted from 2013 to 2014, and how can I calculate it using the relevant financial data?"}
{"_id":"q616a52d6","text":"To find the average weighted average common shares outstanding for diluted computations from 2012 to 2014, what is the formula or method to calculate this average using the annual data for those years?"}
{"_id":"q6165770c","text":"What is the method to calculate the average share price of shares issued to employees in the UK for the year 2015, and what data sources provide this information?"}
{"_id":"q6167fa2c","text":"What is the calculation method to determine the percentage of total minimum lease payments that are due after the year 2015, based on the provided lease payment schedule?"}
{"_id":"q616854fe","text":"What is the formula to calculate the percentage change in net derivative liabilities under bilateral agreements from 2011 to 2012, and what are the relevant data points needed for this calculation?"}
{"_id":"q6168a6ac","text":"What are the estimated total payments, in millions, for natural gas pipeline and storage capacity commitments over the next three years? Please provide a breakdown of the annual payments if available."}
{"_id":"q6169b16e","text":"What is the calculation method for determining the net change in the balance of unrecognized tax benefits for the year 2016, including any relevant financial data or reports?"}
{"_id":"q61666400","text":"What is the percentage increase in the balance at the end of 2018 if unrecognized tax benefits are included in the calculation? Please provide the necessary financial data or formulas to perform this calculation."}
{"_id":"q61679d5c","text":"What is the method to calculate the average amortization expense for the years 2006 to 2008 using financial statements or accounting data?"}
{"_id":"q616ac342","text":"What percentage of total long-term borrowings is scheduled to mature within the next 36 months, and how can I calculate this using available financial data?"}
{"_id":"q6165ba28","text":"What is the percentage of cumulative total shareholder return for Discovery Communications (DISCA) from September 18, 2008, to December 31, 2011, and how can I calculate it using historical stock price data?"}
{"_id":"q6169ed00","text":"What will be the projected customer satisfaction level for 2010 if the increase in the satisfaction index observed in 2008 is replicated in 2009? Please provide the calculation method and any relevant data needed for this forecast."}
{"_id":"q6169ce10","text":"What is the method to calculate the average expected volatility of the weighted-average estimated fair value of employee stock options for the years 2010 to 2012, based on available financial data?"}
{"_id":"q616a4c50","text":"What is the formula to calculate the growth rate of net sales from 2015 to 2016, and what data is needed to perform this calculation?"}
{"_id":"q6169b7fe","text":"What is the formula to calculate the percent change in operating leases from the fiscal year 2011\/12 to 2013\/14, and what are the relevant data points needed for this calculation?"}
{"_id":"q61683cbc","text":"What is the method to calculate the average repurchase price per share for the year 2006 using historical stock buyback data?"}
{"_id":"q61667b34","text":"What is the percentage increase in port call costs from 2011 to 2012, and how can I calculate it using the relevant financial data?"}
{"_id":"q616995f8","text":"What is the final cash purchase price in millions for the Terrestar acquisition that will be paid upon closing? Please provide details on the acquisition agreement and any relevant financial terms."}
{"_id":"q6169dd9c","text":"What is the calculation for the difference between client payment amounts and the actual recorded revenue (in millions) for the specified period?"}
{"_id":"q61654f98","text":"What was the percentage of stock issue costs relative to company proceeds in November 2005, and how can I calculate this using available financial data?"}
{"_id":"q616abcbc","text":"What is the percentage of total material obligations and commitments as of December 31, 2009, that are classified as operating leases, and how can I calculate this using the relevant financial data?"}
{"_id":"q61657324","text":"What is the formula to calculate the percentage change in cash dividends paid per common share from 2006 to 2007, and what are the specific dividend amounts for those years?"}
{"_id":"q61664880","text":"What was the net revenue growth rate for Entergy Corporation in 2015, and how can I calculate it using the company's financial data from that year?"}
{"_id":"q6167ced0","text":"What is the percentage of total purchase commitments for energy in 2006 compared to the overall commitments for that year?"}
{"_id":"q61673ed4","text":"What was the percentage change in account balance for the year 2015, and how can I calculate it using the account balance data from the beginning and end of that year?"}
{"_id":"q616870a6","text":"What is the average tax penalty amount in millions of dollars for the years 2014 to 2016, and how can I find the relevant data to calculate this?"}
{"_id":"q6165fbfa","text":"What is the formula to calculate the ROI (Return on Investment) for an investment in DJ US Containers & Packaging from 2007 to 2012, and what are the specific financial data points needed for this calculation?"}
{"_id":"q6167442e","text":"What was the change in the total amount of nonperforming loans in millions of dollars between 2011 and 2012, and how can I calculate this using available financial data?"}
{"_id":"q6169e026","text":"To determine the percentage increase in net revenue from 2016 to 2017 while accounting for volume and weather factors, how can I calculate the adjusted net revenue growth percentage for these years?"}
{"_id":"q616541ec","text":"What is the percentage of the total carrying amount of investment securities that is represented by securities held to maturity, and how can this be calculated using financial data?"}
{"_id":"q6169ee68","text":"What percentage of the final purchase price in Brazil was attributed to hard assets, based on the latest valuation data?"}
{"_id":"q616750c2","text":"What is the average balance of unresolved asserted indemnification and repurchase claims in millions for home equity as of December 31, 2012, and December 31, 2011? Please provide the calculation method and relevant data sources."}
{"_id":"q61668606","text":"To determine the percentage of operating leases relative to total contractual obligations due within 1-3 years, what is the calculation process and the necessary data points required for this analysis?"}
{"_id":"q6169bf74","text":"What is the average improvement in net interest yield on interest-earning assets in basis points from 2017 to 2018, based on the managed basis data for 2013?"}
{"_id":"q61663642","text":"What percentage of the capital expenditures incurred by the cable segment in 2008 was attributed to scalable infrastructure?"}
{"_id":"q6166ed80","text":"What is the formula to calculate the average of high and low stock prices for the first quarter of 2000, and what are the specific high and low stock prices for that period?"}
{"_id":"q6168e0c2","text":"What is the calculation for the difference in estimated future benefit payments for retiree medical and life insurance plans between 2015 and 2016, expressed in millions of dollars?"}
{"_id":"q6165e610","text":"What is the calculation for the difference between the highest and lowest sales prices of the company during the second quarter of 2001, and where can I find the relevant sales data?"}
{"_id":"q61690a84","text":"What is the percentage decrease in gross wholesale revenue compared to the net revenue from 2003, and how can I calculate it using available financial data?"}
{"_id":"q6165aa10","text":"What is the percentage increase in the high price of MTX stock from 2011 to March 2012, and how can I calculate this using historical stock price data?"}
{"_id":"q6169a76e","text":"How to calculate the average payment volume per transaction for Visa Inc. using their financial data and transaction statistics?"}
{"_id":"q616765c6","text":"What was the percentage of net interest income from CIB markets in 2017 relative to the total managed interest income, and how can I calculate this using available financial data?"}
{"_id":"q616aae8e","text":"What is the formula to calculate the percentage change in free cash flow from 2009 to 2010, and what are the specific free cash flow values for those years?"}
{"_id":"q6167bada","text":"What is the calculation method to determine the deferred fuel cost revisions as a percentage of the net revenue for the year 2004? Please provide relevant data sources or formulas needed for this analysis."}
{"_id":"q61682f10","text":"What is the percentage of home equity loans with a loan-to-value ratio greater than 90% from the total $14.4 billion reported under 'consumer' loans as of December 31, 2007? Please provide the calculation method and relevant data sources."}
{"_id":"q61680832","text":"What is the average value, in billions, of structured commercial loan vehicles issued by VIEs (Variable Interest Entities) for the years 2002 and 2003? Please provide data sources or calculations to support this average."}
{"_id":"q61678fce","text":"To find the ratio of Snap-on Incorporated's performance to that of its peer group in 2004, what specific performance metrics should I compare, and how can I access the relevant financial data for both Snap-on and its peer group?"}
{"_id":"q6168fd6e","text":"What was the percentage increase in the New Jersey Chrome Environmental Reserve for the year 2018, based on available environmental data and reports?"}
{"_id":"q6166b810","text":"What is the formula to calculate the percentage growth in dividend yield from 2007 to 2008, and what were the specific dividend yield values for those years?"}
{"_id":"q616a3878","text":"What are the net trading assets (excluding derivatives) for the year 2008, expressed in millions of dollars?"}
{"_id":"q616848e2","text":"Was the percentage of sweet crude oil and condensate production in the U.S. in 2013 higher than in 2012, and how can I find the relevant production data for both years to compare?"}
{"_id":"q6166efc4","text":"To determine the total return on an investment of $100,000 in Applied Materials from 2008 to 2011, what are the steps to calculate the investment's growth, including any dividends received and the final sale price?"}
{"_id":"q61653364","text":"What was the percentage of unleased square footage in Alpharetta, Georgia, as of December 2007, based on available commercial real estate data?"}
{"_id":"q6169bb46","text":"What is the calculation for the change in basis points of postretirement plan rates from 2016 to 2017, and what data sources provide this information?"}
{"_id":"q6168dc6c","text":"What percentage of the total principal transactions revenue in 2016 can be attributed to interest rate risks, and how can this calculation be performed using available financial data?"}
{"_id":"q616565d2","text":"What is the calculation for the five-year change in the Vornado Realty Trust index, and what data sources provide this historical performance information?"}
{"_id":"q6167a248","text":"What was the percentage decline in uncertain tax positions for the year 2018, and how can I calculate it using available financial data?"}
{"_id":"q6167fca2","text":"How to calculate the percent change in the weighted-average estimated fair value of employee stock options from 2011 to 2012 using available financial data?"}
{"_id":"q6166035c","text":"What is the formula to calculate the percentage increase in the fair value of options granted from 2013 to 2014, and what are the specific fair value figures for those years?"}
{"_id":"q61681b92","text":"To find the average amount of liabilities in millions for the year 2008 across the three categories, what are the specific categories and their corresponding liability data?"}
{"_id":"q61652090","text":"What was the ratio of square footage between Alpharetta, Georgia, and Charlotte, North Carolina, as of December 2007, and how can I find the relevant data to perform this calculation?"}
{"_id":"q616a2504","text":"What is the total pretax gain in millions from the sale of Mastercard shares between 2006 and 2007, and how can I calculate this using available financial data?"}
{"_id":"q61699198","text":"What is the projected cost increase, in millions, that will be passed on to customers over the next 3 years due to the variance in retail electric prices? Please provide calculations or data sources that detail the expected price changes and their impact on customer costs."}
{"_id":"q6166e89e","text":"What is the expected portion of total support incentives to be disbursed in 2009 based on available financial data and projections?"}
{"_id":"q61659548","text":"To find the average ending balance of valuation allowances for deferred income tax assets from 2016 to 2018, what are the specific annual ending balances for each year, and how can I calculate the average of these values?"}
{"_id":"q61655dc6","text":"What is the calculation for the annual interest cost savings achieved by the company upon redeeming the 8.75% second priority senior secured notes, considering the total outstanding amount of the notes?"}
{"_id":"q616a7e8c","text":"What is the calculation for the difference in the increase of cash in working capital (in millions) between 2006 and 2005? Please provide the relevant financial data for both years."}
{"_id":"q6165d76a","text":"To calculate the total return on an investment of $100,000 in the S&P 500 from 2008 to 2011, what are the annual returns for the S&P 500 during this period, and how do I compute the final value of the investment after accounting for these returns?"}
{"_id":"q616a33fa","text":"What was the change in tax credit investments, measured in billions, included in our equity investments held by consolidated partnerships, between December 31, 2014, and December 31, 2013? Please provide the calculation process and relevant data sources."}
{"_id":"q616abf46","text":"What was the change in unrecognized tax benefits in 2014 based on the reconciliation review, and what specific factors contributed to this change?"}
{"_id":"q6167a63a","text":"What were the maximum net derivative liabilities under bilateral agreements for the years 2012 and 2013, expressed in millions? Please provide the relevant financial data or sources for these figures."}
{"_id":"q616a49b2","text":"What is the calculation method for determining the difference between the carrying amount and the fair value of long-term debt and other long-term liabilities for the year 2014?"}
{"_id":"q616a00b0","text":"What is the percentage of issued securities that have received approval from security holders, and how can this be calculated using available financial data?"}
{"_id":"q61685ab2","text":"To enhance the relevance of the search results for this query, I will clarify the calculation process and specify the data points involved. Here’s the rewritten query:\n\n'What is the formula to calculate the percentage of amortization expenses based on the 2008 net deferred loss, and what data is needed for this calculation?'"}
{"_id":"q6168afbc","text":"What is the method to calculate the average rental expense in millions for the years 2000 to 2002 using available financial data?"}
{"_id":"q616963a8","text":"What was the total cash obligations and the aggregate carrying value of long-term debt due as of December 31, 2006? Please provide the relevant financial data or calculations needed to determine these values."}
{"_id":"q61683a0a","text":"What is the formula to calculate the percentage change in earnings from service operations between the years 2000 and 2001, and what are the specific earnings figures for those years?"}
{"_id":"q616aad62","text":"To find the cumulative rental expense in millions from 2014 to 2016, what is the total sum of rental expenses for each year within that period?"}
{"_id":"q61651320","text":"Rewritten Query: 'What is the approximate number of travel destinations per continent, assuming an equal distribution of destinations across all continents?'"}
{"_id":"q6169d752","text":"What is the calculation for determining the portion of total securities approved by security holders that is still available for future issuance? Please provide the necessary data points and any relevant formulas."}
{"_id":"q6167daa6","text":"What is the formula to calculate the percentage increase in total expenses from 2017 to 2018, and what are the specific total expense figures for those years?"}
{"_id":"q61655f24","text":"What percentage do commercial mortgage loans held for sale at fair value represent of the total loans held for sale as of December 31, 2011? Please provide the necessary data or calculations to determine this percentage."}
{"_id":"q616a99c6","text":"What is the formula to calculate the percentage change in the carrying value of the company's interest in PennyMac from 2016 to 2017, and what are the specific carrying values for those years?"}
{"_id":"q6165c5f4","text":"What is the calculation method for determining the net change in the balance of accumulated other comprehensive loss from 2006 to 2007, and what specific financial data is needed for this analysis?"}
{"_id":"q6165face","text":"Did Abiomed's stock performance exceed that of the Nasdaq Medical Equipment Index over the specified period? Please provide the relevant time frame for comparison."}
{"_id":"q61674302","text":"What is the formula to calculate the percentage change in total assets for unconsolidated conduits between the years 2005 and 2006, and what are the relevant data points needed for this calculation?"}
{"_id":"q616ac766","text":"What was the percentage of total future minimum commitments under existing non-cancelable leases compared to purchase obligations in 2007? Please provide the relevant financial data or calculations needed to determine this percentage."}
{"_id":"q6169110a","text":"What is the total number of shares issued in millions during the period from 2016 to 2018, and how can I find the relevant financial data to calculate this?"}
{"_id":"q6167bbe8","text":"What is the projected total amount to be allocated for support incentives over the next three years, based on current funding data and trends?"}
{"_id":"q61692d3e","text":"What was the percentage increase in settlements with tax authorities relative to tax liabilities for the years 2013 and 2014, and how can this be calculated using available financial data?"}
{"_id":"q6168119c","text":"What is the formula to calculate the percentage change in total managed consumer loans from 2006 to 2007, and what are the specific loan amounts for those years?"}
{"_id":"q616a9d9a","text":"What is the percentage of total long-term borrowings that is due for repayment within the next 24 months, based on the latest financial statements?"}
{"_id":"q616a9700","text":"What is the formula to calculate the return on investment (ROI) for an investment in Abiomed Inc. from March 2007 to March 2010, and what are the specific price points or financial data needed for this calculation?"}
{"_id":"q61685404","text":"To determine the percentage change in net revenue from 2014 to 2015, what is the formula and data needed for the calculation?"}
{"_id":"q61693b4e","text":"What is the ratio of Snap-on Incorporated's stock performance to its peer group's performance as shown in the five-year stock performance graph for December 31, 2012? Please provide the calculation method and relevant data points needed for this analysis."}
{"_id":"q61659a66","text":"What were the operating expenses in millions for the year 2006, and where can I find the relevant financial data or reports?"}
{"_id":"q6164fbf6","text":"What percentage of the total purchase price is attributed to stock awards in the transaction? Please provide the calculation method and relevant financial data needed to determine this portion."}
{"_id":"q61672642","text":"What is the percentage of total contractual obligations and commitments that is comprised of debt principal and debt interest? Please provide the calculation method and relevant financial data needed to determine this percentage."}
{"_id":"q6168577e","text":"What is the total exposure to government-related derivatives, expressed in millions, based on the latest financial data available?"}
{"_id":"q6169283e","text":"What is the formula to calculate the number of outstanding common stock shares based on the total cash dividends paid? Please provide the necessary financial data or ratios needed for this calculation."}
{"_id":"q6168fc60","text":"What is the percentage increase in the carrying values of excess inventories for Protect from 2002 to 2003, and how can I calculate it using the relevant financial data?"}
{"_id":"q6169e77e","text":"What is the percentage of long-term debt maturities compared to total contractual obligations for future payments, including existing debt, lease commitments, and purchase obligations, due in 2012 as of December 31, 2009?"}
{"_id":"q6168b782","text":"What is the method to calculate the average of high and low stock prices for the first quarter of 2001, and what are the specific data points needed for this calculation?"}
{"_id":"q6165d4b8","text":"What was the percentage of capital expenditures for cable distribution systems relative to the total capital expenditures in the cable communications segment for the year 2014?"}
{"_id":"q616a22d4","text":"What is the percentage impact of cumulative effect adjustments, after accounting for income tax effects, on the beginning retained earnings for new accounting standards adopted by Cadence, specifically regarding the retained earnings balance as of December 30, 2017?"}
{"_id":"q61674df2","text":"To determine the total value of plan assets in 2008, considering the expected return rate on assets, what calculation method should be used to incorporate the return rate into the asset valuation? Please provide the relevant financial data or formulas needed for this calculation."}
{"_id":"q6168e5fe","text":"What is the comparison between purchase commitments as of December 31, 2015, and the expected lease commitments for 2016? Please provide data or analysis to determine if purchase commitments exceed the anticipated lease commitments for that year."}
{"_id":"q6169efda","text":"What was the ratio of qualified to non-qualified pension benefits in the US compared to international standards in 2016, and how can I calculate this using available pension data?"}
{"_id":"q616a12d0","text":"To determine the return on investment (ROI) for an investment of $100 in Snap-on from the end of 2008 to the end of 2010, what are the steps to calculate the ROI based on Snap-on's stock price at those two points in time?"}
{"_id":"q61668e76","text":"What is the formula to calculate the percentage change in impairment charges and net losses from 2003 to 2004, and what are the specific values for these metrics in those years?"}
{"_id":"q6166be6e","text":"What is the calculation method for determining the five-year total return on Goldman Sachs Group Inc., including dividends and stock price appreciation?"}
{"_id":"q616899c8","text":"What is the formula to calculate the rate of return on an investment in the NASDAQ index from 2010 to 2011, and what specific data points are needed to perform this calculation?"}
{"_id":"q616581ca","text":"What is the formula to calculate the rate of return on an investment in Cadence Design Systems Inc. from 2010 to 2011, and what are the specific stock price data points needed for this calculation?"}
{"_id":"q61688154","text":"What is the percentage change in the additions charged to expense for the allowance for doubtful accounts from 2011 to 2012, and how can I calculate it using the relevant financial data?"}
{"_id":"q616840ae","text":"What is the calculation method to determine the average net sales in millions for the three-year period ending in 2011, and what data sources provide this information?"}
{"_id":"q6169fe8a","text":"What was the total value of shares exercised in 2011, and how can I find the relevant financial data or reports to calculate this?"}
{"_id":"q61658396","text":"To determine the total number of shares owned by Arthur D. Levinson, including both direct and indirect shares, what is the method for calculating indirect share ownership based on available data?"}
{"_id":"q61669db2","text":"What is the ratio of square footage between properties in Alpharetta, Georgia, and Jersey City, New Jersey, as of December 2012, based on available real estate data?"}
{"_id":"q616521a8","text":"To enhance the relevance of the search results for this query, I will clarify the calculation process and specify the data points involved. Here’s the rewritten query:\n\n'What was the percentage of income tax benefits relative to stock-based compensation costs in 2010, and how can this be calculated using financial data?'"}
{"_id":"q61693234","text":"What is the cumulative total stockholder return percentage for Illumina Inc. common stock over the four-year period ending in 2003, and how can I calculate it using historical stock price data and dividends?"}
{"_id":"q616acc3e","text":"What is the formula to calculate the percentage change in free cash flow from 2001 to 2011, and what are the specific free cash flow values for those years?"}
{"_id":"q61698ac2","text":"What was the percentage reduction in expenses due to tax benefits in 2015, and how can I calculate it using relevant financial data?"}
{"_id":"q61696c0e","text":"What was the percentage change in the euro's value in 2016 compared to the previous year, and how does this reflect the total increase or decrease in its value?"}
{"_id":"q6165bee2","text":"What is the formula to calculate the percentage of total contractual obligations that consists of interest payments, and what data is needed to perform this calculation?"}
{"_id":"q61692a96","text":"What was the par value of the debt outstanding for the fixed-rate notes due February 2014 compared to the term loan due in 2011 as of December 31, 2010? Please provide the relevant financial data or sources for this comparison."}
{"_id":"q61657ab8","text":"What was the percentage decline in the allowance for doubtful accounts as of December 31, 2018, and how can I calculate it using the relevant financial data from that period?"}
{"_id":"q61692758","text":"What was the growth rate of money market funds in 2010, and how can I find the relevant financial data to calculate it?"}
{"_id":"q61691dee","text":"To determine the percentage of net revenue attributed to the retail electric price adjustment for the year 2016, what data points and calculations are needed to perform this analysis?"}
{"_id":"q61691236","text":"What is the formula to calculate the percentage of total discontinued operations in relation to total future minimum lease commitments? Please provide relevant data or examples to illustrate this calculation."}
{"_id":"q61664452","text":"What was the percentage of capital spending from continuing operations attributed to consumer packaging in 2005, and how can I find the relevant financial data to calculate this?"}
{"_id":"q6167287c","text":"What is the formula to calculate the percentage increase in the balance for the year 2007, and what data points are needed to perform this calculation?"}
{"_id":"q6165a880","text":"What is the formula to calculate the percentage change in capitalized interest from 2017 to 2018, and what are the relevant data points needed for this calculation?"}
{"_id":"q6165f0c4","text":"What is the formula to calculate the percentage decrease in total contingent acquisition payments from 2018 to 2019, and what are the specific payment figures for those years?"}
{"_id":"q6167a3d8","text":"What is the calculation method to determine the portion of net assets acquired that is attributed to goodwill in a business acquisition?"}
{"_id":"q61685e04","text":"What is the formula to calculate the percentage change in the balance of minority interests in consolidated subsidiaries from 2006 to 2007, and what are the specific data points needed for this calculation?"}
{"_id":"q6166c166","text":"To enhance the relevance of the search results for this query, I will clarify the calculation process and specify the data points involved. Here’s the rewritten query:\n\n'What is the formula to calculate the percentage change in the volatility factor, and what data is needed to perform this calculation?'"}
{"_id":"q6169cf1e","text":"What was the total gain on sales in millions for the year 2004, excluding any adjustments for impairments?"}
{"_id":"q6167d4c0","text":"What was the change in the allowance for doubtful accounts in 2008, and how can I calculate it using financial statements or accounting records?"}
{"_id":"q61669632","text":"What was the growth rate of total assets in 2013, and how can I calculate it using available financial data?"}
{"_id":"q61653cb0","text":"What is the method to calculate the average cash flow for the years 2004 to 2006 using historical financial data?"}
{"_id":"q616acf4a","text":"What is the percentage of total material obligations and commitments as of December 31, 2009, that are classified as capital leases, and how can I calculate this using the relevant financial data?"}
{"_id":"q6166b572","text":"What is the percentage of authorized repurchase capacity that remained under the stock repurchase program as of December 31, 2008, based on the available financial data?"}
{"_id":"q616ab0c8","text":"What is the percentage of total route miles that are classified as main line for the year 2005, based on available transportation data?"}
{"_id":"q616869a8","text":"What are the total contractual maturities of long-term debt obligations that are due after December 31, 2016, and how can I find the relevant financial data to calculate this?"}
{"_id":"q616a56be","text":"What is the percentage change in cash flows from operating activities, including discontinued operations, between the years 2008 and 2009? Please provide the necessary financial data or calculations to determine this change."}
{"_id":"q616679fe","text":"What is the calculation for the increase in total trading assets from 2007 to 2008, expressed in millions of dollars, based on available financial data?"}
{"_id":"q61689d7e","text":"To calculate the percentage of square footage in millions of owned facilities in other countries compared to the total square footage of all owned facilities, what is the formula and data needed for this calculation?"}
{"_id":"q61655b6e","text":"What is the percentage of intangible assets attributed to the realtor.com AE trademark license in the overall intangible assets valuation?"}
{"_id":"q616ac9a0","text":"What percentage of total smokeless product shipments in 2014 is attributed to the Copenhagen segment?"}
{"_id":"q6168a38c","text":"What is the calculation for the change in unrecognized tax benefits from the end of 2013 to the end of 2014, and what data sources provide this information?"}
{"_id":"q616a3652","text":"What is the overall impact of adopting new accounting standards on financial statements and business performance, including any changes in revenue recognition, expense reporting, and compliance costs?"}
{"_id":"q616a7a90","text":"What is the calculation for the change in average equity in millions from 2010 to 2011, and what data sources provide this information?"}
{"_id":"q616a04c0","text":"What is the calculation method to determine the portion of the aggregate carrying value of long-term debt that should be classified as a current liability for the financial statement as of December 31, 2006?"}
{"_id":"q616731e6","text":"What is the calculation method for determining the net change in the balance of employee separations liability for the year 2004, including relevant data points and adjustments?"}
{"_id":"q6169a9da","text":"What was the ratio of Intel's cumulative return to the Dow Jones U.S. Technology Index's cumulative return for the year 2010, and how can I calculate it using historical financial data?"}
{"_id":"q6169a0ca","text":"What is the formula to calculate the percent change in receivables from the money pool between the years 2007 and 2008, and what are the specific receivables data points needed for this calculation?"}
{"_id":"q616632d2","text":"What is the method to calculate the average expected dividend per share for the year 2007 based on historical financial data?"}
{"_id":"q61696fb0","text":"To determine the total balance for the company in 2018, including interest and penalty liabilities, what specific interest rates and penalty amounts should be considered? Please provide the relevant financial data for accurate calculation."}
{"_id":"q6165a682","text":"What is the total expected cash outflow in millions required to meet contractual obligations and commitments as of December 31, 2007, based on available financial data?"}
{"_id":"q61686c96","text":"What is the percentage of factory retail stores located in Japan as of March 29, 2008, based on available retail industry data?"}
{"_id":"q616554fc","text":"To enhance the relevance of the search results for this query, I will clarify the calculation process and the relationships between the data points involved. Here’s the rewritten query:\n\n'What is the ratio of other comprehensive income to net income when adopting the prospective method, specifically regarding the reclassification of certain separate accounts to the general account? Please provide relevant formulas or examples.'"}
{"_id":"q616a0754","text":"What is the calculation for the net change in net revenue for Entergy Louisiana in 2004, and what specific financial data or reports should I reference to obtain this information?"}
{"_id":"q6167e24e","text":"What is the projected total number of restricted stock units (RSUs) expected to vest over the next few years based on current vesting schedules and company performance metrics?"}
{"_id":"q61671210","text":"What percentage of the total consolidated revenues in 2015 was contributed by the GFS segment, and how can I calculate this using the available financial data?"}
{"_id":"q61695c96","text":"What is the percentage of total net revenue that net interest income represented in 2014, and how can I calculate this using financial statements or reports?"}
{"_id":"q61695e76","text":"What is the operating margin for the 4th quarter of the most recent fiscal year, and how does it compare to previous quarters?"}
{"_id":"q61673c68","text":"What is the method to calculate the aggregate carrying value of long-term debt as of December 31, 2009, including any relevant adjustments or amortization factors?"}
{"_id":"q61688ed8","text":"What is the total impact of reclassifying specific separate accounts to the general account on net income and other comprehensive income, including any relevant calculations or adjustments needed to assess these effects?"}
{"_id":"q6165d24c","text":"What was the percentage of total TDRs (Troubled Debt Restructurings) associated with commercial loans in 2012, and how can I calculate this using available financial data?"}
{"_id":"q616699ca","text":"To determine the increase in net income in millions for the years 2004 and 2005, excluding employee severance costs, what calculations or data adjustments are necessary? Please provide the relevant financial data for those years."}
{"_id":"q616a1e24","text":"What is the formula to calculate the return on investment (ROI) for an investment in State Street Corporation from 2011 to 2012, and what are the specific financial data points needed for this calculation?"}
{"_id":"q616a6578","text":"What is the formula to calculate the percentage of operating lease obligations relative to total obligations, and what data is needed to perform this calculation?"}
{"_id":"q616abac8","text":"What is the percentage of long-term debt that was paid off in 2021, and how can I calculate it using the total long-term debt figures from that year?"}
{"_id":"q616a0c36","text":"To enhance the relevance of the search results for this query, I will clarify the calculation process and specify the data points involved. Here’s the rewritten query:\n\n'What is the percentage of reserves allocated for environmental remediation of sites in 2015, and how is this calculated based on available financial data?'"}
{"_id":"q6167c93a","text":"What was the percentage of GCLA (Global Currency Liquidity Assets) held in non-U.S. dollar denominated assets in 2013, and how can I find the relevant financial data to perform this calculation?"}
{"_id":"q616a3ed6","text":"What was the percentage of the total volume and support incentives in September 2008 that was allocated for 2009? Please provide the relevant data or calculations needed to determine this percentage."}
{"_id":"q6165b712","text":"What percentage of the total principal transactions revenue in 2018 can be attributed to interest rate risks, and how can this calculation be performed using available financial data?"}
{"_id":"q6165a178","text":"What is the percentage increase in total residential mortgages from 2011 to 2012, and how can I calculate it using available mortgage data?"}
{"_id":"q61659908","text":"What is the formula to calculate the percentage change in inventory balance for the year 2014, and what data points are needed to perform this calculation?"}
{"_id":"q6169c8ca","text":"What is the percentage difference in total cumulative return on investment between United Parcel Service Inc. (UPS) and the Dow Jones Transportation Average for the five-year period ending December 31, 2012? Please provide the necessary data and calculation methods."}
{"_id":"q6165c202","text":"What is the percentage of total future minimum commitments from existing non-cancelable leases and purchase obligations that is due in 2008, as of December 31, 2006? Please provide the calculation process and relevant data points needed for this analysis."}
{"_id":"q61693694","text":"What is the calculation for the decrease in net undeveloped acres expiring from 2015 to 2016, and what are the specific data points needed to determine this change?"}
{"_id":"q616a1668","text":"To enhance the relevance of the search results for this query, I will clarify the calculation process and specify the data points involved. Here’s the rewritten query:\n\n\"What was the percentage of total net cash collateral from credit derivatives in 2007, and how is it calculated based on available financial data?\""}
{"_id":"q61699e04","text":"What is the current amount of total future minimum lease payments that are due, and how can I calculate this using the relevant financial data?"}
{"_id":"q616788e4","text":"What is the formula to calculate the percentage increase in port costs between 2010 and 2012, and what are the specific cost figures for those years?"}
{"_id":"q61676e18","text":"What was the percentage change in pretax losses from foreign exchange transactions in 2007, and how can I calculate it using available financial data?"}
{"_id":"q6167aa86","text":"What is the total decrease in the fair value of restricted stock that vested in 2017 compared to 2018, and how can I calculate this using available financial data?"}
{"_id":"q61655664","text":"What would be the total deemed proceeds to the company if all options in the approved compensation plans by security holders were fully exercised? Please provide the calculation method and any relevant financial data needed to determine this amount."}
{"_id":"q6167c5f2","text":"What is the percentage of the total outstanding amount that is attributed to notes payable, which are due within one year of issuance or on demand, based on the latest financial statements?"}
{"_id":"q61680274","text":"What was the percentage of scheduled maturities of long-term debt relative to the total long-term debt as of December 31, 2012? Please provide the necessary financial data or calculations to determine this ratio."}
{"_id":"q616959b2","text":"What is the percentage of the estimated purchase price that is attributed to developed technology and know-how, and how can this be calculated using available financial data?"}
{"_id":"q61680558","text":"What is the average amount in millions of construction-in-progress impairment charges written off from 2003 to 2005, and how can I calculate this using available financial data?"}
{"_id":"q616a5c18","text":"What percentage of the total reserves allocated for environmental contingencies in 2018 is attributed to glass and chemical sectors?"}
{"_id":"q6166cb66","text":"What is the total number of shares that vested over the three-year period, and how can I find the relevant data or calculations to determine this?"}
{"_id":"q616964d4","text":"What is the percentage impact on the effective tax rate if the balance of unrecognized tax benefits at the end of 2008 is recognized? Please provide the calculation method and relevant financial data needed for this analysis."}
{"_id":"q616885fa","text":"What percentage do commercial mortgage loans held for sale at fair value on December 31, 2012 represent of the total loans held for sale? Please provide the necessary data or calculations to determine this percentage."}
{"_id":"q61656b54","text":"What was the total Tier 1 capital in millions for the fourth quarters of 2017 and 2016, and how can I calculate the year-over-year change based on available financial data?"}
{"_id":"q616823d0","text":"What is the total rent expense in millions for the fiscal years 2010, 2011, and 2012 based on available financial reports?"}
{"_id":"q616a9e9e","text":"What is the calculation for the difference in capital spending related to business acquisitions in millions of dollars between the years 2010 and 2011?"}
{"_id":"q6166564a","text":"What was the percentage of Company 2019's aggregate principal payments of long-term debt that were due in 2008, based on data available as of December 31, 2004?"}
{"_id":"q61685d14","text":"What is the percentage growth of the 5-year cumulative total return for the 2018 peer group when comparing the years 2016 and 2017, and how can I calculate it using the relevant financial data?"}
{"_id":"q6164f962","text":"What is the percentage of total leased facilities, measured in square feet, compared to the overall total square footage of all facilities?"}
{"_id":"q6167707a","text":"What is the total favorable variance that positively impacted net revenue in 2011, and how can I calculate it using available financial data?"}
{"_id":"q6166120c","text":"What is the method to calculate the total fair value of non-vested shares as of September 26, 2009, using relevant financial data and valuation techniques?"}
{"_id":"q61672318","text":"What is the calculation for the change in millions of dollars in company contributions to employee benefit retirement plans from 2007 to 2008, and what are the specific contribution amounts for each year?"}
{"_id":"q616ab604","text":"What is the formula to calculate the percentage change in the fair value of the company's interest in PennyMac from 2016 to 2017, and what are the specific fair value figures for those years?"}
{"_id":"q6167d27c","text":"To find the percentage change in expected volatility from 2008 to 2009, what is the formula and data needed to calculate this change?"}
{"_id":"q616734b6","text":"What percentage of the total net reserves is attributed to the London market, and how can this be calculated using available financial data?"}
{"_id":"q61669c9a","text":"What is the formula to calculate the percent change in expected volatility from 2012 to 2013, and what are the specific expected volatility values for those years?"}
{"_id":"q616a3760","text":"What is the percentage of cash held on behalf of General Electric (GE) relative to its total cash and cash equivalents for the year 2017, and how can I calculate this using the relevant financial data?"}
{"_id":"q6167fe1e","text":"What is the formula to calculate the percentage change in net sales for discontinued operations from 2008 to 2009, and what are the relevant financial figures needed for this calculation?"}
{"_id":"q61680eae","text":"What is the tax rate applied to net earnings from the gain on the sale of aggregate ownership interests in EnLink's discontinued operations? Please provide details on how to calculate this tax rate based on relevant financial data."}
{"_id":"q61666040","text":"What is the formula to calculate the percent change in net unrealized loss on available-for-sale securities from 2008 to 2009, and what are the specific values for those years?"}
{"_id":"q6165e2d2","text":"What is the total number of shares of common stock outstanding as of December 31, 2004, and where can I find the relevant financial reports or data sources to verify this information?"}
{"_id":"q61676076","text":"What percentage of the total costs in 2018 were attributed to service costs, and how can I calculate this using available financial data?"}
{"_id":"q61670540","text":"How many million shares of common stock did the company repurchase in the open market for the years ended December 31, 2018, and 2017, and what were the total amounts for each year?"}
{"_id":"q616a9854","text":"What was the percentage of total freight revenues attributed to the intermodal commodity group in 2015, and how can I calculate this using available freight revenue data?"}
{"_id":"q616a08d0","text":"What is the percentage of the total network route mileage that is owned by the company, excluding the leased routes? Please provide the necessary data for calculation."}
{"_id":"q6165d8a0","text":"What is the percentage decrease in potential maximum exposure from the beginning to the end of 2012, based on available financial data?"}
{"_id":"q6166e100","text":"What is the formula to calculate the percentage change in pension benefits from 2006 to 2010, and what are the specific benefit amounts for those years?"}
{"_id":"q6165d9e0","text":"What is the formula to calculate the percentage of goodwill relative to the estimated purchase price in a business acquisition?"}
{"_id":"q6167b47c","text":"What is the percentage contribution of Project K to the total Selling, General, and Administrative (SGA) expenses for the year 2013?"}
{"_id":"q61664ae2","text":"To find the average segment net sales in millions from 2005 to 2007, what is the calculation process and the specific data points needed for this analysis?"}
{"_id":"q6169a50c","text":"What is the percentage of securities borrowed that were valued at fair value as of December 31, 2015, based on available financial data?"}
{"_id":"q6169af02","text":"How to calculate the growth rate in net income for Bermuda subsidiaries from 2007 to 2008 using financial data?"}
{"_id":"q616ad18e","text":"What was the per share value of Hologic common stock at the time of purchase, and how can I find historical stock price data for that specific date?"}
{"_id":"q6166a096","text":"What is the change in unresolved asserted indemnification and repurchase claims in millions for home equity between December 31, 2012, and December 31, 2011? Please provide the calculation process and relevant data points for these claims."}
{"_id":"q616a6c12","text":"What is the percentage growth rate in rent expenses and office equipment expenses from 2013 to 2014, and how can I calculate these rates using available financial data?"}
{"_id":"q616981ee","text":"What is the formula to calculate the percentage change in impairment charges and net losses from 2004 to 2005, and what are the specific values for these metrics in those years?"}
{"_id":"q616887b2","text":"What is the percentage of total contractual obligations in 2010 that is attributed to long-term debt obligations, and how can I calculate this using available financial data?"}
{"_id":"q616ab9a6","text":"What was the percentage of capital expenditures allocated to customer premise equipment in the cable segment for the year 2006?"}
{"_id":"q616898a6","text":"What is the total change in unrecognized tax benefits in millions of dollars from January 1, 2011, to December 31, 2011, based on available financial statements or tax reports?"}
{"_id":"q61669466","text":"What is the total amount capitalized to assets from compensation expenses related to long-term compensation plans, restricted stock, and stock options for the years ending December 31, 2011, and 2010, expressed in millions?"}
{"_id":"q616a0628","text":"What is the percentage of total debt repayments attributed to contractual obligations for future payments under existing debt, lease commitments, and purchase obligations due in 2008, based on data as of December 31, 2006?"}
{"_id":"q6168d8fc","text":"What is the percentage increase in the senior credit facility maturity from October 24, 2017, to October 24, 2018, based on available financial data?"}
{"_id":"q6168bc46","text":"To clarify the calculation process and enhance the relevance of the search results, the rewritten query could be:\n\n\"What is the percentage change in the weighted average fair value of ESPP shares purchased from 2005 to 2007, and how can I calculate it using historical share price data?\""}
{"_id":"q61678e66","text":"What is the percentage difference between the carrying value and the fair value of an asset? How can I calculate how much lower the carrying value is compared to the fair value?"}
{"_id":"q6167f734","text":"What is the calculated decrease in operating lease payments due within 3-5 years compared to those due in more than 5 years, based on the latest financial data?"}
{"_id":"q6166677a","text":"What is the method to calculate the average total revenue for the years 1999, 2000, and 2001 using available financial data?"}
{"_id":"q61686282","text":"What was the percentage of labor-related deemed claims in relation to the total reorganization items net as of December 31, 2013? Please provide the necessary data or calculations to determine this percentage."}
{"_id":"q616851fc","text":"What is the calculation for the decrease in the effective tax expense rate from 2015 to 2016, and what data sources provide this information?"}
{"_id":"q61652a68","text":"What is the percentage of net interest revenue relative to total operating expenses for the year 2009, and how can I calculate this using financial data?"}
{"_id":"q616714c2","text":"What was the net interest income reported in the consolidated statements of earnings for the year 2016, expressed in billions?"}
{"_id":"q6166ec4a","text":"What is the method to calculate the average price paid per share for the periods from October 1, 2013, to October 31, 2013, and from November 1, 2013, to November 30, 2013, using historical stock price data?"}
{"_id":"q61653486","text":"What is the total value of stock options canceled in millions for the years 2015, 2016, and 2017, and how can I find this data from financial reports or stock option databases?"}
{"_id":"q61678682","text":"What is the average reserve for losses, in millions, for the years 2011 and 2012 based on available financial data?"}
{"_id":"q61665d48","text":"What is the method to calculate the average cost per share for share repurchases made in 2012, and what data sources provide this information?"}
{"_id":"q61685616","text":"To find the ratio of shares excluded from the calculation of diluted earnings in 2012 compared to 2011 due to their anti-dilutive nature, what data points and calculations are needed?"}
{"_id":"q616a01fa","text":"What is the percentage of total other liabilities and accrued expenses in 2013 that is attributed to compensation and benefits, and how can I calculate this using financial data?"}
{"_id":"q6166a550","text":"What is the total outstanding amount in millions of dollars for the year 2009, and how can I find the relevant financial data or reports to calculate this?"}
{"_id":"q616684d0","text":"What is the percentage decrease in average borrowings from 2016 to 2017, and how can I calculate it using the relevant financial data?"}
{"_id":"q616794a6","text":"What was the total value in million dollars of the contracted backlog for fixed price contracts as of December 31, 2011?"}
{"_id":"q6168db2c","text":"What is the percentage of the total route mileage that is owned by the company for both the main line and branch line routes? Please provide the necessary data for calculation."}
{"_id":"q616671de","text":"What was the percentage change in recorded net losses from 2007 to 2008 due to the sales of non-core towers and other assets? Please provide the relevant financial data or calculations needed to determine this percentage change."}
{"_id":"q616a0394","text":"What percentage of total contractual obligations and off-balance sheet arrangements is attributed to operating leases for which we are the primary obligor? Please provide the calculation method and relevant data sources."}
{"_id":"q6165e750","text":"What was the percentage of capital expenditures for cable distribution systems relative to the total capital expenditures in the cable communications segment for the year 2015?"}
{"_id":"q6168003a","text":"To determine if the weighted average useful life (in years) for trademarks is greater than that for customer contracts and relationships, what are the specific weighted average useful life values for each category?"}
{"_id":"q6165f2fe","text":"What is the impact of the money pool balance on the cash flow of Entergy Gulf States Louisiana from 2007 to 2008, specifically in thousands of dollars? Please provide data or analysis on this relationship."}
{"_id":"q616a7982","text":"To enhance the relevance of the search results for this query, I will clarify the calculation process and specify the data points involved. Here’s the rewritten query:\n\n'What is the total sum of temporary differences in billions between the years 2007 and 2009, and how can I calculate it using available financial data?'"}
{"_id":"q6166d4c6","text":"What is the percentage of the cumulative 5-year total shareholder return on common stock for Fidelity National Information Services, Inc. as of December 16, 2023, and how is this calculated using historical stock price data?"}
{"_id":"q6169776c","text":"What is the calculation method to determine the average net sales in millions for MFC from 2014 to 2016 using available financial data?"}
{"_id":"q61672444","text":"What was the ratio of the percentage of outstanding shares to the authorized repurchase of the company's common stock as of December 2012, and how can I calculate this using available financial data?"}
{"_id":"q6168dece","text":"What was the percentage of total aggregate restructuring charges recorded in 2010, and how does it compare to previous years?"}
{"_id":"q6166fa8c","text":"What is the formula to calculate the percentage change in the total carrying amount of goodwill from 2015 to 2017, and what are the specific goodwill values for those years?"}
{"_id":"q6167d722","text":"What was the total decline in commercial paper issued by conduits in 2003, expressed in billions of dollars (b)? Please provide the relevant data or sources for this calculation."}
{"_id":"q616925a0","text":"What were the total operating costs in millions for the year 2011, and how can I find the relevant financial data or reports to calculate this?"}
{"_id":"q6169aff2","text":"How can I calculate the difference between total sales and total payments received for the year 2013 using financial data?"}
{"_id":"q6168f97c","text":"What would the revenue-ton-miles have been in 2011 if there were no increases in carloads and no changes in the mix of cargo? Please provide the necessary data or calculations to determine this figure."}
{"_id":"q616a704a","text":"What is the calculation method to determine the proportion of total global headquarters leases compared to total other operating leases using available financial data?"}
{"_id":"q616720c0","text":"What is the total share-based compensation expense incurred over the last three fiscal years, and how can I find the relevant financial data to calculate this?"}
{"_id":"q6165e4e4","text":"To enhance the relevance of the search results for this query, I would rewrite it as follows:\n\n\"What is the percentage of unrecognized tax benefits that could impact earnings for the year 2018, and how can this be calculated using financial data?\""}
{"_id":"q61688334","text":"To determine the total value of average interest-earning assets in millions of dollars for 2018, considering the net interest yield on a managed basis, what specific data or formulas should I use to perform this calculation?"}
{"_id":"q616569d8","text":"What was the change in the fair value of financial market instruments used in hedging strategies during the year 2010, and how can this be calculated using relevant financial data?"}
{"_id":"q61694ef4","text":"What is the total equity value in millions of dollars for the year 2009, and how can I find the relevant financial data or reports to calculate this?"}
{"_id":"q616504de","text":"To determine if Altria outperformed the S&P 500, what are the specific metrics or timeframes for comparison, such as total return percentages or stock price changes over the last year?"}
{"_id":"q6166ad98","text":"To determine if the weighted average useful life (in years) for purchased technology exceeds that of localization, what are the specific data points or calculations needed to compare these two metrics?"}
{"_id":"q616828bc","text":"What is the method to calculate the difference in balance growth throughout the fiscal year for 2007 and 2008, and what specific data points should I consider for this analysis?"}
{"_id":"q616a2a68","text":"To find the total research and development expenditure in millions for the years 2014, 2015, and 2016, what are the specific data points or sources that provide this information?"}
{"_id":"q61684c52","text":"To determine if the environmental reserves for 2018 exceed the asbestos-related claim reserves, what is the comparison of the total environmental reserves in 2018 against the total asbestos-related claim reserves for the same year?"}
{"_id":"q616957be","text":"What is the percentage difference in the five-year cumulative return between Intel and the S&P 500 index for the period ending in 2013, and how can I calculate it using historical financial data?"}
{"_id":"q61650984","text":"What is the formula for calculating the debt-to-asset ratio, and how can it be interpreted in terms of financial health?"}
{"_id":"q61675c3e","text":"How to calculate the net income margin for Q3 2014 using financial statements and relevant data?"}
{"_id":"q61656dde","text":"What is the five-year total return for Ball Corporation stock compared to the DJ US Containers & Packaging Index for the period ending December 31, 2012, and how much greater is Ball Corporation's return?"}
{"_id":"q6165ab46","text":"What was the change in equity investment balances, including unfunded commitments, in millions of dollars between December 31, 2014, and December 31, 2013? Please provide the calculation process and relevant data sources."}
{"_id":"q61680148","text":"To clarify the calculation and improve search relevance, the rewritten query could be:\n\n\"What is the percentage of total securities to be issued upon the exercise of outstanding options compared to the total number of outstanding options?\""}
{"_id":"q6167455a","text":"What is the percentage growth of the S&P 500 index from 2016 to 2017, and how can I calculate it using the index values at the beginning and end of that period?"}
{"_id":"q6166391c","text":"What was the percentage of employees who received termination notices and were actually terminated as of September 30, 2005, based on available employment data?"}
{"_id":"q6169ba4c","text":"What is the calculation for the difference in billions of High-Quality Liquid Assets (HQLA) between December 31, 2014, and December 31, 2015, based on available financial data?"}
{"_id":"q6166c76a","text":"To determine the percentage of purchase obligations related to total expenses for payments due within a year, how can I calculate this using available financial data?"}
{"_id":"q61657c52","text":"What is the percentage of total shares purchased that were repurchased through open-market transactions, and how can I calculate this using available stock transaction data?"}
{"_id":"q616545a2","text":"What is the formula to calculate the percentage change in cash flows from operations between the years 2014 and 2015, and what are the specific cash flow figures for those years?"}
{"_id":"q6168da3c","text":"What is the total value, in millions, of issued guarantees and comfort letters for both consolidated subsidiaries and non-consolidated affiliates? Please provide the relevant financial data or reports needed for this calculation."}
{"_id":"q6167f202","text":"What was the growth rate of operating expenses in 2014, and how can I calculate it using financial data from that year?"}
{"_id":"q6166bb12","text":"What was the average size in square feet of call centers in 2017, and what data sources or reports provide this information?"}
{"_id":"q616a835a","text":"What is the percentage of total future minimum commitments under operating leases that is due within the next 36 months, and how can I calculate this using available financial data?"}
{"_id":"q6169b650","text":"What is the percentage of total restructuring costs attributed to employee-related expenses, and how can I calculate this using available financial data?"}
{"_id":"q6169bdf8","text":"What is the total number of grants that were forfeited, and how can I find the relevant data or reports detailing these forfeitures?"}
{"_id":"q616a4eda","text":"What is the percentage of net cash provided by operations that was retained as cash flow in 2006, and how can I calculate this using financial statements or cash flow reports?"}
{"_id":"q6168d26c","text":"What is the value of the 2014 contingent consideration in millions, excluding the impact of foreign currency translation adjustments?"}
{"_id":"q6167e690","text":"To determine the percentage effect of hedges on the anticipated increase in fuel expenses for 2014, what calculations or data points should I consider? Specifically, how do I quantify the impact of hedging strategies on the projected rise in fuel costs for that year?"}
{"_id":"q61699ce2","text":"To determine the annual interest expense on the fixed rate notes due in March 2018 after the hedge transaction, what specific interest rate and principal amount should be used in the calculation? Please provide the relevant financial data and any adjustments made due to the hedge transaction."}
{"_id":"q6165e9a8","text":"What is the formula to calculate the percentage change in S&P 500 stock performance from 2014 to 2015, and what were the specific index values for those years?"}
{"_id":"q6168ec84","text":"What percentage of total energy sector employees are represented by labor unions, and how can I find the relevant statistics or data sources for this calculation?"}
{"_id":"q6166af00","text":"What is the percentage decrease in liabilities for accrued interest and penalties from 2012 to 2013, and how can I calculate it using the relevant financial data?"}
{"_id":"q6165e1f6","text":"What is the maximum allowable depreciation rate for furniture, fixtures, and equipment according to current tax regulations?"}
{"_id":"q6168586e","text":"What is the percentage change in the company's uncertain tax positions from 2007 to 2008, based on the financial data for those years?"}
{"_id":"q6166aa6e","text":"What percentage of unrecognized tax benefits would affect the effective tax rate if they were recognized, and how can this impact be calculated using financial statements?"}
{"_id":"q6168bd72","text":"What is the calculation for the five-year change in the S&P 500 index, including the percentage increase or decrease from the starting value to the current value?"}
{"_id":"q61695f5c","text":"What is the formula to calculate the percent change in the aggregate net asset values of direct lending collateral pools from 2007 to 2008, and what are the specific net asset values for those years?"}
{"_id":"q61674d0c","text":"What were the total market making revenues reported in the consolidated statements of earnings for the year 2017, expressed in billions?"}
{"_id":"q6168ea40","text":"What is the formula to calculate the percentage change in accrued interest liability from 2017 to 2018, and what are the relevant data points needed for this calculation?"}
{"_id":"q6168317c","text":"What was the percentage of the outstanding authorized purchase capacity from the October 2015 plan as of December 31, 2016, and how can I calculate it using the relevant data?"}
{"_id":"q6166f38e","text":"What is the total increase in net asbestos reserves due to unfavorable development in assumed reinsurance accounts, considering the same factors affecting direct policyholders? Please provide the calculation process and relevant data points needed for this analysis."}
{"_id":"q616640d8","text":"What is the average annual expense incurred by the company for profit sharing and other savings plan contributions from 2013 to 2015, expressed in millions?"}
{"_id":"q6169ac64","text":"What percentage do the specific reserves represent of the total TDR (Troubled Debt Restructured) portfolio as of December 31, 2012? Please provide the calculation method and relevant data sources."}
{"_id":"q61675e96","text":"What is the total fair value in millions of dollars for restricted stock awards that vested in 2005, 2006, and 2007? Please provide the data or calculations needed to determine this total vesting date fair value."}
{"_id":"q6169471a","text":"To determine the percentage of the minimum supplementary leverage ratio that is comprised of a buffer within the capital framework, what is the calculation process and the relevant data points needed?"}
{"_id":"q61687e2a","text":"What percentage of unrecognized tax benefits as of December 31, 2008, would not affect the effective tax rate if they were recognized, and how can this be calculated using relevant financial data?"}
{"_id":"q6168efae","text":"What was the effective tax rate applied to the goodwill impairment charge reported in the fourth quarter of 2008, and how can I find the relevant financial statements or reports that detail this information?"}
{"_id":"q61678cf4","text":"What is the return on investment (ROI) for Applied Materials if the investment made in October 2013 was sold five years later, and what are the specific financial figures needed to perform this calculation?"}
{"_id":"q6165e854","text":"What is the method to calculate the average total revenue for the years 1999, 2000, and 2001 using available financial data?"}
{"_id":"q6167924e","text":"What percentage of unrealized losses was offset by foreign currency translation in 2006, and how can I calculate this using relevant financial data?"}
{"_id":"q61691678","text":"What is the lowest effective tax rate recorded during the three-year period, and how can I find the relevant data or calculations to determine this?"}
{"_id":"q61670f40","text":"What was the minimum collateral posted in millions for the years 2012 and 2013, and how can I find the relevant financial data for these years?"}
{"_id":"q61662aa8","text":"What is the mathematical range of deferred acquisition payments in millions from 2018 to 2022, and how can I calculate it using the available financial data for those years?"}
{"_id":"q6166c03a","text":"What was the percentage of allowances for doubtful accounts in 2013, and how is it calculated based on total accounts receivable?"}
{"_id":"q61660f14","text":"What is the percentage increase in minimum pension liability from 2004 to 2006 based on available financial data?"}
{"_id":"q61698f54","text":"What were the net sales figures in millions for the top five customers in 2019, specifically for the segment in 2006?"}
{"_id":"q61673d94","text":"To enhance the relevance of the search results for this query, I will clarify the calculation process and specify the data points involved. Here’s the rewritten query:\n\n'What was the percentage change in the outstanding amount of ATI 7.25% notes from 2005 to 2006, and how can I calculate it using financial data?'"}
{"_id":"q6167bd1e","text":"What is the formula to calculate the percentage change in the outstanding debt for the 3.00% notes from 2007 to 2008, and what are the specific outstanding debt figures for those years?"}
{"_id":"q61660a1e","text":"To determine the increase in the total value of stock options observed during 2016 and 2017, considering the average exercise price of options, how can I calculate the difference in total stock option values for these two years in millions of dollars? Please provide relevant data sources or methodologies for this calculation."}
{"_id":"q616a8efe","text":"What is the percentage of the total purchase amount that was paid in cash, based on the available payment breakdown?"}
{"_id":"q616586ca","text":"What is the total amount of credit lines drawn in millions of dollars as of December 31, 2016, based on available financial reports?"}
{"_id":"q61698dec","text":"What is the formula to calculate the percent change in basic net income available for common shareholders from 2006 to 2007, and what are the specific net income values for those years?"}
{"_id":"q6167ff36","text":"What is the percentage of recourse debt that matures in 2015 relative to the total recourse debt as of December 31, 2010? Please provide the necessary financial data or calculations to determine this percentage."}
{"_id":"q61680c06","text":"To find the ratio of restricted cash and marketable securities to the allowance for doubtful accounts in December 2015, what are the specific values for restricted cash, marketable securities, and the allowance for doubtful accounts from the financial statements?"}
{"_id":"q6167cdd6","text":"What were the receivables in millions from the money pool for Entergy Gulf States Louisiana from 2008 to 2011, specifically for the year 2019?"}
{"_id":"q6165edd6","text":"What is the calculation method to determine the portion of long-term debt that is due within the next 12 months based on the company's financial statements?"}
{"_id":"q616608d4","text":"What is the minimum capital requirement in millions as defined by the net capital rule, and how is it calculated based on the financial regulations?"}
{"_id":"q616829f2","text":"What is the formula to calculate the percentage change in the impact of the euro from 2011 to 2012, and what are the relevant data points needed for this calculation?"}
{"_id":"q616904bc","text":"What is the formula to calculate the percent change in earnings for basic and diluted EPS (Earnings Per Share) from 2013 to 2014, and what are the specific earnings values for both years?"}
{"_id":"q6166143c","text":"What was the percentage of the pre-tax gain recognized relative to the proceeds from the sale of the global branded pharmaceuticals businesses in 2006? Please provide the relevant financial data or calculations needed to determine this ratio."}
{"_id":"q616a76f8","text":"What is the percentage of total minimum capital lease payments that are due in 2021, based on the available financial data?"}
{"_id":"q616516e0","text":"What was the total fair value in billions of assets segregated for the benefit of securities and futures brokerage customers in 2009 and 2010, and how can I find this data?"}
{"_id":"q6168a468","text":"What is the formula to calculate the percentage change in net sales from 2017 to 2018, and what were the net sales figures for those years?"}
{"_id":"q616998fa","text":"What is the average value of \"other\" loans for the years 2011 and 2012 based on available financial data?"}
{"_id":"q616649c0","text":"How to calculate the growth rate in the average price of repurchased shares from 2005 to 2006 using historical financial data?"}
{"_id":"q6167474e","text":"What is the calculation for the difference in cumulative total return between A. O. Smith Corp and the S&P Small Cap 600 Index for the five-year period ending December 31, 2010, based on historical financial data?"}
{"_id":"q6165475a","text":"What was the calculation method for determining the ratio of collateral pledged to the bank by derivatives counterparties compared to overnight and other short-term borrowings as of December 31, 2010?"}
{"_id":"q616a2c02","text":"What is the calculation method for determining the net change in the balance of employee separations liability for the year 2005, including relevant data points and adjustments?"}
{"_id":"q61656cb2","text":"What is the five-year total return for Ball Corporation stock compared to the S&P 500, specifically for the period ending December 31, 2012, and how much greater is Ball Corporation's return than that of the S&P 500?"}
{"_id":"q616a2cf2","text":"What is the total amount, in millions, of accumulated other comprehensive loss reported in the latest financial statements?"}
{"_id":"q6169c672","text":"What is the formula to calculate the percentage increase in cash flows from operations between the years 2015 and 2016, and what are the specific cash flow values for those years?"}
{"_id":"q6167525c","text":"What is the formula to calculate the percentage change in inventories from 2015 to 2016, and what are the specific inventory values for those years?"}
{"_id":"q61664588","text":"What were the total operating expenses for the year 2016, and how can I find the relevant financial data or reports to calculate this figure?"}
{"_id":"q616a885a","text":"To determine the cost to the company if the remaining securities are exercised at a price of $113.49, what is the total cost calculation based on the number of securities remaining and their exercise price?"}
{"_id":"q6167dd08","text":"What is the calculation for the ratio of total office space in the United States compared to the office space specifically allocated for corporate headquarters in Bellevue?"}
{"_id":"q61683078","text":"What percentage did inventory represent of the total working capital in 2005, and how can I find the relevant financial data to perform this calculation?"}
{"_id":"q61696e34","text":"What was the ratio of debt maturities scheduled for the years 2015 to 2018 as of December 31, 2014, and how can I calculate it using available financial data?"}
{"_id":"q616a353a","text":"What is the formula to calculate the percent change in depreciation and amortization expense from 2004 to 2005, and what are the specific expense values for those years?"}
{"_id":"q61663fde","text":"What is the calculation method to determine the total fair value of non-vested performance awards at the beginning of the year, expressed in thousands?"}
{"_id":"q616522de","text":"What is the percentage change in gross liability for unrecognized tax benefits from 2007 to 2008, and how can I calculate it using the relevant financial data?"}
{"_id":"q61697b90","text":"What percentage of the total purchase price of Blockbuster was attributed to hard assets? Please provide the calculation method and relevant financial data."}
{"_id":"q61651578","text":"What percentage does the combined total of accrued interest and penalties from tax positions on our tax returns represent of the total ending balance of non-current income taxes payable as of November 28, 2008?"}
{"_id":"q61669eac","text":"What is the formula to calculate the percentage decrease in the weighted average interest rates on outstanding borrowings from 2010 to 2011, and what are the specific interest rate values for those years?"}
{"_id":"q6168e932","text":"What is the formula to calculate the percentage change in net sales for discontinued operations from 2009 to 2010, and what are the relevant figures needed for this calculation?"}
{"_id":"q6168cc5e","text":"What is the percentage change in the weighted average cost per share from 2015 to 2016, and how can I calculate it using the relevant financial data?"}
{"_id":"q616642cc","text":"What is the formula to calculate the percentage change in total wholesale credit exposure from 2009 to 2010, and what are the relevant data points needed for this calculation?"}
{"_id":"q616933b0","text":"What is the percentage of total net revenue that net interest income represented in 2015, and how can I calculate this using financial statements or relevant data?"}
{"_id":"q6169b538","text":"What was the percentage of non-voting shares among the total common stock outstanding as of December 31, 2004, based on available financial data?"}
{"_id":"q6165f47a","text":"What is the total number of acres expiring in millions for the 'Other Africa' region, based on the latest agricultural land data?"}
{"_id":"q616789f2","text":"What is the calculation for the change in level 3 financial assets in millions from 2016 to 2017, and what are the relevant data points needed to determine this change?"}
{"_id":"q616a1a78","text":"What is the percentage increase in net cash from operations from 2004 to 2006, and how can I calculate it using the financial data for those years?"}
{"_id":"q616aa68c","text":"What was the percentage of total debt attributed to lease obligations for discontinued operations and businesses held for sale in 2007, and how can this be calculated using financial statements or relevant economic data?"}
{"_id":"q6168f59e","text":"What is the total amount in millions for specific reserves in the ALLL (Allowance for Loan and Lease Losses) over the past two years?"}
{"_id":"q61653dfa","text":"What is the total value, in millions, of securities that have been issued and approved by security holders, and how can I find the relevant data or reports to calculate this?"}
{"_id":"q61665758","text":"What is the formula to calculate the growth rate of net revenue from 2014 to 2015, and what data points are needed to perform this calculation?"}
{"_id":"q616843ce","text":"What is the percentage of total cumulative return on investment for United Parcel Service Inc. (UPS) over the five-year period ending December 31, 2012, based on historical financial data?"}
{"_id":"q616790e6","text":"What is the formula to calculate the percentage decline in operating loss from 2007 to 2008, and what were the specific operating loss figures for those years?"}
{"_id":"q6169e10c","text":"What is the calculation for the net change in gross liability for unrecognized tax benefits for the year 2008, and what data sources provide this information?"}
{"_id":"q616a4188","text":"What was the percentage of total operating revenue derived from chemical freight in 2015, and how can I calculate this using available financial data?"}
{"_id":"q6168ca2e","text":"What are the total asphalt sales in millions of dollars for the three-year period, and how can I find the relevant data or reports that provide this information?"}
{"_id":"q616a1bb8","text":"What is the anticipated percentage increase in global cruise fleet berths from 2017 to 2021, and how can I calculate this using available industry data?"}
{"_id":"q6164fade","text":"What is the percentage change in cash flow hedges from 2010 to 2011, and how can I calculate this using financial data?"}
{"_id":"q61669b82","text":"What is the projected growth rate for capital lease payments from 2019 to 2020, and how can I calculate it using available financial data?"}
{"_id":"q6169ea26","text":"What is the estimated price per share of Hologic common stock that was utilized in the R2 acquisition, and what factors influenced this valuation?"}
{"_id":"q6168f47c","text":"What are the total development costs in millions for the specified three-year period, and how can I find a breakdown of these costs by year?"}
{"_id":"q61698478","text":"What was the percentage change in employee separations liabilities for the year 2006, and how can I calculate it using available financial data?"}
{"_id":"q616a57b8","text":"What is the change in the weighted average common shares outstanding for diluted computations, expressed in millions, from 2012 to 2013? Please provide the relevant financial data or calculations needed to determine this change."}
{"_id":"q6168f094","text":"What is the total impact on the discounted value adjustment (DVA) resulting from a 1 basis point increase in the credit spread of JPMorgan Chase for the years 2007 and 2008? Please provide the relevant calculations and data sources used to determine this impact."}
{"_id":"q616917c2","text":"What was the percentage change in account balance at the end of 2011 compared to the end of 2010, and how can I calculate it using available financial data?"}
{"_id":"q61652c3e","text":"What is the highest recorded provision for income taxes, expressed in millions, based on the latest financial data available?"}
{"_id":"q616a688e","text":"What is the formula to calculate the percentage change in the balance of unrecognized tax benefits from 2007 to 2008, and what are the specific values for those years?"}
{"_id":"q616971a4","text":"What is the percentage of total assets for the year 2014, and how can I calculate it using the relevant financial data?"}
{"_id":"q616a741e","text":"What is the calculation method to determine the growth rate of rent expenses and specific office equipment expenses from 2012 to 2013, including the necessary data points and formulas?"}
{"_id":"q6167cb9c","text":"What is the calculation for the difference in cumulative total return between A. O. Smith Corp and the Russell 1000 Index for the five-year period ending December 31, 2010, based on historical financial data?"}
{"_id":"q616524dc","text":"What is the percentage of borrowing under the term loan facility compared to the total contractual maturities of long-term debt obligations that are due after December 31, 2016? Please provide the necessary financial data or calculations to determine this ratio."}
{"_id":"q61677ac0","text":"What is the total intangible asset amortization expense (in millions) for the years ending December 31 for 2016, 2017, and 2018, and how can I find this data in financial statements or reports?"}
{"_id":"q61658814","text":"What is the formula to calculate the percentage decrease in receivables from the money pool between 2010 and 2011, and what are the specific receivables values for those years?"}
{"_id":"q61650e98","text":"What is the percentage change in deferred tax assets and regulatory assets from 2013 to 2014, and how can I calculate it using financial statements or relevant accounting data?"}
{"_id":"q6167dbbe","text":"What is the percentage decrease in the minimum contribution required for benefit pension plans as a result of the RELIEF Act? Please provide the relevant data or calculations needed to determine this change."}
{"_id":"q616a28a6","text":"What is the growth rate of Loews common stock from December 31, 2004, to the end of 2009, and how can I calculate it using historical stock price data?"}
{"_id":"q6168a9f4","text":"What is the percentage of labor-related claims filed by Americans in relation to the total claims and other bankruptcy settlement obligations as of December 2013?"}
{"_id":"q616a0b0a","text":"To find the percentage of JPMorgan Chase's income before income tax expense (benefit) and extraordinary gain that was sourced from the U.S., how can I calculate this using the latest financial data?"}
{"_id":"q61662ef4","text":"What is the average total assets in millions for the years 2012 and 2013, and how can I calculate it using available financial data?"}
{"_id":"q6165b870","text":"To find the approximate price per site in thousands for the company’s purchases made on March 30, 2012, based on the agreement, what data points or calculations are needed?"}
{"_id":"q61675d1a","text":"What is the minimum allowable depreciation rate for furniture, fixtures, and equipment according to accounting standards and tax regulations?"}
{"_id":"q6165d102","text":"What is the calculation for the change in unrecognized tax benefits in millions of dollars between the years 2017 and 2018, based on available financial data?"}
{"_id":"q61670d10","text":"To determine the value of the 2010 currency maturities excluding euro maturities, what is the calculation process to find the total in US$ millions? Please provide the relevant data points and any necessary formulas for this calculation."}
{"_id":"q6169c9ba","text":"To enhance the relevance of the search results for this query, I would rewrite it as follows:\n\n'What is the dollar ratio of after-tax gains in 2004 compared to 2003, and how can I calculate it using available financial data?'"}
{"_id":"q6167b882","text":"Did Abiomed's stock performance exceed that of the Nasdaq Composite Index over a specific time period? Please provide the relevant dates for comparison."}
{"_id":"q61667602","text":"What percentage of the total leased locations are located in Texas, and how can I calculate this using the available leasing data?"}
{"_id":"q61668a5c","text":"What is the percentage increase in the backlog from 2012 to 2013, and how can I calculate it using the backlog data for those years?"}
{"_id":"q61663da4","text":"To determine the total diluted weighted-average shares outstanding for the year ended December 31, 2015, including all potential common shares, what is the calculation process and the specific data points needed from the financial statements?"}
{"_id":"q616aa90c","text":"To find the percentage of total debt compared to lease obligations and purchase obligations as part of the contractual obligations for future payments in 2007, what were the specific values for total debt, lease obligations, and purchase obligations? How can I calculate the percentage of total debt relative to the sum of lease and purchase obligations for that year?"}
{"_id":"q616aac68","text":"What percentage of the total route miles were classified as main line in 2006, based on available transportation data?"}
{"_id":"q61666e6e","text":"What is the formula to calculate the percentage increase in cash provided by operating activities from 2006 to 2007, and what are the specific cash flow figures for those years?"}
{"_id":"q6166e4ac","text":"How to calculate the sales growth rate from 2017 to 2018 using sales data for those years?"}
{"_id":"q61680706","text":"What is the maximum percentage of the contingent consideration for Impella in June 2008 that must be paid in cash, and how is this percentage calculated based on the relevant financial data?"}
{"_id":"q6169f994","text":"What are the total off-balance sheet obligations in millions for the latest financial year, and how can I find the relevant financial statements or reports that detail these obligations?"}
{"_id":"q616a194c","text":"What is the calculation for the ratio of the 5.000% senior notes to the 6.200% senior notes issued in March 2010?"}
{"_id":"q6169c2d0","text":"What is the total value, in millions, of issued securities that have received approval from security holders? Please provide the relevant data or sources for this calculation."}
{"_id":"q616633ea","text":"What is the formula to calculate the percentage of net assets acquired that is classified as goodwill, and what data points are needed for this calculation?"}
{"_id":"q61677fd4","text":"What is the formula to calculate the net income margin for Q1 2014, and what are the necessary financial data points required for this calculation?"}
{"_id":"q616a59d4","text":"What was the ending balance of asset retirement liability in millions as of September 27, 2003, excluding any accretion? Please provide the relevant financial data or calculations needed to determine this figure."}
{"_id":"q61662760","text":"What is the height range of monopole towers in feet, and what factors influence their height variations?"}
{"_id":"q6167ea3c","text":"To find the percentage of total shares attested to UPC by employees for stock option exercise prices for the quarter ending December 31, 2010, what is the calculation process and the relevant data points needed?"}
{"_id":"q6169ccee","text":"What is the calculation method to determine the difference in operating margin between the years 2012 and 2013 using financial data?"}
{"_id":"q61660d98","text":"What is the percentage of total net inflows for Australia in 2017 that were attributed to long-term Australian liquidity products, based on the provided table data?"}
{"_id":"q616738bc","text":"What is the formula to calculate the percentage change in loans retained from 2013 to 2014, and what are the specific loan retention figures for those years?"}
{"_id":"q616897a2","text":"What is the formula to calculate the percentage change in net derivative liabilities under bilateral agreements from 2012 to 2013, and what are the relevant data points needed for this calculation?"}
{"_id":"q6166a208","text":"What was the percentage increase in interest and penalties compared to the interest income for the year 2015, and how can I calculate this using available financial data?"}
{"_id":"q616941b6","text":"What was the largest Tier 1 capital amount in millions for the years 2011 and 2012, and how can I find the relevant financial data for these years?"}
{"_id":"q6168ed88","text":"What was the total value, in millions of dollars, of approved equity compensation plans in 2005? Please provide data sources or reports that detail this financial information."}
{"_id":"q6169249c","text":"What is the formula to calculate the percentage change in net revenue from 2010 to 2011, and what are the specific net revenue figures for those years?"}
{"_id":"q61670090","text":"What is the percentage decrease in net income relative to the percentage decrease in net revenue from 2003 to 2004, and how can I calculate this using financial data?"}
{"_id":"q61665834","text":"What is the formula to calculate the percentage change in uncertain tax positions from 2007 to 2008, and what are the specific values for those years?"}
{"_id":"q61690e76","text":"What is the percentage change in the weighted average common shares outstanding for diluted earnings per share calculations from 2011 to 2012, and how can I find the relevant financial data to perform this calculation?"}
{"_id":"q6169df22","text":"What is the percentage change in the balance of gross unrecognized tax benefits at the end of the fiscal year, and how can I calculate it using the relevant financial data?"}
{"_id":"q61693522","text":"What percentage of the total aggregate restructuring costs in 2010 were attributed to employee-related expenses?"}
{"_id":"q61661810","text":"What is the net change in asset retirement liability, measured in millions, for the fiscal year ending September 27, 2003, based on the available financial statements?"}
{"_id":"q6166a7d0","text":"What is the ratio of the company's contributions to US qualified versus non-qualified pension benefits for the years 2014 and 2015, and how can I calculate this using available financial data?"}
{"_id":"q61685bac","text":"What is the formula to calculate the percentage change in research and development costs from 2014 to 2015, and what were the specific cost figures for those years?"}
{"_id":"q6169a610","text":"What is the ratio of Devon Energy's debt maturities scheduled for 2013 compared to those scheduled for 2014, based on data available as of December 31, 2012?"}
{"_id":"q6166065e","text":"What was the total amount allocated by the compensation committee to the maximum performance pool from January 1, 2006, to December 31, 2007, based on available financial reports?"}
{"_id":"q61681f02","text":"What is the calculation method to determine the ratio of flight attendants to pilots in the airline industry, and what data sources provide this information?"}
{"_id":"q61689ea0","text":"What is the percentage of commitments that are scheduled to be due after the year 2019, based on the available data?"}
{"_id":"q61653f4e","text":"What is the formula to calculate the percentage change in revenue generated from non-US currencies between 2015 and 2016, and what data is available to perform this calculation?"}
{"_id":"q6165fcd6","text":"What is the calculation for the difference in tax position additions between prior years and the current year, expressed in millions? Please provide the relevant financial data or reports needed for this analysis."}
{"_id":"q616682aa","text":"How to calculate the percent change in long-term component changes from December 31, 2011, to December 31, 2012, using relevant financial data?"}
{"_id":"q6166bd42","text":"What is the average initial health care trend rate as a percentage for the three-year period based on available health care expenditure data?"}
{"_id":"q6168a0d0","text":"What is the formula to calculate the percent change in principal transactions revenue related to interest rate risks from 2016 to 2017, and what are the specific revenue figures for those years?"}
{"_id":"q6169cadc","text":"What is the calculation for the change in net impairment from 2011 to 2012, and what data sources provide this information?"}
{"_id":"q6167edde","text":"To find the ratio of structured commercial loan vehicles to credit-linked note vehicles in 2003, what were the total values or quantities of each type of vehicle in that year?"}
{"_id":"q6166ac94","text":"To enhance the relevance of the search results for this query, I will clarify the calculation process and specify the data points involved. Here’s the rewritten query:\n\n'What percentage of the total shares purchased in November 2010 corresponds to the total number of shares purchased for the quarter ending December 31, 2010? Please provide the calculation method and relevant data sources.'"}
{"_id":"q61665122","text":"What percentage of the total full-time employees in mainline operations are classified as flight attendants? Please provide the necessary data or calculations to determine this ratio."}
{"_id":"q6165f812","text":"To determine the impact of recognizing the total FIN 48 gross liability for unrecognized tax benefits as of November 28, 2008, on the effective tax rate and goodwill, how can I calculate the amount of unrecognized tax benefits that would lead to a greater decrease in the effective tax rate compared to the decrease in goodwill? Please provide relevant financial analysis methods or examples."}
{"_id":"q616701da","text":"What percentage of the total assets acquired from Anios are classified as intangible assets, and how can I calculate this using the available financial data?"}
{"_id":"q6168a918","text":"What is the ratio of the company's pension contributions in 2011 compared to those in 2013, specifically in relation to total US pension contributions for those years?"}
{"_id":"q6165408e","text":"What is the formula to calculate the percentage decrease in cash flows from operations between the years 2009 and 2010, and what are the specific cash flow values for those years?"}
{"_id":"q61684298","text":"What is the formula to calculate the percentage change in loans retained from 2009 to 2010, and what are the specific loan retention figures for those years?"}
{"_id":"q6169906c","text":"What percentage of credit card assets were represented by automobile loans in the national city-sponsored securitization QSPES as of December 31, 2008?"}
{"_id":"q6169e5f8","text":"What is the percentage increase in the company's recorded liabilities for interest and penalties from 2017 to 2018, and how can I calculate it using the financial data for those years?"}
{"_id":"q6167de66","text":"What is the current percentage of contracts for long-term capacity purchases that are due for renewal or expiration?"}
{"_id":"q6168095e","text":"What is the formula to calculate the percentage change in net earnings from continuing operations between the years 2014 and 2015, and what are the specific net earnings figures for those years?"}
{"_id":"q616ac50e","text":"What is the total expected contingent payment amount, in millions, to the former shareholders of Impella upon FDA approval of Impella devices, based on available financial projections and agreements?"}
{"_id":"q61683726","text":"What is the percentage of active full-time equivalent employees that are classified as passenger service personnel, based on the latest workforce data?"}
{"_id":"q6168f882","text":"What is the percentage of total expected cash outflows for contractual obligations and commitments as of December 31, 2007, that is allocated to pension funding? Please provide the necessary data or calculations to determine this percentage."}
{"_id":"q616821a0","text":"To enhance the relevance of the search results for this query, I will clarify the calculation process and specify the data points involved. Here’s the rewritten query:\n\n'What is the calculation method for determining the ratio of the remaining discount on notes due in 2017 compared to those due in 2016, including relevant financial data and formulas?'"}
{"_id":"q6167d858","text":"What percentage of future lease payments was due in 2021 and how does this compare to the percentages due in subsequent years?"}
{"_id":"q61663b9c","text":"What is the projected growth rate for operating lease payments from 2019 to 2020, and how can I calculate it using available financial data?"}
{"_id":"q616674c2","text":"What is the percentage of future financial commitments that are scheduled to be fulfilled after the year 2020, based on available financial data and projections?"}
{"_id":"q61662490","text":"Rewritten Query: 'What was the total cash used for stock repurchases in September 2019, expressed in millions of dollars, based on available financial reports?'"}
{"_id":"q616733d0","text":"What was the price per share at which AWK repurchased its common stock in 2018, and where can I find detailed information on these transactions?"}
{"_id":"q6169c4ec","text":"What was the percentage of total costs and expenses attributed to selling, general, and administrative expenses (excluding depreciation, amortization, and restructuring costs) in fiscal year 2018? Please provide the calculation method and relevant financial data."}
{"_id":"q6168a576","text":"What is the ratio of the estimated future benefit payments due in 2015 to the estimated future benefit payments due after 2020, based on data from 2014?"}
{"_id":"q61676706","text":"What is the expected operating ratio for 2011, assuming a similar improvement as observed in 2010, and what data or calculations are needed to determine this?"}
{"_id":"q61668b88","text":"What was the percentage of potential maximum exposure under the loss share arrangements for the unpaid principal balance of loans sold as a participant in these programs as of December 31, 2012? Please provide the calculation method and relevant data points needed for this analysis."}
{"_id":"q616a55b0","text":"What is the percentage change in royalty fees reported in the cost of goods sold from 2011 to 2012, and how can I calculate it using the financial data for those years?"}
{"_id":"q6165af92","text":"What percentage of total cash and cash equivalents was held in the U.S. as of December 31, 2016, based on available financial statements?"}
{"_id":"q6168e28e","text":"What was the ratio of anticipated benefits payments from unfunded postemployment benefit plans to deferred compensation in 2018, and how can I calculate this using available financial data?"}
{"_id":"q6166c63e","text":"What is the formula to calculate the annualized return for the S&P 500 AEMaterials Index from 2012 to 2017, and what are the specific data points needed for this calculation?"}
{"_id":"q61659eb2","text":"What is the calculation method for determining the net change in the balance of accruals related to restructurings for the year 1999, including relevant financial data and adjustments?"}
{"_id":"q6168605c","text":"What is the total amount of sales in millions that were generated from international markets?"}
{"_id":"q616ac888","text":"What is the calculation for the difference in spending on shares between November 2010 and December 2010, and how much more was spent in November compared to December?"}
{"_id":"q61651d70","text":"What percentage of the total contractual obligations and off-balance sheet arrangements is attributed to capital lease obligations? Please provide the calculation process and relevant data points needed to determine this percentage."}
{"_id":"q616a5038","text":"What was the total increase in unrecognized tax benefits, measured in millions of dollars, between the years 2007 and 2008? Please provide the relevant financial data or calculations needed to determine this increase."}
{"_id":"q616a7842","text":"What is the percentage growth rate of rental expenses included in other operations and maintenance expenses from 2000 to 2001? Please provide the relevant financial data for both years to facilitate the calculation."}
{"_id":"q61679bf4","text":"What percentage of the total restricted units is scheduled to vest in 2011, and how can I calculate this using the vesting schedule and total units data?"}
{"_id":"q6165649c","text":"What is the percentage change in stock price performance for HUM (Humana Inc.) from 2010 to 2011, and how can I calculate it using historical stock price data?"}
{"_id":"q616a89ae","text":"What is the calculation for the change in the reserve for product warranties in millions of dollars from 2005 to 2006, and what are the specific values for each year?"}
{"_id":"q616574a0","text":"What is the calculation method to determine the percentage of future minimum rental payments that are due after the year 2020, based on the provided rental payment schedule?"}
{"_id":"q6168f1ca","text":"What is the total value in thousands of shares outstanding but not yet earned under incentive shares at the end of the year, calculated using the average grant date fair value per share?"}
{"_id":"q616aa542","text":"What is the calculation for the change in free cash flow in millions of dollars from 2005 to 2006, and where can I find the relevant financial data for these years?"}
{"_id":"q61658b2a","text":"What is the percentage of cumulative total shareholder return for Discovery Communications (DISCA) common stock over the five-year period ending December 31, 2014, and how can I calculate it using historical stock price data?"}
{"_id":"q61650b0a","text":"What percentage of the total noncancelable future lease commitments is due in the fiscal year 2019, and how can I find the relevant financial data to perform this calculation?"}
{"_id":"q616902aa","text":"What percentage of Anios' purchasing price can be attributed to goodwill, and how is this calculated based on the company's financial statements?"}
{"_id":"q616844b4","text":"What is the formula to calculate the percentage change in dividends declared per common share from 2015 to 2016, and what are the specific dividend amounts for those years?"}
{"_id":"q616677a6","text":"What is the percentage of total contractual obligations that is attributed to operating leases, and how can I calculate this using financial data?"}
{"_id":"q616a542a","text":"What is the calculation method to determine the 5-year total return for Jack Henry & Associates (JKHY), including any relevant financial data or performance metrics needed for this analysis?"}
{"_id":"q61650696","text":"What is the calculation for the change in unrecognized tax benefits from the end of 2014 to the end of 2015, and where can I find the relevant financial data to perform this analysis?"}
{"_id":"q6169fad4","text":"What is the percentage increase in the average price of WTI crude oil from 2011 to 2013, and how can I calculate it using historical price data?"}
{"_id":"q6168c6e6","text":"To find the percentage of operating earnings relative to segment net sales for the year 2006, what data sources or financial reports can provide this information?"}
{"_id":"q6167719c","text":"What is the percentage of the cumulative 5-year total stockholder return for Cadence Design Systems Inc. for the period ending January 3, 2015, and how can I find the relevant financial data to calculate it?"}
{"_id":"q6169788e","text":"What would the net revenue have been for the Rhode Island State Energy Center in 2015 if the 583 MW sale had not occurred? Please provide the calculation process and relevant financial data needed to determine this figure."}
{"_id":"q61675996","text":"What is the calculation method for determining the difference between the initial health care trend rate and the ultimate health care trend rate for the year 2017, using relevant health care financial data?"}
{"_id":"q61666f9a","text":"What is the formula to calculate the return on investment (ROI) for an investment in Ball Corporation from 2007 to 2012, and what are the specific financial data points needed for this calculation?"}
{"_id":"q6167b0d0","text":"What is the percentage of cumulative total shareholder return for DISCB common stock over the five-year period ending December 31, 2014, and how is this calculated using historical stock price data and dividends?"}
{"_id":"q61687222","text":"What is the formula to calculate the percentage cumulative total shareholder return for DISCB from September 18, 2008, to December 31, 2011, using historical stock price data and dividends?"}
{"_id":"q6166d5f2","text":"What is the formula to calculate the percentage increase in rent from 2007 to 2008, and what were the specific rent values for those years?"}
{"_id":"q616a2982","text":"What is the total expected payment amount for Entergy New Orleans' storm recovery funding bonds over the next 5 years, including principal and interest calculations?"}
{"_id":"q616aa7a4","text":"How to calculate the growth rate of the weighted average fair value for options granted from 2006 to 2007 using relevant financial data?"}
{"_id":"q61676f30","text":"What is the total cash impact resulting from the exercise of all outstanding options, warrants, and rights, and how can I calculate this using the current share prices and the number of each type of security?"}
{"_id":"q61685314","text":"What is the formula to calculate the percentage increase in net derivative gains from 2006 to 2007, and what are the specific values for those years?"}
{"_id":"q61683906","text":"What is the method to calculate the average ending balance of the discounted cash flow balance over a specified period?"}
{"_id":"q6167a982","text":"What was the percentage of net undeveloped acres that expired in the U.S. in 2014, based on available land use data?"}
{"_id":"q6168b0d4","text":"What is the percentage of the total gross property and equipment values in 2006 that is attributed to computers, based on available financial data?"}
{"_id":"q616669be","text":"What is the highest ultimate trend rate for health care costs based on the provided data, specifically identifying the maximum value among the following rates: 4.70%, 4.50%, and 4.50%?"}
{"_id":"q61678bb4","text":"What is the formula to calculate the percentage of total contractual obligations that is represented by long-term debt, and what data points are needed to perform this calculation?"}
{"_id":"q616a58da","text":"What was the percentage change in the number of unvested shares in 2012 compared to the previous year, and how can I calculate this using available stock data?"}
{"_id":"q616a824c","text":"What is the range of losses, in millions, for undesignated foreign exchange derivatives based on recent financial reports or market data?"}
{"_id":"q616593ea","text":"What percentage of the total consideration transferred in a business acquisition is allocated to goodwill, and how can this be calculated using financial statements?"}
{"_id":"q61679adc","text":"What is the percentage growth rate of dividends received in 2013 compared to 2012, and how can I calculate it using available financial data?"}
{"_id":"q61655ca4","text":"To find the percentage of total amortized assets that consisted of total securities available for sale in 2012, what calculation should I perform using the relevant financial data?"}
{"_id":"q61656f6e","text":"What is the estimated unrecognized compensation cost related to restricted stock awards that will be recognized within one year as of December 31, 2007, expressed in millions?"}
{"_id":"q61654ae8","text":"What was the share price of the exercised warrants in 2008, and how does it compare to the share prices of the underlying stock during that year?"}
{"_id":"q61687cc2","text":"What is the total amount in millions for specific reserves in the ALL over the past two years? Please provide the relevant data or calculations needed to determine this total."}
{"_id":"q616787e0","text":"What was the market capitalization of the company as reported on the NYSE on February 17, 2017, and how can I find the relevant financial data for that date?"}
{"_id":"q61689c7a","text":"What is the percentage change in unbilled receivables for construction contracts from 2007 to 2008, and how can I calculate it using the relevant financial data?"}
{"_id":"q6165b456","text":"What is the net change in non-vested performance awards for the year 2012, expressed in thousands of dollars, based on available financial data?"}
{"_id":"q6165434a","text":"To enhance the relevance of the search results for this query, I will clarify the calculation process and specify the data points involved. Here’s the rewritten query:\n\n'What is the percentage of total shares purchased after November 25, 2018, for the quarter ending December 29, 2018, based on available trading data?'"}
{"_id":"q616a6442","text":"What is the percentage growth rate of rental expenses included in other operations and maintenance expenses for the year 2002 compared to 2001? Please provide the relevant financial data or calculations needed to determine this growth rate."}
{"_id":"q61694076","text":"What was the percentage of total route miles covered by the main line as of December 31, 2006, and how can I calculate this using available transportation data?"}
{"_id":"q6169f570","text":"What is the total balance for the company in 2018, including interest and penalty liabilities, and how can I calculate it using the relevant financial data?"}
{"_id":"q616558d0","text":"What is the percentage change in nuclear realized prices relative to the decrease in net revenue from 2011 to 2012, and how can I calculate this using available financial data?"}
{"_id":"q6165c342","text":"What is the formula to calculate the percent change in general and administrative expenses from 2000 to 2001, and what are the specific expense values for those years?"}
{"_id":"q6167e406","text":"What is the formula to calculate the percentage change in total assets for the year 2012, and what data points are needed to perform this calculation?"}
{"_id":"q6167a7d4","text":"What are the estimated gross proceeds from the sale of the packaging business (in millions) considering preliminary closing adjustments that have not yet been finalized?"}
{"_id":"q61654d18","text":"What percentage of the estimated purchase price is attributed to net tangible assets, and how can I calculate this using available financial data?"}
{"_id":"q61676878","text":"What is the total number of allowed towers purchased under the final amended purchase agreement for the Vivo acquisition, and how does this compare to the initial number of allowed towers?"}
{"_id":"q61690160","text":"What is the average cost per locomotive for the railroad's purchase made on October 15, 2009, based on the available financial records or purchase data?"}
{"_id":"q61685f44","text":"How to calculate the return on investment (ROI) for the S&P 500 index from 2007 to 2008, including the necessary data points and percentage change?"}
{"_id":"q6169304a","text":"What are the total purchase commitments projected for the next two years, expressed in thousands of dollars? Please provide the relevant data or calculations needed to determine this figure."}
{"_id":"q616a75a4","text":"What is the range of the United States' revenue in thousands of dollars from 2010 to 2012, and how can I calculate it using available financial data?"}
{"_id":"q616a67d0","text":"What is the percentage of total operating revenues from 2014 to 2016 that is attributed to coal revenue, and how can I calculate this using available financial data?"}
{"_id":"q6165c086","text":"What was the net income per common share for the year 2007, and how can I find the relevant financial data to calculate it?"}
{"_id":"q616a3cb0","text":"What is the formula to calculate the percentage change in the balance of cash and U.S. government securities from 2006 to 2007, and what are the specific values for each year?"}
{"_id":"q61682db2","text":"What is the total monetary value of shares purchased in October 2018, and how can I find the relevant trading data or reports to calculate this?"}
{"_id":"q616a3bb6","text":"What is the formula to calculate the percentage change in the treasury balance for the year 2010, and what data points are needed to perform this calculation?"}
{"_id":"q6167d394","text":"What is the method to calculate the total fair value of non-vested shares as of September 27, 2008, using available financial data and valuation techniques?"}
{"_id":"q61653b16","text":"What is the percentage of total contractual obligations that is classified as long-term debt, and how can I calculate this using financial statements or relevant data?"}
{"_id":"q6168a224","text":"What is the formula to calculate the percentage change in risk-weighted assets at Goldman Sachs Bank USA from 2011 to 2012, and what are the specific risk-weighted asset values for those years?"}
{"_id":"q616a23e2","text":"What is the calculation method to determine the ratio of total tax expenses between 2018 and 2017, and what data sources provide this information?"}
{"_id":"q6169e4cc","text":"To find the percentage of the total amortization expense for 2017 that was due in 2019, what data is needed and how can I calculate it? Please provide the total amortization expense for 2017 and the specific amount due in 2019."}
{"_id":"q6168038c","text":"What is the calculation for the difference in millions between deferred revenue and recognized revenue for the fiscal year ending June 30, 2019, based on available financial statements?"}
{"_id":"q61659bc4","text":"What was the decrease in rental expenses (in millions) for operating leases in continuing operations from 2003 to 2023, and how can I calculate this using available financial data?"}
{"_id":"q6166876e","text":"What is the percentage change in common shareholders' equity for 2019 after applying the adjustments outlined in the table to calculate the Basel III Common Equity Tier 1 (CET1) ratio?"}
{"_id":"q616888de","text":"How to calculate the net income-to-capital ratio for Bermuda subsidiaries in 2008 using financial data and relevant metrics?"}
{"_id":"q61664d6c","text":"What is the calculation for the change in risk-weighted assets in millions at Goldman Sachs Bank USA from 2011 to 2012, and what are the specific data points needed to determine this change?"}
{"_id":"q616773cc","text":"What is the percentage increase in operating companies' income attributed to higher pricing? Please provide the necessary data points for this calculation."}
{"_id":"q6166f4c4","text":"What is the percentage change in cash flows from operating activities, including discontinued operations, between the years 2009 and 2010? Please provide the necessary financial data or calculations to determine this change."}
{"_id":"q616a903e","text":"What is the total lease rental expense incurred, in millions, for the company's executive offices from 2010 to 2012, and how can I calculate this using the available financial data?"}
{"_id":"q6169dc34","text":"What is the percentage increase in the balance of tax benefits from the beginning of 2016 to the end of 2018, and how can I calculate this using relevant financial data?"}
{"_id":"q61669736","text":"How to calculate the operating cash flows as a percentage of receivables from the money pool for the year 2004, including the relevant data points and formulas needed for this analysis?"}
{"_id":"q61681d90","text":"What was the percentage increase in operation and maintenance expenses relative to net revenue for the year 2003, and how can I calculate it using available financial data?"}
{"_id":"q6169f3b8","text":"What percentage of operating cash flow was distributed to shareholders in 2011, and how can I find the relevant financial data to perform this calculation?"}
{"_id":"q61654bf6","text":"What was the net revenue growth rate for Entergy Mississippi, Inc. in 2003, and how can I calculate it using the company's financial data from that year?"}
{"_id":"q616a1078","text":"What percentage of the debt carried in December 2018 was paid off during July and August 2018? Please provide the relevant data points for accurate calculation."}
{"_id":"q616664fa","text":"What was the largest provision for credit losses in millions for the years 2016, 2017, and 2018, and how do these figures compare across those years?"}
{"_id":"q616814f8","text":"What is the total cash outflow for shares purchased in November 2018, including all associated costs such as purchase price, commissions, and fees?"}
{"_id":"q616732e0","text":"What is the formula to calculate the percentage increase in total expenses from 2017 to 2018, and what are the specific total expense figures for those years?"}
{"_id":"q616a2658","text":"What is the formula to calculate the growth rate of employee-purchased shares from 2005 to 2006, and what data is needed to perform this calculation?"}
{"_id":"q61665e7e","text":"What is the net change in asset retirement liability, in millions, between the years 2002 and September 25, 2004, based on available financial data?"}
{"_id":"q6168e7d4","text":"What is the percentage of recourse debt that matures after 2015, based on the data available as of December 31, 2010? Please provide the necessary calculations or data sources to determine this percentage."}
{"_id":"q6164f62e","text":"What is the calculation for the net change in net revenue for Entergy Corporation in 2015, and what specific financial data or reports should I reference to obtain this information?"}
{"_id":"q61666d42","text":"What is the formula to calculate the percent change in the amount of collateral held for indemnified securities from 2006 to 2007, and what are the specific data points needed for this calculation?"}
{"_id":"q616816ce","text":"What is the percentage of total long-term obligations that are due in 2018 based on the financial statements or obligations schedule?"}
{"_id":"q61657216","text":"What is the percentage of the company's gross liabilities that are categorized as other long-term liabilities according to the consolidated balance sheets for the year 2012?"}
{"_id":"q616653fc","text":"To determine the cash expense for product warranties in 2007 based on the percentage increase observed in 2006, what is the percentage increase in product warranty expenses from 2005 to 2006, and how can I apply that percentage to the 2006 warranty expense amount to calculate the 2007 expense in millions?"}
{"_id":"q61683df2","text":"To calculate the return on investment (ROI) for Snap-on from the end of 2005 to the end of 2007, what are the specific stock prices at those times, and how do I determine the percentage gain or loss from this investment?"}
{"_id":"q616863ea","text":"What was the change in asset impairment charges in US dollars (millions) between 2014 and 2013, and how can I calculate this using financial reports or data?"}
{"_id":"q61689590","text":"Rewritten Query: 'What would the cash flows from operating activities for all operations in 2010 (in millions) have been if the charge for accounts receivable securitization was excluded? Please provide the calculation method and relevant financial data needed for this analysis.'"}
{"_id":"q6166d11a","text":"What percentage of the total restructuring programs in 2015 is allocated to termination benefits, and how can I find the relevant financial data to perform this calculation?"}
{"_id":"q6166c9b8","text":"What were the average commercial mortgage recourse obligations in millions for the years 2011 and 2012, and how can I calculate these averages using available financial data?"}
{"_id":"q616a3fe4","text":"What was the percentage of shares repurchased under the new share repurchase program as of December 31, 2015, and how does it compare to the total shares outstanding at that time?"}
{"_id":"q6169c096","text":"To determine if the FIN 47 liability was greater on December 31, 2004, compared to December 31, 2005, what are the specific values of the FIN 47 liability for both dates, and how can I find a comparison of these figures in financial reports or analyses?"}
{"_id":"q61673b50","text":"What percentage of the total restructuring programs in 2015 is allocated to facility closure costs, and how can I find the relevant financial data to perform this calculation?"}
{"_id":"q616859b8","text":"What is the calculation for the change in total supplementary leverage exposure in millions of dollars between the years 2016 and 2017, based on available financial data?"}
{"_id":"q61682510","text":"What is the average total of company 401(k) match contributions in millions for the three-year period ending in 2014?"}
{"_id":"q616993dc","text":"To determine if the CME Group outperformed the S&P 500 over the past 5 years, what is the process for comparing their annualized returns and total returns during this period?"}
{"_id":"q6169d266","text":"What was the average fair value in billions of the securities and certain overnight cash deposits included in GCE for December 2013 and December 2012? Please provide the calculation method and relevant data sources."}
{"_id":"q616907e6","text":"What is the calculation method for determining the difference between the initial health care trend rate and the ultimate health care trend rate for the year 2016, using relevant health care financial data?"}
{"_id":"q6168c4de","text":"What was the working capital of Blockbuster at the time of its acquisition, and how can I find the relevant financial data to calculate it?"}
{"_id":"q6169add6","text":"What is the calculation for the 3-year growth rate of gasoline production for MAP, and what data sources provide this information?"}
{"_id":"q61694de6","text":"What is the total value, in millions, of securities that have been approved by security holders but have not yet been issued? Please provide the relevant data or calculations needed to determine this value."}
{"_id":"q6167e8e8","text":"What is the percentage increase in the total liability for asset retirement obligations from 2003 to 2005, and how can I calculate it using the relevant financial data?"}
{"_id":"q6168cb8c","text":"What was the total tax expense for the year 2005, and how does it compare to previous years' tax expenses?"}
{"_id":"q61651f28","text":"What is the calculation method for determining the ratio of total flight attendants to total maintenance personnel in the airline industry?"}
{"_id":"q6168ae2c","text":"What is the formula to calculate the percentage change in diluted earnings per common share from continuing operations between the years 2014 and 2015, and what are the specific earnings figures for those years?"}
{"_id":"q61690b88","text":"What is the total amount spent on stock repurchases by companies in the fourth quarter of the latest fiscal year, and where can I find the relevant financial data or reports?"}
{"_id":"q61683460","text":"What was the total amount spent by the company on repurchasing shares of common stock in 2008, expressed in millions of dollars?"}
{"_id":"q6167ccdc","text":"What was the net income per common share for the year 2008, and how can I find the relevant financial data to calculate it?"}
{"_id":"q61651bc2","text":"To enhance the relevance of the search results for this query, I would rewrite it as follows:\n\n\"What was the percentage change in the share price for the quarter ending March 31, 2015, calculated from the highest to the lowest price during that period?\""}
{"_id":"q61664eac","text":"What is the percentage of total future minimum commitments under existing non-cancelable leases and purchase obligations that is due in 2007, as of December 31, 2006? Please provide the calculation process and relevant data points needed for this analysis."}
{"_id":"q61690c8c","text":"What is the formula to calculate the percentage change in the total cost of aircraft fuel for the year 2013, and what data points are needed to perform this calculation?"}
{"_id":"q616aa2c2","text":"If all four quarters of 2010 had an equal number of total shares purchased, what would be the total number of shares purchased in 2010 based on the quarterly data? Please provide the quarterly share purchase figures for accurate calculation."}
{"_id":"q6165c946","text":"What is the formula to calculate the expected percentage change in aggregate principal payments of long-term debt from 2004 to 2005, and what are the relevant data points needed for this calculation?"}
{"_id":"q6166906a","text":"What is the formula to calculate the percentage change in the total notional amount of undesignated hedges from 2009 to 2010, and what are the specific values for each year?"}
{"_id":"q6167f482","text":"What are the npm adjustment items expressed as a percentage of the increase in operating companies' income? Please provide the relevant financial data or calculations needed to determine this percentage."}
{"_id":"q6167d9b6","text":"What is the percentage cumulative total return for Goldman Sachs Group Inc. over the five-year period ending December 31, 2013, and how can I calculate it using historical stock price data?"}
{"_id":"q61666b1c","text":"What is the percentage of unrecognized tax benefits from 2008 that would affect the effective tax rate if they were recognized, and how can this be calculated using available financial data?"}
{"_id":"q616692fe","text":"What is the total balance of restructuring expenses, specifically severance and related charges along with lease termination costs, expressed in millions?"}
{"_id":"q61662846","text":"What is the percentage of total debt maturity that occurred in 2018 and subsequent years, based on available financial data?"}
{"_id":"q61662bb6","text":"What percentage of the total gains was generated from land sales? Please provide the calculation method and relevant data points needed to determine this percentage."}
{"_id":"q616668b0","text":"What is the projected total expenditure for pensions, retiree medical benefits, and other related costs over the next 12 months, based on current financial data and forecasts?"}
{"_id":"q6167d01a","text":"To calculate the ROI (Return on Investment) for an investment in the S&P 500 made at the end of 2005 and sold at the end of 2007, what are the specific steps and data points needed to determine the percentage return based on the index's performance during that period?"}
{"_id":"q6165dcba","text":"What is the percentage change in the fair value of financial market instruments used in hedging strategies from 2009 to 2010, and how can I calculate this using available financial data?"}
{"_id":"q616822c2","text":"What was the summary of environmental reserves as of December 31, 2011, including key data points and trends in environmental conservation for that year?"}
{"_id":"q616929b0","text":"What is the calculation for the ratio of total American personnel to US Airways personnel, and what specific data points are needed to determine this ratio?"}
{"_id":"q616832f8","text":"What is the formula to calculate the percentage change in working capital from 2015 to 2016, and what are the specific working capital values for those years?"}
{"_id":"q6169237a","text":"What is the formula to calculate the growth rate in net sales from 2010 to 2011, and what data points are needed to perform this calculation?"}
{"_id":"q61658fe4","text":"What is the percentage of net interest revenue relative to total operating expenses for the year 2008, and how can I calculate this using financial data?"}
{"_id":"q616717ba","text":"What is the calculation method for determining the difference between the statutory U.S. income tax rate and the effective income tax rate for the year 2016, including relevant data sources?"}
{"_id":"q6169f66a","text":"What is the formula to calculate the average cash flow from operating activities for the years 2005 to 2007, given the values of $221.1 million in 2005, $203.4 million in 2006, and $231.1 million in 2007?"}
{"_id":"q6166236e","text":"To improve the relevance of the search results for the original query, I will clarify the calculation process and specify the data points involved. Here’s the rewritten query:\n\n\"What is the formula to calculate the percentage of total other current assets represented by a specific component, and what data is needed for this calculation?\""}
{"_id":"q6165f592","text":"What is the formula to calculate the percentage change in the weighted average common shares outstanding for basic computations between 2010 and 2011, and what are the relevant data points needed for this calculation?"}
{"_id":"q61689342","text":"What was the average size in square feet of switching centers in 2017, and what data sources or reports provide this information?"}
{"_id":"q61681a84","text":"To calculate the percentage increase in unrecognized tax benefits from the beginning to the end of 2008, what are the specific values for unrecognized tax benefits at the start and end of 2008?"}
{"_id":"q616a94d0","text":"What is the formula to calculate the return on investment (ROI) for an investment in the S&P 500 index from December 2011 to December 2013, and what are the specific data points needed for this calculation?"}
{"_id":"q6166b69e","text":"What is the calculation method for determining the net change in the balance of liabilities associated with employee separations for the year 2006, including relevant financial data and adjustments?"}
{"_id":"q616ab37a","text":"What is the formula to calculate the percentage net change in accrued liability for unrecognized tax benefits between the years 2007 and 2008, and what are the specific values needed from financial statements to perform this calculation?"}
{"_id":"q61683bc2","text":"What is the percentage of total net revenue attributed to net interest income for the year 2013, and how can I calculate it using financial statements or relevant data?"}
{"_id":"q61656370","text":"What is the percentage of outstanding options that were granted from plans approved by security holders, based on the latest available data?"}
{"_id":"q6169f7be","text":"To determine if the planned capital expenditures in 2012 exceed the free cash flow from 2011, what are the specific values for capital expenditures and free cash flow for those years?"}
{"_id":"q61675360","text":"What is the minimum allowable yearly depreciation rate for land improvements according to current tax regulations and accounting standards?"}
{"_id":"q6168be62","text":"To find the percentage of long-term debt maturities in 2012 relative to the aggregate carrying value of long-term debt, including capital leases, as of December 31, 2008, what calculation steps and data points should I consider?"}
{"_id":"q616aab50","text":"What is the calculation for the annual interest expense associated with the 2019 notes, expressed in millions of dollars?"}
{"_id":"q6167eb9a","text":"What is the calculation for the ratio of interest and penalties related to uncertain tax positions for the years 2013 and 2012, and how can I find the relevant financial data to perform this analysis?"}
{"_id":"q6168ee8c","text":"What was the calculation for the change in the allowance for doubtful accounts for the year 2012, including the beginning and ending balances?"}
{"_id":"q6169fd86","text":"To calculate the total return on a $100,000 investment in the S&P 500 from December 11 to December 16, what are the specific closing prices of the S&P 500 on those dates, and how do I determine the percentage return based on the price change during that period?"}
{"_id":"q61697de8","text":"What is the percentage change in total other accrued liabilities from 2012 to 2013, and how can I calculate it using the relevant financial data?"}
{"_id":"q6169d4d2","text":"To determine the total impact on earnings for 2004 and 2005 due to a 2% increase in interest rates, what calculations or data points should I consider, and how can I find the relevant financial data for these years?"}
{"_id":"q61692686","text":"Rewritten Query: 'What were the total impairment charges included in SG&A expenses from 2005 to 2007, expressed in millions of dollars, and how can I find this data in financial reports or databases?'"}
{"_id":"q616a8d14","text":"What is the percentage of the total outstanding term loan that is due within the next 12 months as of December 31, 2016, based on the available financial data?"}
{"_id":"q616a5d26","text":"What is the calculation for determining the financial loss incurred by the company due to the forfeiture of grants, based on the fair value of those grants?"}
{"_id":"q6167b74c","text":"What is the calculation for the change in total assets in millions from 2012 to 2013, and what data sources provide this information?"}
{"_id":"q6168b200","text":"What is the method to calculate the average net unrealized investment gains over a specified period using available financial data?"}
{"_id":"q616a9278","text":"What was the profit margin percentage for printing paper manufacturers in 2005, and what factors influenced this margin based on industry reports?"}
{"_id":"q61697eec","text":"What is the formula to calculate the growth rate in net sales from 2009 to 2010, and what data points are needed to perform this calculation?"}
{"_id":"q616a8576","text":"What is the total amount spent by the company on share repurchases that were not part of any announced plans or programs?"}
{"_id":"q61697a78","text":"What is the formula to calculate the percentage change in total wholesale credit-related assets from 2013 to 2014, and what are the specific asset values for those years?"}
{"_id":"q6166666c","text":"What percentage of the Woburn property owned by American Tower Corporation is currently subleased, and what data sources provide this information?"}
{"_id":"q616507d6","text":"What is the formula to calculate the growth rate of standby letters of credit from 2006 to 2007, and what are the relevant data points needed for this calculation?"}
{"_id":"q6166ccce","text":"What was the total value of assets, in millions, reported at the end of the year on December 31, 2011?"}
{"_id":"q61661d24","text":"What is the percentage of passenger service personnel relative to the total number of personnel in the organization? Please provide the necessary data or calculations to determine this ratio."}
{"_id":"q616884c4","text":"What is the percentage change difference between Priceline Group and the S&P 500 Index over the five-year period ending in 2016, and how can I calculate it using historical financial data?"}
{"_id":"q61698766","text":"What is the formula to calculate the percent change in the equity component from December 31, 2011, to December 31, 2012, using the relevant financial data?"}
{"_id":"q61661702","text":"What was the ratio of cabinet sales to door sales in 2017, and how can I calculate it using available sales data?"}
{"_id":"q61679992","text":"What is the formula to calculate the growth rate in total sales for the year 2013, and what data points are needed to perform this calculation?"}
{"_id":"q6165cb08","text":"What is the average improvement in net interest yield on interest-earning assets in basis points from 2016 to 2017, based on the managed basis data for 2013?"}
{"_id":"q61695af2","text":"To find the ratio of CME Group Inc. stock performance to the S&P 500 in 2017, what were the specific stock price changes or returns for CME Group Inc. and the S&P 500 during that year?"}
{"_id":"q61670bee","text":"To estimate the total value of stock options in 2018 based on the average exercise price, what calculation methods and data points should I use, including the number of options granted and their average exercise price, to arrive at the total value in millions of dollars?"}
{"_id":"q6166c4fe","text":"What is the calculation for the change in OTTI (Other-Than-Temporary Impairment) between 2011 and 2012, expressed in millions of dollars? Please provide the relevant financial data for both years."}
{"_id":"q616634c6","text":"What was the before-tax charge in millions related to the adoption of FIN No. 47 as of December 31, 2005? Please provide the relevant financial data or sources for this calculation."}
{"_id":"q61675590","text":"What was the percentage decrease in development costs for the year 2004, and what data sources can provide this information?"}
{"_id":"q616501f0","text":"What is the percentage of current resources debt relative to the total resources debt, and how can I calculate it using available financial data?"}
{"_id":"q6169fc46","text":"What percentage of the total net derivatives in 2015 was comprised of interest rate derivatives, and how can I find the relevant financial data to perform this calculation?"}
{"_id":"q6168eb44","text":"What is the percentage change in the volume of securities sold under agreements to repurchase from 2014 to 2015, and how can I calculate it using available financial data?"}
{"_id":"q6168cf88","text":"What is the total principal amount, in millions, of capital lease obligations? Please provide the calculation method or relevant data sources needed to determine this total."}
{"_id":"q6166c396","text":"To find the ratio of the aggregate notional amount of outstanding interest rate swaps to the outstanding foreign currency hedges in 2014, what are the specific data points or sources needed for these financial instruments?"}
{"_id":"q6168e496","text":"What is the percentage of operating lease commitments relative to total payment commitments, and how can I calculate this using financial data?"}
{"_id":"q61656230","text":"What is the formula to calculate the percentage change in pre-tax pension and postretirement expense from 2017 to 2018, and what are the specific values for these expenses in each year?"}
{"_id":"q6166eaf6","text":"What was the net revenue growth rate for Entergy Louisiana in 2004, and how can I calculate it using the company's financial data from that year?"}
{"_id":"q616813c2","text":"What is the percentage of the total expected cash outflow required to meet contractual obligations and commitments as of December 31, 2010, that is due in the year 2013? Please provide the relevant financial data or calculations needed to determine this percentage."}
