{"_id":"qd4982518","text":"What was the closing price of the S&P 500 index at the end of 2015, according to historical financial data?"}
{"_id":"qd49795a8","text":"What is the total sum of the average year-end backlog values for the years 2014 and 2015, based on available financial reports or operational data?"}
{"_id":"qd496f724","text":"What was the total gross amount of unrecognized tax benefits reported for the year 2018 in financial statements or tax disclosures?"}
{"_id":"qd496f102","text":"What was the average revenue generated from discontinued operations in the year 2013, according to financial reports or industry analyses?"}
{"_id":"qd496f918","text":"What is the total estimated future contingent acquisition obligations payable in cash for the year 2009, according to financial statements or reports?"}
{"_id":"qd49859fc","text":"What was the AAA interest rate for the year 2009 according to historical financial data or economic reports?"}
{"_id":"qd4981d2a","text":"What was the total capital in 2008, excluding Tier 1 capital, according to financial statements or banking regulatory reports?"}
{"_id":"qd497d4aa","text":"What was the average backlog value recorded in 2015 according to industry reports or relevant data sources?"}
{"_id":"qd497e0ee","text":"What was the percentage of square footage owned by major facilities as of December 28, 2013, according to the latest facility ownership reports or data tables?"}
{"_id":"qd49850c4","text":"What is the total sum of the highest and lowest stock prices for the second quarter of 2002, based on financial market data or stock price records?"}
{"_id":"qd4982d6a","text":"What was the total revenue figure reported for the year 2011 in the financial statements or annual reports?"}
{"_id":"qd498998a","text":"What is the percentage increase in rent over a five-year period based on current rental market trends or specific lease agreements?"}
{"_id":"qd4977906","text":"What is the net change in revenue for the year 2008 compared to 2007, based on financial reports or revenue tables?"}
{"_id":"qd498a6dc","text":"What was the total earnings from non-utility nuclear sources by the end of the year 2002, according to financial reports or industry analyses?"}
{"_id":"qd498f128","text":"What is the net change in the estimated future net amortization expense of the present value of future profits from 2013 to 2014, according to financial reports or accounting tables?"}
{"_id":"qd4973770","text":"What was the total amount of contingent payments associated with Impella devices in the most recent financial reports or healthcare expenditure data?"}
{"_id":"qd498d6fc","text":"What was the total debt amount for the years 2014 and 2015, and what was the change in total debt between these two years?"}
{"_id":"qd496d118","text":"What was the cash provided by operating activities for the year 2013, according to the financial statements or cash flow reports?"}
{"_id":"qd496f594","text":"What was the value of Citigroup common stock in 2017 after subtracting an initial investment of $100, based on historical stock price data?"}
{"_id":"qd49825e0","text":"What is the difference in the value of outstanding fuel hedges between 2015 and 2014, specifically the 2015 value minus the 2014 value?"}
{"_id":"qd497a3b8","text":"What was the variance in the price of common stock, specifically the difference between the lowest and highest prices, during the first quarter of 2002?"}
{"_id":"qd497c528","text":"What were the total annual dividend requirements for the years 2015 and 2016, based on financial reports or dividend distribution tables?"}
{"_id":"qd498f394","text":"What was the highest stock price recorded for any company during the second quarter of 2017, according to financial market data?"}
{"_id":"qd4980326","text":"What is the assumed fair market value (FMV) of a share based on current financial assessments or valuation reports?"}
{"_id":"qd498cc2a","text":"What was the net sales value of European industrial packaging in 2007, expressed in thousands?"}
{"_id":"qd497b7e0","text":"What was the total liability amount reported for the year-end 2008 in the financial statements or balance sheets?"}
{"_id":"qd498ed9a","text":"What was the total balance of accounts payable and other current liabilities for the year 2014, according to the financial statements or balance sheets?"}
{"_id":"qd498e660","text":"What was the reported value of unrecognized tax benefits for the year 2016 in financial statements or tax reports?"}
{"_id":"qd498d5e4","text":"What is the net change in rental expense for operating leases in the financial reports from 2009 to 2010?"}
{"_id":"qd497c92e","text":"What was the total amount of annual long-term debt maturities reported for the year 2017 in financial statements or debt maturity schedules?"}
{"_id":"qd498c428","text":"What was the net revenue figure for the year 2007 according to the financial statements or annual reports?"}
{"_id":"qd4978d1a","text":"What was the increase in the weighted average exercise price per share from 2005 to 2007, based on available financial reports or stock option data?"}
{"_id":"qd49792ba","text":"What was the total cash flow for the years 2014 and 2015, and what was the change in cash flow between these two years according to the financial statements?"}
{"_id":"qd4980a06","text":"What was the stock price of JPMorgan Chase at the end of 2014, according to historical financial data?"}
{"_id":"qd4973c3e","text":"What was the percentage of total other assets comprised of goodwill and identifiable intangible assets in 2012, according to financial statements or asset breakdown reports?"}
{"_id":"qd4986d0c","text":"What is the total fair value of notes that are due in 2015 and 2017, according to the latest financial statements or valuation reports?"}
{"_id":"qd498650a","text":"What was the percentage increase in operating profit for space systems from 2011 to 2012, according to the financial reports or performance tables?"}
{"_id":"qd498c8b0","text":"What was the operating margin percentage for the year 2014, according to financial reports or industry analysis?"}
{"_id":"qd49781b2","text":"What is the percentage change in fuel surcharge revenue from 2013 to 2014, and how does the 2014 revenue compare to the 2013 revenue?"}
{"_id":"qd498b1b8","text":"What is the net change in the market value of Delphi Automotive PLC from 2011 to 2014, based on financial reports or stock market data?"}
{"_id":"qd497214a","text":"What was the sales to operating income ratio for the year 2013, based on financial statements or reports?"}
{"_id":"qd4972b4a","text":"What is the net change in the price of PMI common stock from the end of 2013 to the end of 2018, based on historical stock price data?"}
{"_id":"qd4979c6a","text":"What was the net revenue difference between the years 2015 and 2016, according to the financial reports or revenue tables?"}
{"_id":"qd498c2de","text":"What was the percentage of total sales attributed to restaurants in the year 2018, according to industry sales reports or financial statements?"}
{"_id":"qd496e4f0","text":"What was the net favorable prior period development value reported for the year 2010 in financial statements or actuarial reports?"}
{"_id":"qd4988300","text":"What is the total carrying value of notes that are due in the years 2014 and 2015, as reported in the latest financial statements or balance sheets?"}
{"_id":"qd497b4e8","text":"What was the stock price of LKQ Corporation at the end of 2016, according to historical financial data?"}
{"_id":"qd496fbca","text":"What is the price difference of Cadence Design Systems stock from 2007 to 2012, based on historical financial data?"}
{"_id":"qd4970ce6","text":"What was the change in the balance sheet of Prudential Insurance Company of America from 2016 to 2017, including specific figures for total assets and liabilities?"}
{"_id":"qd49885da","text":"What were the sales proceeds for Cilcorp\/Medina Valley in January 2003, according to financial reports or sales data records?"}
{"_id":"qd4982112","text":"What was the stock price of Advance Auto Parts in 2009, and what is the result when subtracting 100 from that value?"}
{"_id":"qd498411a","text":"What is the total value of goodwill and customer-related intangible assets as reported in the latest financial statements or balance sheets?"}
{"_id":"qd498d21a","text":"What is the net change in the price of the NASDAQ Composite Index from the end of 2008 to the end of 2012, based on historical market data?"}
{"_id":"qd4982770","text":"What was the total amount of unrecognized tax benefits reported for the year 2015 in financial statements or tax disclosures?"}
{"_id":"qd498de22","text":"What was the reported value of Cadence Design Systems in 2006, and what is that value minus 100?"}
{"_id":"qd498a5e2","text":"What is the total value of acquired intangible assets in thousands of dollars, as reported in the latest financial statements or accounting records?"}
{"_id":"qd498ce96","text":"What was the total value of stock-based compensation reported by companies in 2011, according to financial statements or industry reports?"}
{"_id":"qd497b95c","text":"What was the percentage change in the stock price of Ball Corporation between December 31, 2010, and December 31, 2005, based on historical financial data?"}
{"_id":"qd4978306","text":"What was the total net earnings attributable to Philip Morris International (PMI) for the fiscal year 2017, according to their financial statements or annual reports?"}
{"_id":"qd4988422","text":"What was the net change in amortized cost for the year 2009, according to financial reports or accounting tables?"}
{"_id":"qd4981186","text":"What were the preliminary purchase price allocations for contract-based intangible assets in thousands of dollars for the year 2008, according to financial reports or accounting standards?"}
{"_id":"qd4976d12","text":"What was the total payment volume for American Express in billions for the most recent fiscal year or quarter?"}
{"_id":"qd4971344","text":"What is the net change in the value of commodities between 2016 and 2017, according to the latest economic reports or commodity market data?"}
{"_id":"qd498cb30","text":"What were the operating profit figures for companies in 2012, according to financial reports or industry analysis?"}
{"_id":"qd4989ac0","text":"What percentage did mutual funds represent of the total investment in the year 2011, according to financial reports or investment analysis data?"}
{"_id":"qd4987784","text":"What is the total sum of the interest-only product and the principal and interest product for the year 2012, based on financial reports or relevant data tables?"}
{"_id":"qd4983b3e","text":"What was the change in unamortized debt issuance costs for senior notes from 2016 to 2017, according to the financial statements or reports?"}
{"_id":"qd497843c","text":"What is the combined total of net cash provided by operating activities and net cash used in investing activities for the most recent financial year, according to the latest cash flow statement?"}
{"_id":"qd497feb2","text":"What is the ratio of outstanding common stock shares after the stock split compared to the number of outstanding shares before the split, based on the latest financial reports?"}
{"_id":"qd4970de0","text":"What was the ratio of hedged gallons in 2016 compared to 2017, based on available industry reports or financial data?"}
{"_id":"qd498694c","text":"What were the total numbers of new store openings in the years 2008 and 2012, according to retail industry reports or company financial statements?"}
{"_id":"qd497fc46","text":"What is the total value of shares purchased in October 2023, according to the latest financial reports or stock market data?"}
{"_id":"qd496dc08","text":"What was the total shipment volume for the years 2010 and 2011, and what is the difference between these two years?"}
{"_id":"qd498fc86","text":"What was the fair value reported for the year 2011 in financial statements or valuation reports?"}
{"_id":"qd496f404","text":"What is the net change in the balance of other intangible assets (net) for the years 2003 and 2004, according to the financial statements or accounting reports?"}
{"_id":"qd49703d6","text":"What was the minimum annual rental payment recorded in 2011 according to housing market data or rental payment statistics?"}
{"_id":"qd4974436","text":"What were the fluctuations in stockholder return for Cadence Design Systems Inc. during the five-year period ending in 2012, based on financial performance reports or stock market data?"}
{"_id":"qd4981bfe","text":"What were the proportional recoverable environmental capital expenditures for the year 2015, according to financial reports or environmental investment studies?"}
{"_id":"qd4983256","text":"What was the fair value per share of the company in 2016 according to financial reports or stock market data?"}
{"_id":"qd496fd00","text":"What was the net change in total debt for the year 2015 compared to 2014, according to financial reports or debt statistics?"}
{"_id":"qd4988a76","text":"What was the difference in net sales for Shorewood between the years 2005 and 2006, according to the financial reports or sales data?"}
{"_id":"qd497a926","text":"What were the total net sales of consumer packaging in North America for the year 2009, expressed in millions of dollars?"}
{"_id":"qd498c090","text":"What was the percentage of future principal payments of corporate debt due in 2011 compared to the total corporate debt principal payments as of December 31, 2007?"}
{"_id":"qd4984a16","text":"What was the total value of intangible assets, in millions, as reported in the latest financial statements or balance sheets?"}
{"_id":"qd4970f34","text":"What was the total value of raw materials and supplies reported in financial statements for the year 2018?"}
{"_id":"qd4971722","text":"What was the total payment amount for Entergy Arkansas in millions of dollars for the most recent fiscal year or financial report?"}
{"_id":"qd4987d7e","text":"What were the total annual long-term debt maturities (excluding lease obligations) and the annual cash sinking fund requirements for debt outstanding in the year 2005, according to financial statements or debt management reports?"}
{"_id":"qd496c9c0","text":"What was the change in unamortized debt issuance costs for senior notes from 2016 to 2017, according to the financial statements or reports?"}
{"_id":"qd49856aa","text":"What was the percentage of equity ownership interests acquired in Eurosport, and what specific financial reports or transactions detail this acquisition?"}
{"_id":"qd49867da","text":"What was the change in the estimated future net amortization expense of the present value of future profits from 2013 to 2014, according to financial reports or accounting tables?"}
{"_id":"qd4987b12","text":"What is the combined total of purchase commitments, in thousands, for the years 2010 and 2011, based on financial reports or relevant data tables?"}
{"_id":"qd497471a","text":"What was the performance value of United Parcel Service, Inc. (UPS) in 2006, according to financial reports or performance metrics?"}
{"_id":"qd498cd6a","text":"What was the total freight revenue generated from the fuel surcharge program in 2014, according to industry financial reports or transportation data?"}
{"_id":"qd4978054","text":"What was the net change in the amortization expense value for the years 2016 to 2017, according to the financial statements or accounting reports?"}
{"_id":"qd49893e0","text":"What was the net income as a percentage of revenue for the year 2007, according to financial statements or reports?"}
{"_id":"qd497b006","text":"What was the total long-term debt value reported for the year 2011 in financial statements or economic reports?"}
{"_id":"qd498f47a","text":"What was the total amount of long-term debt maturities reported for the year 2018 in financial statements or debt maturity schedules?"}
{"_id":"qd496ecd4","text":"What was the value of Tier 2 capital for financial institutions in the year 2008, according to regulatory reports or financial statements?"}
{"_id":"qd4988152","text":"What was the percentage change in the KBW Bank Index return from 2009 to 2014, based on historical financial performance data?"}
{"_id":"qd498b99c","text":"What is the percentage of total commitments that are set to expire within the next year, based on the latest financial reports or commitment tables?"}
{"_id":"qd496e07c","text":"What was the variance of foreign exchange products in the first section for the year 2008, according to financial reports or market analysis data?"}
{"_id":"qd4977e06","text":"What was the net credit value reported for the year 2017 in financial statements or economic reports?"}
{"_id":"qd498cfd6","text":"What was the difference in rent expense and office equipment expense under agreements for the years 2012 and 2013, including specific numerical values or percentage changes?"}
{"_id":"qd4979f26","text":"What were the net sales figures for the year 2014 according to the latest financial reports or sales data tables?"}
{"_id":"qd4977410","text":"What is the current amount of goodwill reported in the latest financial statements or balance sheets?"}
{"_id":"qd498d90e","text":"What was the total revenue reported for the year 2013 in the financial statements or annual reports?"}
{"_id":"qd497ca32","text":"What was the cash flow from operating activities for the year 2014, according to the financial statements or cash flow reports?"}
{"_id":"qd497cff0","text":"What was the net purchase price after accounting for the cash acquired in the transaction?"}
{"_id":"qd496d3f2","text":"What was the total revenue for the risk and insurance brokerage services segment in the year 2009, according to industry financial reports or market analysis data?"}
{"_id":"qd496eb76","text":"What were the total annual long-term obligations reported for the year 2014 in financial statements or government reports?"}
{"_id":"qd498be10","text":"What is the maximum potential change in the line of credit for CME Group, based on their latest financial statements or credit agreements?"}
{"_id":"qd497f1d8","text":"What is the net change in cash flows from operations for the years 2011 to 2012, based on the financial statements or cash flow reports?"}
{"_id":"qd49779e2","text":"What was the total cash amount generated from operating activities in the most recent financial statements or cash flow reports?"}
{"_id":"qd496ea54","text":"What is the ratio of fair value to carrying value for specific assets or financial instruments, based on the latest financial statements or valuation reports?"}
{"_id":"qd4979b34","text":"What was the percentage change in capital gain distributions from 2008 to 2009, based on financial reports or investment fund data?"}
{"_id":"qd4978afe","text":"What is the net change in revenue for the Risk Solutions segment from 2010 to 2011, according to the financial reports or revenue tables?"}
{"_id":"qd4989e12","text":"What was the percentage of long-term debt in relation to the total aggregate contractual obligations as of December 31, 2004, according to financial statements or reports?"}
{"_id":"qd498aace","text":"What was the total investment value in Snap-on Incorporated for the year 2008, according to financial reports or investment records?"}
{"_id":"qd497d6c6","text":"What is the total sum of the provision recapture for purchased impaired loans for the years 2014 and 2015, according to financial reports or accounting tables?"}
{"_id":"qd498d85a","text":"What was the price performance of the Purchasing Managers' Index (PMI) in 2014, including any relevant charts or tables that detail monthly or quarterly changes?"}
{"_id":"qd497f58e","text":"What was the percentage of Tier 2 capital in relation to total capital in 2008, according to financial reports or banking regulatory data?"}
{"_id":"qd498a4d4","text":"What was the difference in free cash flow between the years 2015 and 2014, according to the financial statements or cash flow reports?"}
{"_id":"qd4983a30","text":"What was the stock price of Citigroup Inc. (Citi) at the end of 2017, according to historical financial data?"}
{"_id":"qd498fe8e","text":"What was the total amortization amount recorded for the years 2015 through 2018, according to financial statements or accounting reports?"}
{"_id":"qd498458e","text":"What was the stock price of United Parcel Service (UPS) in 2006, and what is the result when 100 is subtracted from that value?"}
{"_id":"qd497b25e","text":"What is the total sum of the average share prices for November and December 2023, based on the latest financial reports or stock market data?"}
{"_id":"qd4984afc","text":"What was the net sales value of North American consumer packaging in 2008, expressed in thousands of dollars?"}
{"_id":"qd497dedc","text":"What was the net difference in research and development expenditures between the years 2011 and 2012, according to financial reports or industry analysis?"}
{"_id":"qd4981e6a","text":"What is the combined total catastrophe losses in millions for the years 2009 and 2010, according to the latest disaster financial reports or loss databases?"}
{"_id":"qd4975aca","text":"What was the capital expenditure (CapEx) value for property, plant, and equipment (PP&E) in the year 2010, according to financial statements or industry reports?"}
{"_id":"qd4983508","text":"What was the total stock-based compensation expense for the years 2009 and 2010, and what is the difference between these two years?"}
{"_id":"qd4985d26","text":"What was the total net goodwill value for the years 2010 and 2011, and what was the change in this value between these two years according to the financial statements?"}
{"_id":"qd496efe0","text":"What was the net revenue figure for the year 2016 according to the latest financial reports or company earnings statements?"}
{"_id":"qd498885a","text":"What was the net pension cost for the year 2018 according to the latest financial reports or pension fund statements?"}
{"_id":"qd497ed64","text":"What was the change in rental expense between the years 2008 and 2009, according to financial reports or accounting records?"}
{"_id":"qd49812d0","text":"What was the stock price of E*TRADE Financial Corporation in 2014, minus an initial deduction of 100?"}
{"_id":"qd497a26e","text":"What was the total amount of purchase obligations due in 2008, as reported on December 31, 2007, in financial statements or obligations tables?"}
{"_id":"qd497e878","text":"What was the total rental expense under operating leases for the year 2005, according to financial statements or accounting reports?"}
{"_id":"qd4973504","text":"What is the final aggregate purchase price of all towers, expressed in millions of dollars, based on the latest financial reports or acquisition summaries?"}
{"_id":"qd49770fa","text":"What was the stock price of E*TRADE Financial Corporation at the end of 2014, according to historical financial data?"}
{"_id":"qd49878ce","text":"What was the net change in revenue for the year 2006 compared to 2007, based on financial reports or revenue tables?"}
{"_id":"qd498482c","text":"What was the percentage change in the return on investment (ROI) for LKQ Corporation from 2011 to 2016, based on financial performance reports?"}
{"_id":"qd497cb22","text":"What was the percentage increase in net revenue for the year 2008 compared to 2007, based on financial reports or revenue tables?"}
{"_id":"qd497da68","text":"What was the closing stock price of Tractor Supply Company (TSCO) for the year 2014, according to historical financial data?"}
{"_id":"qd497562e","text":"What was the total amount of additions charged to expense for the year 2009, according to the financial statements or accounting records?"}
{"_id":"qd498b6d6","text":"What was the change in research, development, and engineering (RD&E) spending from 2013 to 2014, according to industry financial reports or government statistics?"}
{"_id":"qd498eb10","text":"What were the total return fluctuations of Citigroup common stock from 2013 to 2017, including percentage changes and annual performance data?"}
{"_id":"qd498fd94","text":"What is the difference in rent payment amounts after 10 years versus after 5 years, based on historical rental data or lease agreements?"}
{"_id":"qd496fa58","text":"What was the remaining amount allocated for the share repurchase program of Schlumberger common stock as of December 31, 2012, according to financial reports or company disclosures?"}
{"_id":"qd4981640","text":"What percentage of total facilities were classified as BBB\/BAA in 2009, and if there were 50 total facilities, how many would have been categorized as BBB\/BAA based on that percentage?"}
{"_id":"qd497eb2a","text":"What was the total pension service cost in millions for the year 2018, according to financial reports or government budget documents?"}
{"_id":"qd496cfc4","text":"What was the total number of net undeveloped acres that expired in 2016 for both Africa and the United States, according to land use or agricultural reports?"}
{"_id":"qd497d5c2","text":"What was the total value of operating leases reported in financial statements for the year 2007?"}
{"_id":"qd497d964","text":"What is the net change in cash dividends from the period ending March 31, 2002, to the period ending March 31, 2003, according to the financial statements or dividend reports?"}
{"_id":"qd497729e","text":"What was the percentage change in investment banking fees between the years 2005 and 2006, according to industry financial reports or market analysis data?"}
{"_id":"qd49813d4","text":"What was the total accumulated other comprehensive losses value reported for the year 2014 in financial statements or accounting records?"}
{"_id":"qd496df14","text":"What was the total expense amount for repairs and maintenance incurred in the year 2011, according to financial reports or accounting records?"}
{"_id":"qd4973d42","text":"What was the total increase in the volume of the weather segment from 2009 to 2010, according to industry reports or market analysis data?"}
{"_id":"qd49704da","text":"What is the product of 45 and 4? Please provide the calculation result."}
{"_id":"qd497cc6c","text":"What was the change in the number of Restricted Stock Units (RSUs) issued from 2009 to 2010, according to the annual financial reports or stock compensation tables?"}
{"_id":"qd496e374","text":"What is the total sum of long-term debt due for the years 2004 and 2005, as detailed in the financial statements or balance sheets?"}
{"_id":"qd4975cf0","text":"What was the net rental expense reported for the year 2009 in financial statements or accounting records?"}
{"_id":"qd4983fc6","text":"What was the percentage of pension settlement losses in 2016 compared to the total amount of special termination settlements and curtailments for that year?"}
{"_id":"qd4983ea4","text":"What is the net change in the total accumulated other comprehensive losses for the years 2013 and 2014, based on the latest financial statements or reports?"}
{"_id":"qd49879d2","text":"What was the change in income from the defined benefit plan between the years 2016 and 2017, according to the financial statements or reports?"}
{"_id":"qd4987266","text":"What was the net change in development costs for the years 2006 and 2007, according to the financial reports or budget tables?"}
{"_id":"qd4980204","text":"What was the annual return percentage for United Parcel Service Inc. (UPS) in the year 2006, according to financial performance reports or stock market data?"}
{"_id":"qd4972c76","text":"What was the total amount of long-term debt due in the years 2004 and 2005, in thousands of dollars, as of December 31, 2003, according to the financial statements or debt schedules?"}
{"_id":"qd498f858","text":"What was the total contribution amount to defined contribution plans for foreign countries in the year 2008, according to financial reports or international pension data?"}
{"_id":"qd4987c84","text":"What was the total number of retail stores reported at the end of the year 2011, according to industry statistics or company reports?"}
{"_id":"qd497c672","text":"What is the total value of accumulated depreciation and amortization for the fiscal year ending in 2005, according to the financial statements or accounting reports?"}
{"_id":"qd498764e","text":"What were the total weighted average common shares outstanding for diluted earnings per share calculations for the years 2016 and 2017, according to financial statements or reports?"}
{"_id":"qd4978f04","text":"What was the net change in the value of total net goodwill for the years 2010 and 2011, according to financial statements or accounting reports?"}
{"_id":"qd49767c2","text":"What was the total interest cost incurred in the year 2018, according to financial statements or reports?"}
{"_id":"qd498f9c0","text":"What was the variation in the total gross amount of unrecognized tax benefits between the years 2017 and 2018, according to financial reports or tax-related data?"}
{"_id":"qd497d39c","text":"What was the closing value of PMI common stock in 2018, according to historical stock market data?"}
{"_id":"qd498540c","text":"What was the difference in the cash provided by operating activities for the years 2013 and 2014, according to the financial statements or cash flow reports?"}
{"_id":"qd4988d64","text":"What was the total net revenue for the year 2017, expressed in millions of dollars, according to the latest financial reports or revenue tables?"}
{"_id":"qd4982a22","text":"What was the stock price performance of Advance Auto Parts in January 2009, including opening, closing, high, and low prices?"}
{"_id":"qd496fe5e","text":"What was the percentage of office space in square feet that was not leased in Alpharetta, Georgia, as of December 31, 2013, according to commercial real estate reports?"}
{"_id":"qd4984912","text":"What was the numerical difference in the value of sold receivables between the years 2007 and 2008, according to financial reports or accounting records?"}
{"_id":"qd497d7e8","text":"What were the consolidated net sales in billions for the year 2019, based on the net sales figures from the segment in 2009 and the percentage they represented of the total consolidated net sales for that year?"}
{"_id":"qd4985556","text":"What is the current value of goodwill as reported in the latest financial statements or accounting records?"}
{"_id":"qd498efb6","text":"What was the difference in freight revenue from the fuel surcharge program between the years 2012 and 2013, according to industry financial reports or transportation revenue data?"}
{"_id":"qd497bbdc","text":"What was the value of the S&P Financials sector index in 2016, according to historical financial data or market reports?"}
{"_id":"qd498d30a","text":"What were the net inventory levels reported for the year 2003 in financial or economic data sources?"}
{"_id":"qd498a826","text":"What was the total number of stores at the beginning of 2012, according to the annual retail industry report or company financial statements?"}
{"_id":"qd497e5a8","text":"What is the net change in the price of Henry Hub natural gas between the years 2007 and 2009, based on historical market data or price charts?"}
{"_id":"qd498e282","text":"What is the total amount of receivables reported from Puerto Rico in the latest financial statements or accounting records?"}
{"_id":"qd496f2b0","text":"What was the total value of liabilities reported in financial statements for the year 2007?"}
{"_id":"qd4970778","text":"What was the percentage change in the average investment values from 2014 to 2015, according to the financial reports or investment data tables?"}
{"_id":"qd498fbaa","text":"What percentage do intangibles represent of the total amortization amount for the year 2014, based on financial statements or accounting reports?"}
{"_id":"qd4976fc4","text":"What was the value of the S&P 500 index in 2005, and how much would an initial $100 investment in that year be worth today based on historical performance?"}
{"_id":"qd4984fac","text":"What was the fair value per share of the company in 2015 according to financial reports or stock market analysis?"}
{"_id":"qd49886d4","text":"What was the net change in the fair value of outstanding derivatives from 2007 to 2008, according to financial reports or market analysis data?"}
{"_id":"qd497a0fc","text":"What is the percentage of total identifiable net assets that is held in cash, according to the latest financial statements or asset breakdown reports?"}
{"_id":"qd4983918","text":"What was the stock price of Tractor Supply Company (TSCO) in 2013, according to historical financial data?"}
{"_id":"qd497b650","text":"What was the percentage of long-term retail and high-net-worth (HNW) individuals in the Americas compared to the total long-term retail and HNW figures, based on the latest financial reports or market analysis?"}
{"_id":"qd498bcda","text":"What was the variation in capital gain distributions between the years 2008 and 2009, according to financial reports or investment data tables?"}
{"_id":"qd4981776","text":"What was the change in interest income for the year 2015 compared to 2014, based on financial statements or reports?"}
{"_id":"qd498e372","text":"What was the total amount of long-term debt due in the year 2014, according to the financial statements or balance sheets of relevant companies?"}
{"_id":"qd496e64e","text":"What was the percentage change in net revenues for the year 2003 compared to 2002, according to financial reports or revenue tables?"}
{"_id":"qd49708fe","text":"What was the closing price of common stock for the specified company on February 11, 2011, according to historical stock market data?"}
{"_id":"qd498abe6","text":"What was the change in the number of Class A common stocks issued and outstanding between the years 2016 and 2017, according to financial reports or stock issuance data?"}
{"_id":"qd497d266","text":"What was the total amount of short-term borrowings reported for the year 2016 in financial statements or economic reports?"}
{"_id":"qd497a84a","text":"What was the impact of volume and weather on net revenue in millions for the year 2010, based on available financial reports or analysis?"}
{"_id":"qd4983c4c","text":"What was the net change in the non-US pension plans rate between 2014 and 2015, according to financial reports or pension fund statistics?"}
{"_id":"qd49714d4","text":"What is the net change in the value of Loews Corporation common stock between the years 2013 and 2014, based on historical stock price data?"}
{"_id":"qd498f204","text":"To enhance the clarity and specificity of the original query, I will identify the intent and rephrase it accordingly.\n\n- Original Query: 'what was the difference common stock under stock and option plans and the total number?'\n- Rewritten Query: 'What is the total number of common stock shares issued under stock and option plans, and what is the difference in the number of shares between these two plans as reported in the latest financial statements?'"}
{"_id":"qd497dcde","text":"What was the total increase in other regulatory credits for the year 2003, according to financial reports or regulatory filings?"}
{"_id":"qd497f9bc","text":"What was the stock price of Ball Corporation in the year 2010, according to historical financial data?"}
{"_id":"qd496cb6e","text":"What was the ratio of discretionary company contributions to total expensed amounts for savings plans in the year 2009, according to financial reports or relevant data tables?"}
{"_id":"qd497ec92","text":"What is the combined total cash paid for interest in the years 2015 and 2016, according to the financial statements or cash flow reports?"}
{"_id":"qd496d8f2","text":"What was the total number of gas customers in the year 2008 according to industry reports or utility company data?"}
{"_id":"qd498103c","text":"What is the value of the \"Other Sinking Fund Requirements\" in thousands, as reported in the latest financial statements or budget documents?"}
{"_id":"qd498043e","text":"What was the total value of deferred compensation plan investments reported for the year 2011?"}
{"_id":"qd4980f24","text":"What was the net income (or loss) attributable to common shareholders for the year 2008, according to the financial statements or annual reports?"}
{"_id":"qd4977be0","text":"What was the percentage contribution of investment banking to total segment operations in 2005, according to financial reports or industry analyses?"}
{"_id":"qd498a100","text":"What was the change in the value of interest retained by UPRI from 2007 to 2008, according to financial reports or data tables?"}
{"_id":"qd4975fb6","text":"What is the total sum of the weighted average common shares outstanding for diluted earnings per share calculations for the years 2016 and 2017, according to financial statements or reports?"}
{"_id":"qd49763a8","text":"What was the cash dividend per share declared by companies in the last quarter of 2002, according to financial reports or dividend history tables?"}
{"_id":"qd4985f56","text":"To enhance the clarity and specificity of the query, I would rewrite it as follows:\n\n\"What is the projected change in the multi-currency line of credit if the anticipated increase is fully realized, based on the latest financial reports or credit agreements?\""}
{"_id":"qd4983652","text":"What was the value of gross unrecognized tax benefits reported at the end of the fiscal year 2015?"}
{"_id":"qd4975822","text":"What was the total amount of U.S. dollar notes issued in 2014 that matured in either 2024 or 2044, expressed in millions of dollars?"}
{"_id":"qd49846ec","text":"What is the net change in long-term debt payments for the years 2007 to 2011, based on financial statements or reports?"}
{"_id":"qd49798f0","text":"What was the price of the Purchasing Managers' Index (PMI) in 2014 according to economic reports or financial databases?"}
{"_id":"qd497c3de","text":"What was the closing price of the common stock for [specific company name] in February 2011, according to historical stock market data?"}
{"_id":"qd4974012","text":"What was the percentage of the notional value of derivatives designated as hedging instruments under GAAP in 2014, compared to their fair value, according to financial reporting standards?"}
{"_id":"qd4987018","text":"What was the total operating income reported for the year 2013 in financial statements or economic reports?"}
{"_id":"qd498b06e","text":"What was the total value of AFS (Available-for-Sale) investment securities reported in financial statements for the year 2018?"}
{"_id":"qd49860dc","text":"What were the cash capital investments in railway track infrastructure for the year 2006, according to industry financial reports or investment data?"}
{"_id":"qd498aee8","text":"What was the total net long-term debt value reported for the year 2015 in financial statements or balance sheets?"}
{"_id":"qd497f0a2","text":"What was the percentage of higher charges related to tobacco and health judgments compared to the increase in operating companies' income during the year 2011?"}
{"_id":"qd4972f78","text":"What was the average individual share price for the shares involved in the acquisition of Suros, according to the acquisition financial reports?"}
{"_id":"qd49768da","text":"What is the net change in compensation costs recognized for Restricted Stock Units (RSUs) from the fiscal year 2008 to 2009, according to financial statements or compensation reports?"}
{"_id":"qd498a218","text":"What was the percentage of federal net operating losses (NOL) set to expire between 2016 and 2020 in relation to the total federal NOL for the year 2005?"}
{"_id":"qd4970bd8","text":"What is the total number of shares purchased in November 2018 for the fourth quarter ending December 31, 2018, according to financial reports or stock purchase records?"}
{"_id":"qd497780c","text":"What was the weighted average cost per share for the company in 2017, according to financial reports or stock market data?"}
{"_id":"qd4980c18","text":"What is the total count of securities that have been approved by security holders according to the latest regulatory filings or financial reports?"}
{"_id":"qd4984214","text":"What was the average annual change in the WTI crude oil benchmark prices from 2007 to 2009, including specific values for each year?"}
{"_id":"qd497ef44","text":"What was the total diluted earnings per common share for the company as of December 2013, according to the financial statements or earnings reports?"}
{"_id":"qd496da50","text":"What was the operating income in millions of dollars for the year 2017, according to the latest financial reports or income statements?"}
{"_id":"qd496dd84","text":"What was the total amount of accumulated other comprehensive losses reported for the year 2015 in financial statements or accounting records?"}
{"_id":"qd4977f3c","text":"What was the change in amortized cost for the year 2009, including specific figures or percentage variations from the previous year?"}
{"_id":"qd496d596","text":"What was the percentage change in the S&P 500 index price from the end of 2015 to the end of 2016, based on historical market data?"}
{"_id":"qd4990190","text":"What was the annual performance percentage of JKHY (Jack Henry & Associates) stock in the year 2010, including details on price changes and market trends?"}
{"_id":"qd496d758","text":"What is the current ratio of fair value to carrying value for assets, as reported in the latest financial statements or valuation reports?"}
{"_id":"qd497264a","text":"What was the change in net revenue from 2015 to 2016, according to the financial statements or revenue reports?"}
{"_id":"qd49863d4","text":"What was the total liabilities for litigation settlements in 2006 and 2007, and what was the change in value between these two years?"}
{"_id":"qd498c194","text":"What was the total amount of long-term debt due in 2014, expressed in thousands of dollars, according to financial statements or debt reports?"}
{"_id":"qd498f6f0","text":"What were the buy and sell volumes recorded in 2006, according to financial market data or trading reports?"}
{"_id":"qd497b11e","text":"What was the value of goodwill, defined as the excess of the purchase price over the fair value of net tangible and identifiable intangible assets acquired in the 1000 merger?"}
{"_id":"qd496d2b2","text":"What is the total amount of oil and gas in million barrels of oil equivalent (MMBOE) produced from Canada, and how does this figure compare to the overall global production total?"}
{"_id":"qd496e252","text":"What was the total amount of financial notes maturing in June 2022, according to the latest bond issuance reports or financial statements?"}
{"_id":"qd497019c","text":"What was the operating income value for the year 2017 according to the latest financial statements or reports?"}
{"_id":"qd497bf38","text":"What was the value of Loews Corporation's common stock in 2011, and what is the result when 100 is subtracted from that value?"}
{"_id":"qd49733ce","text":"What was the percentage change in the performance value of the S&P 500 index from the end of 2012 to the end of 2017, based on historical financial data?"}
{"_id":"qd49730fe","text":"What was the reported operating profit for the year 2018 according to financial statements or industry reports?"}
{"_id":"qd4976632","text":"What was the total future minimum lease commitments, in millions, for all operating leases with a remaining term of more than one year as of December 31, 2006?"}
{"_id":"qd497dbb2","text":"What was the total shipment volume of smokeless products in 2011 compared to 2012, and what is the difference in volume between these two years?"}
{"_id":"qd498e02a","text":"What was the profit margin percentage for the year 2015 according to the financial statements or reports of the relevant company or industry?"}
{"_id":"qd498c572","text":"What is the total number of shares excluded from the current stock repurchase plan, according to the latest financial report or company disclosures?"}
{"_id":"qd498c7b6","text":"What was the average number of outstanding shares of common stock per registered holder as of February 13, 2009, according to financial reports or stockholder data?"}
{"_id":"qd49764fc","text":"What is the value of MMBOE (Million Barrels of Oil Equivalent) produced in Canada, and how does it compare to the total MMBOE production globally?"}
{"_id":"qd49754ee","text":"What was the total expenditure on share repurchases in October 2007, according to financial reports or stock market data?"}
{"_id":"qd498a38a","text":"What was the variation in long-term debt between the years 2004 and 2005, according to financial reports or economic data tables?"}
{"_id":"qd498e4da","text":"What is the net change in total commitments to extend credit and other commitments for the years 2017 and 2018, based on financial reports or relevant data tables?"}
{"_id":"qd497ddba","text":"What is the net change in the value of annual long-term debt maturities for the years 2016 and 2017, based on financial statements or debt maturity schedules?"}
{"_id":"qd497ac6e","text":"What was the variance in share prices during the first quarter of 2002, according to financial market data or stock exchange reports?"}
{"_id":"qd498bb90","text":"What was the net revenue change for the company from 2012 to 2013, including specific figures or percentage growth?"}
{"_id":"qd49806fa","text":"What was the carrying amount of trading assets reported on the consolidated balance sheet for the year 2008?"}
{"_id":"qd497ae62","text":"What was the total net expenditure on research and development (R&D) in 2013, according to official financial reports or industry statistics?"}
{"_id":"qd4985b64","text":"What was the closing value of the S&P 500 index on January 3, 2009, and what was its closing value at the end of 2006? Please provide the difference between these two values."}
{"_id":"qd4988ff8","text":"What were the operating revenues reported for the year 2002 in the financial statements or annual reports?"}
{"_id":"qd49857c2","text":"What is the total value of the options, warrants, and rights available for future issuance as of the latest financial report or company filings?"}
{"_id":"qd497f2fa","text":"What was the total interest expense in millions for the fiscal year ending May 27, 2012, according to the financial statements or reports?"}
{"_id":"qd4980d76","text":"What was the change in rent expenses between the years 2011 and 2012, according to financial reports or expense tables?"}
{"_id":"qd498664a","text":"What is the total number of securities that will be issued upon the exercise of outstanding options, warrants, and rights under equity compensation plans that have been approved by security holders? Please provide the latest figures from relevant financial reports or disclosures."}
{"_id":"qd498b85c","text":"What was the difference in accrued wages and vacation days between the years 2007 and 2008, based on financial reports or payroll data?"}
{"_id":"qd497c15e","text":"What was the specific change in amortization expense for the years 2007 and 2008, according to the financial statements or accounting reports?"}
{"_id":"qd497915c","text":"What is the net change in the fair value of forward exchange contracts classified as assets from 2010 to 2011, according to financial statements or reports?"}
{"_id":"qd4974ac6","text":"What was the percentage of total second generation capital expenditures attributed to the office-related reportable operating segment in 2012, according to financial reports or segment analysis?"}
{"_id":"qd4976b96","text":"What was the change in the value of Loews common stock from 2010 to 2011, based on historical stock price data?"}
{"_id":"qd4980b0a","text":"What is the non-tower cash flow value for the fiscal year ending December 31, 2005, according to the financial statements or cash flow reports?"}
{"_id":"qd498e174","text":"What is the net amount paid from long-term debt, after accounting for discounts and debt issuance costs, expressed in millions?"}
{"_id":"qd497611e","text":"What was the total amount of unamortized debt issuance costs related to credit facilities in the year 2017, according to financial statements or reports?"}
{"_id":"qd4989520","text":"What was the total amount of accrued wages and vacation for employees as of December 31, 2008, according to the financial statements or accounting records?"}
{"_id":"qd4976a60","text":"What was the performance value of Cadence Design Systems Inc. in the year 2004, according to financial reports or historical performance data?"}
{"_id":"qd497f700","text":"What was the difference in amortization expense reported for the years 2008 and 2009 in the financial statements?"}
{"_id":"qd4982b3a","text":"What was the performance price of Loews Corporation common stock for the year 2012, including any relevant financial data or historical stock price charts?"}
{"_id":"qd497e238","text":"What was the closing price of the S&P 500 index at the end of the year 2012, and how did it perform throughout that year?"}
{"_id":"qd498984a","text":"What is the difference in segment revenue between the years 2008 and 2009, based on the latest financial reports or revenue tables?"}
{"_id":"qd4990050","text":"What were the contingent payments made to the former shareholders of Impella in 2019, contingent upon the approval of Impella 2.5 and Impella 5.0 devices?"}
{"_id":"qd49702b4","text":"What are the net cash flows from operating and investing activities for the most recent fiscal year, according to the latest financial statements or cash flow reports?"}
{"_id":"qd497ad40","text":"What was the total value of industrial packaging sales in Europe for the year 2007, expressed in millions of dollars or euros?"}
{"_id":"qd498eea8","text":"What is the net change in the total purchased impaired loans from December 31, 2014, to December 31, 2015, based on financial reports or loan portfolio data?"}
{"_id":"qd497fade","text":"What was the total net change in the net fair value of outstanding derivatives from 2007 to 2008, according to financial reports or market analysis data?"}
{"_id":"qd498dcd8","text":"What was the difference in cash capital investments in railway track between the years 2004 and 2005, according to industry financial reports or investment data?"}
{"_id":"qd4985312","text":"What was the stock price of Cadence Design Systems in 2018, according to historical financial data?"}
{"_id":"qd497f46c","text":"What was the net change in the value of net earnings attributable to PMI (Philip Morris International) from 2016 to 2017, according to the company's financial statements or annual reports?"}
{"_id":"qd4986f00","text":"What was the total value of US dollar notes issued in November 2014, expressed in millions of dollars?"}
{"_id":"qd498df58","text":"What was the highest share price of the company for the quarter ending March 31, 2008, according to financial reports or stock market data?"}
{"_id":"qd4975be2","text":"What was the total variance in net revenue for the years 2010 and 2011, based on financial reports or revenue data tables?"}
{"_id":"qd4984304","text":"What was the weighted average discount rate for postretirement plans in the United States for the year 2018, according to financial reports or pension plan disclosures?"}
{"_id":"qd4977708","text":"What were the net earnings values for basic and diluted earnings per share (EPS) in 2017, according to the financial statements or earnings reports?"}
{"_id":"qd498e8b8","text":"What was the total change in net revenue, in millions, for both reserve equalization and purchased power capacity from 2015 to 2016?"}
{"_id":"qd4976e70","text":"What was the percentage change in the average price per share of [specific stock or index] from 2010 to 2011, based on historical financial data?"}
{"_id":"qd4984476","text":"What was the value of the distressed loan portfolio purchased by the company in 2019, specifically in the year 2010?"}
{"_id":"qd4975e44","text":"What was the percentage of total investment amounts attributed to the specific track in the year 2006, according to investment reports or financial tables?"}
{"_id":"qd4976222","text":"What is the total monetary value of all issued options, warrants, and rights as reported in the latest financial statements or equity issuance data?"}
{"_id":"qd4974bca","text":"What is the total sum of long-term debt due for the years 2004 and 2005, as detailed in the financial statements or balance sheets?"}
{"_id":"qd496ccfe","text":"What was the total amount of equipment rents payable in the year 2008, according to financial records or accounting reports?"}
{"_id":"qd4974eae","text":"What was the beginning balance of unrecognized tax benefits in gross amounts for the year 2018, according to financial statements or tax disclosures?"}
{"_id":"qd497596c","text":"What was the total amount of statutory capital and surplus reported for Bermuda subsidiaries in the year 2010, according to financial statements or regulatory filings?"}
{"_id":"qd4983d78","text":"What is the most recent year included in the remaining terms of the facility leases, according to the latest lease agreements or financial reports?"}
{"_id":"qd497c01e","text":"What was the total non-tower cash flow amount for the year 2005, according to financial reports or cash flow statements?"}
{"_id":"qd4973eb4","text":"What was the change in investment income between the years 2011 and 2012, according to financial reports or investment income tables?"}
{"_id":"qd49729a6","text":"What were the non-GAAP capital expenditures reported for the year 2012, according to financial statements or industry reports?"}
{"_id":"qd4986230","text":"What was the change in the total value of residential mortgages, in millions, between the years 2012 and 2013, according to financial reports or mortgage market data?"}
{"_id":"qd498088a","text":"What is the net change in total maximum exposure to loss for VIES (VAT Information Exchange System) from the year 2016 to 2017, based on available financial reports or risk assessment data?"}
{"_id":"qd49745d0","text":"What were the combined total sales proceeds, in millions, from subsidiary assets for the months of December and August 2003, specifically for the locations of Bangladesh and the Republic of Georgia?"}
{"_id":"qd49837ce","text":"What was the percentage contribution of Eurasia SBU to the total revenue in 2017, according to the financial reports or revenue breakdown tables?"}
{"_id":"qd497c28a","text":"What was the percentage of net sales attributed to international markets in 2017, according to the company's financial reports or sales data?"}
{"_id":"qd49823ec","text":"What was the value of net income adjusted to reconcile net income to net cash provided by operating activities for the year 2015, according to the financial statements or cash flow reports?"}
{"_id":"qd4974fc6","text":"What was the weighted average discount rate for U.S. pension plans in the year 2015, according to financial reports or pension fund analyses?"}
{"_id":"qd497a61a","text":"What were the pre-tax pension expense and postretirement expense figures for the year 2019, according to financial statements or pension reports?"}
{"_id":"qd498f592","text":"What was the total value of liabilities assumed in the most recent financial statements or reports?"}
{"_id":"qd4984d72","text":"What was the change in the stock value of Cadence Design Systems Inc. from 2001 to 2006, based on historical financial data?"}
{"_id":"qd498338c","text":"What is the total goodwill amount reported in the latest financial statements or balance sheets for the current fiscal year?"}
{"_id":"qd49851a0","text":"What was the total expense related to discontinued operations for the year 2013, according to financial statements or reports?"}
{"_id":"qd4974986","text":"What was the net revenue reported for Entergy Texas, Inc. in the year 2016 according to financial statements or industry reports?"}
{"_id":"qd49830f8","text":"What is the ratio of the account balance at the end of 2012 to the account balance at the beginning of 2010, based on financial statements or balance sheets?"}
{"_id":"qd497a750","text":"What was the total accrued value of tax-related interest and penalties for the year 2011, according to financial reports or tax authority data?"}
{"_id":"qd498290a","text":"What was the net change in the value of the NASDAQ Composite Index from the end of 2017 to the end of 2018, based on historical market data?"}
{"_id":"qd4988bc0","text":"What is the total value of net operating loss carryforwards reported in the latest financial statements or tax filings?"}
{"_id":"qd497e468","text":"What was the percentage change in proportional free cash flow from 2008 to 2009, relative to the free cash flow amount in 2008?"}
{"_id":"qd4971114","text":"What were the total investment banking fees in 2007, according to industry reports or financial market analyses?"}
{"_id":"qd4988954","text":"What were the total revenues reported for the year 2007 in the financial statements or annual reports?"}
{"_id":"qd4987fcc","text":"What was the unpaid principal balance outstanding of loans sold as a participant in specific programs during the year 2011, expressed in billions of dollars?"}
{"_id":"qd496e874","text":"In which year are the payments to participants in the unfunded German plans projected to be around $26 million, based on the latest financial forecasts or reports?"}
{"_id":"qd4973946","text":"What is the amount of long-term debt classified under current liabilities on the balance sheet for the period ending September 28, 2008?"}
{"_id":"qd498ca04","text":"What was the expected annual dividends per share for the year 2007, according to financial reports or stock market data?"}
{"_id":"qd49892dc","text":"What was the decrease in net earnings attributable to PMI over the past year, expressed in millions of dollars?"}
{"_id":"qd4982c20","text":"What was the change in capital expenditures for property, plant, and equipment (PP&E) from 2008 to 2009, according to financial reports or industry data?"}
{"_id":"qd497bde4","text":"What was the total amount of unrealized losses related to reclassifications before tax for the year 2011, according to financial reports or accounting statements?"}
{"_id":"qd498fac4","text":"What were the lease payments made to the employee who became an officer of the company after the business acquisition in 2008, according to the company's financial records?"}
{"_id":"qd496ee8c","text":"What was the change in Research, Development, and Engineering (RD&E) spending from 2013 to 2014, according to financial reports or industry analysis?"}
{"_id":"qd497dff4","text":"What was the net change in revenue for the year 2007 compared to 2008, based on financial reports or revenue tables?"}
{"_id":"qd4984c28","text":"What was the change in the fair value per share of the company from 2014 to 2016, based on financial reports or valuation tables?"}
{"_id":"qd497e9a4","text":"What was the change in the contingent rental liability amount for the years 2007 and 2009, based on financial statements or reports?"}
{"_id":"qd498ada8","text":"What is the value of Euro banknotes that have maturities in March 2021, according to the latest financial reports or currency exchange tables?"}
{"_id":"qd497fd2c","text":"What is the ratio of the payment amount per share for the years 2017 and 2016, based on financial reports or shareholder distributions?"}
{"_id":"qd4981fc8","text":"What is the numerical difference between the highest and lowest future benefit payments made for postretirement benefit plans, based on the latest financial reports or actuarial tables?"}
{"_id":"qd497d0f4","text":"What is the net change in interest income value from 2014 to 2015, based on financial reports or income statements?"}
{"_id":"qd49858da","text":"What was the net change in rental expense for operating leases between the years 2008 and 2009, according to financial statements or accounting reports?"}
{"_id":"qd496c6a0","text":"What was the weighted average exercise price per share for stock options in the year 2007, according to financial reports or equity compensation data?"}
{"_id":"qd49800e2","text":"What is the net change in the value of securities from 2008 to 2009, based on financial reports or market data?"}
{"_id":"qd497a4ee","text":"What was the total amount of future minimum lease commitments for all operating leases with a remaining term of over one year, as of December 31, 2006, according to financial statements or lease disclosures?"}
{"_id":"qd4974878","text":"What was the value of miscellaneous receivables and other assets in 2012, and what is that amount when divided by 100?"}
{"_id":"qd497bcc2","text":"What percentage of the company's owned facilities are located in Europe, based on the latest operational data or facility reports?"}
{"_id":"qd498a97a","text":"What was the change in the share price of [specific company name] from the lowest to the highest value during the quarter ending September 30, 2010, according to financial market data?"}
{"_id":"qd498c64e","text":"What are the total payment amounts generated from the sale of 1,000 units of Impella 2019 products globally, including any relevant pricing data or sales figures?"}
{"_id":"qd498d422","text":"What was the cash provided by operating activities for the year 2015, according to the financial statements or cash flow reports?"}
{"_id":"qd4979db4","text":"What was the total expense amount for repairs and maintenance incurred in the year 2013, according to the financial statements or budget reports?"}
{"_id":"qd4974d64","text":"What was the change in the amount of guarantees provided by the parent company from 2007 to 2008, according to the financial statements or reports?"}
{"_id":"qd4986b4a","text":"What was the cash dividend amount paid per common stock share for the year 2006, according to financial reports or dividend history tables?"}
{"_id":"qd497f818","text":"What percentage of the total dividends distributed in 2019 was attributed to the first quarter, based on financial reports or dividend distribution tables?"}
{"_id":"qd497b3d0","text":"To enhance the clarity and specificity of the query, the rewritten version could be:\n\n\"What is the difference between the beginning balance carrying amount of loan receivables and the corresponding allowance for loan losses as of the start of the fiscal year?\""}
{"_id":"qd498150a","text":"What was the statutory net income reported for Bermuda subsidiaries in the year 2010, according to financial statements or regulatory filings?"}
{"_id":"qd497e724","text":"What was the average share price for major companies in February 2009, according to historical stock market data?"}
{"_id":"qd497325c","text":"What was the operating profit margin for the Americas region as a percentage of net sales in the year 2003, according to financial reports or company performance tables?"}
{"_id":"qd498ec5a","text":"What was the highest sales price recorded in the second quarter of 2016 according to sales data or market reports?"}
{"_id":"qd497ce92","text":"What was the total balance of the unaffiliated life insurance company for the year 2017, according to financial statements or industry reports?"}
{"_id":"qd4975110","text":"What was the dollar value of capital investments allocated for the buyout of locomotives in 2012, according to financial reports or investment records?"}
{"_id":"qd49799ea","text":"What was the impact in million barrels of oil equivalent (mmboe) from the increase in drilling programs in US resource plays, considering the effects of discontinued operations due to technical reevaluation and the decrease in royalty percentages linked to lower realized prices?"}
{"_id":"qd4970034","text":"What was the net revenue change for the period between December 28, 2012, and December 29, 2013, according to the financial statements or revenue reports?"}
{"_id":"qd498dbb6","text":"What was the operating profit value for the year 2011 according to the financial statements or reports?"}
{"_id":"qd498e7a0","text":"What was the adjusted operating profit margin for the year 2017 according to financial reports or industry analyses?"}
{"_id":"qd4970606","text":"What was the stock price of E*TRADE Financial on December 14, 2023, according to historical market data?"}
{"_id":"qd4981a46","text":"What was the combined total liability from the 2003 and 2007 programs as of December 31, 2008, according to the financial statements or reports?"}
{"_id":"qd498ff92","text":"What was the net revenue reported for Entergy Texas, Inc. in the fiscal year 2007 according to financial statements or annual reports?"}
{"_id":"qd497cd70","text":"What was the total amount of consumer packaging sales attributed to foodservice net sales in the year 2006, according to industry reports or financial data?"}
{"_id":"qd4973afe","text":"What is the total acquisition cost of all towers in the MTN Group acquisition, expressed in millions of dollars, according to the latest financial reports or acquisition summaries?"}
{"_id":"qd497ba9c","text":"What was the net change in non-utility nuclear earnings between the years 2001 and 2002, according to financial reports or industry earnings tables?"}
{"_id":"qd4989174","text":"What was the reported value of AFS (Available-for-Sale) investment securities in the financial statements for the year 2018?"}
{"_id":"qd497857c","text":"What was the total revenue generated from transactions with related parties in the year 2017, according to financial statements or reports?"}
{"_id":"qd4987540","text":"What was the investment value of Cadence Design Systems Inc. in 2012, according to historical financial records or stock market data?"}
{"_id":"qd4984e8a","text":"What was the total value of inventories reported in 2018 according to financial statements or economic reports?"}
{"_id":"qd498bf64","text":"What was the reported free cash flow value for the year 2015 according to financial statements or cash flow reports?"}
{"_id":"qd497ffde","text":"What was the fair value reported for the year 2011 in financial statements or valuation reports?"}
{"_id":"qd49818ac","text":"What was the net revenue change for Entergy Texas in the year 2007, according to financial reports or revenue statements?"}
{"_id":"qd498e9f8","text":"What was the value of Cadence Design Systems in 2018 after subtracting an initial investment of $100, according to financial reports or stock market data?"}
{"_id":"qd49805a6","text":"What was the total expense for repairs and maintenance in 2013 compared to 2014, and what is the difference in these amounts?"}
{"_id":"qd497977e","text":"To enhance the clarity and specificity of the query, the rewritten version could be:\n\n\"What is the difference between the fair value and carrying value of all notes as reported in the latest financial statements or accounting records?\""}
{"_id":"qd49789be","text":"What is the total value of operating leases with a remaining term of more than one year, expressed in billions of dollars, according to the latest financial reports or lease accounting standards?"}
{"_id":"qd4982f22","text":"What percentage of the total long-term debt obligations is attributed to long-term debt, based on the latest financial statements or reports?"}
{"_id":"qd4989f8e","text":"What was the net change in cash contributions to funded plans and the total benefit payments for unfunded plans between the years 2015 and 2016, according to financial reports or pension fund data?"}
{"_id":"qd496ce3e","text":"What percentage of the gallons hedged in 2018 is represented by the gallons hedged in 2017, based on available hedging reports or financial data?"}
{"_id":"qd498d4f4","text":"What is the total amount of payments made for the 7-year notes issued by Entergy to NYPA, including any interest or principal repayments?"}
{"_id":"qd4978842","text":"What was the balance in the air value of our foreign currency forward contracts for the year 2009, according to the financial statements or relevant accounting records?"}
{"_id":"qd4975386","text":"What was the percentage of the net allowance in relation to the carrying amount of the purchased distressed loan portfolio for the company in 2010?"}
{"_id":"qd4970a48","text":"What was the total cash outflow for share repurchases in November 2007, expressed in millions of dollars, according to financial reports or company filings?"}
{"_id":"qd4978716","text":"What was the highest recorded price in 2016 for [specific item or category, e.g., crude oil, housing, etc.] according to market data or financial reports?"}
{"_id":"qd497942c","text":"What were the total values and key characteristics of operating leases reported in financial statements for the year 2007?"}
{"_id":"qd4977596","text":"What was the change in total debt to be repaid in contractual obligations for future payments under existing debt, lease commitments, and purchase obligations for the years 2008 and 2009, specifically as of December 31, 2005?"}
{"_id":"qd4979030","text":"What was the total value of inventories reported in financial statements for the year 2003?"}
{"_id":"qd498da94","text":"What was the change in the account balance from January 1, 2010, to December 31, 2012, based on financial statements or balance sheets?"}
{"_id":"qd49742ec","text":"What is the total sum of net revenues for the years 2016 and 2017, based on the latest financial reports or revenue tables?"}
{"_id":"qd4987eb4","text":"What was the change in the estimated sensitivity to a one basis point increase in credit spreads on financial liabilities with the fair value option elected, specifically between the years 2015 and 2016?"}
{"_id":"qd4973676","text":"What is the value of 1000 multiplied by the total number of votes associated with the authorized, issued, and outstanding shares of Class B-3 common stock in the year 2017?"}
{"_id":"qd4989c8c","text":"What was the annual cash dividend per share paid on common stock in 2006, expressed in US dollars?"}
{"_id":"qd49873e2","text":"What was the connected fitness value recorded in 2014 according to industry reports or fitness analytics data?"}
{"_id":"qd49751f6","text":"What was the change in the number of shares issued under the Employee Stock Purchase Plan (ESPP) from 2016 to 2017, according to the company's financial reports or stock issuance data?"}
{"_id":"qd497ab06","text":"What is the expiration year of the initial lease for the Chicago headquarters, according to the latest corporate real estate documents or lease agreements?"}
{"_id":"qd49741b6","text":"What were the total cabinet sales figures for the year 2017, according to industry reports or market analysis data?"}
{"_id":"qd498d0f8","text":"What was the earnings value for non-utility nuclear power in the year 2002, according to industry financial reports or energy sector data?"}
{"_id":"qd497c816","text":"What was the total decrease in net interest amount from fiscal year 2015 to fiscal year 2016, according to the financial statements or reports?"}
{"_id":"qd4988ecc","text":"What was the total operating expenses amount for the year 2018, according to the financial statements or reports?"}
{"_id":"qd4982266","text":"What is the current financial ratio of Robert Mondavi, specifically the current ratio, as reported in the latest financial statements or quarterly earnings reports?"}
{"_id":"qd4985e34","text":"What was the total rent expense recorded for the year 2007 in the financial statements or accounting reports?"}
{"_id":"qd4989714","text":"What was the variation in net credit between the years 2016 and 2017, according to financial reports or economic data tables?"}
