{"_id":"q1a73c1d4","title":"","text":"interest income, 7,000 thousands, year, financial analysis"}
{"_id":"q1a72ef98","title":"","text":"Net Income, 2019, financial performance, earnings report, fiscal year, profit, loss, revenue, expenses"}
{"_id":"q1a716380","title":"","text":"Plan Assets, Other assets, 2019, percentage"}
{"_id":"q1a73f97e","title":"","text":"service revenue, Americas, 2019"}
{"_id":"q1a731ee6","title":"","text":"Customer support renewal rate, June 30, 2019."}
{"_id":"q1a729624","title":"","text":"Loans due from subsidiaries, current portion, 2018, 2019, financial analysis, subsidiary loans, current liabilities, year-over-year change."}
{"_id":"q1a732468","title":"","text":"Voyage expenses, Years Ended December 31, 2018, 2019, change, financial analysis, year-over-year comparison"}
{"_id":"q1a73f24e","title":"","text":"Depreciation, Amortization, 2018, 2019, financial analysis, accounting standards, cash flow, asset valuation, expense recognition"}
{"_id":"q1a714760","title":"","text":"percentage change, total pretax income, 2018, 2019"}
{"_id":"q1a72d620","title":"","text":"maintenance revenue, 2018, 2019"}
{"_id":"q1a716fa6","title":"","text":"adjusted EBITDA, percentage change, 2018, 2019"}
{"_id":"q1a729854","title":"","text":"Overland Park office closure, restructuring charges, severance pay, lease termination fees, asset write-downs, relocation costs, legal fees, operational disruption costs, employee benefits, facility maintenance costs, equipment disposal costs, stakeholder communication expenses."}
{"_id":"q1a738476","title":"","text":"vessel operating expense, percentage change, 2018, 2019"}
{"_id":"q1a7212bc","title":"","text":"restructuring costs, 2018, 2019, average, financial analysis, corporate restructuring, cost analysis"}
{"_id":"q1a73ceea","title":"","text":"net loss, average, 2017, 2018"}
{"_id":"q1a736734","title":"","text":"non-controlling interest, percentage change, loss, 2018, 2019"}
{"_id":"q1a71a980","title":"","text":"Net earnings, percentage change, 2018, 2019, financial analysis, earnings report"}
{"_id":"q1a719cba","title":"","text":"current liabilities, long-term liabilities, contingent liabilities, accounts payable, notes payable, bonds payable, accrued liabilities, deferred tax liabilities, lease liabilities, financial obligations"}
{"_id":"q1a71659c","title":"","text":"trade receivables, days sales outstanding, credit terms, accounts receivable, payment terms, 30 days, 60 days, 90 days, financial analysis, cash flow management"}
{"_id":"q1a738908","title":"","text":"balance, 2019, financial analysis, year-end, fiscal year, revenue, expenses, net income, cash flow, assets, liabilities"}
{"_id":"q1a734da8","title":"","text":"deferred value, percentage change, 2019, 2018"}
{"_id":"q1a71b77c","title":"","text":"net cash provided by operating activities, increase, 2018, 2019"}
{"_id":"q1a71ef26","title":"","text":"NOL carryforwards, federal, tax, losses, corporations, deductions, IRS, tax liability, fiscal year, tax code, Section 172, net operating loss, carryback, tax planning, financial strategy."}
{"_id":"q1a72004c","title":"","text":"net profit, impairment, financial analysis, profit margin, fiscal year, earnings report, profitability, financial performance"}
{"_id":"q1a724868","title":"","text":"Keywords: assumptions, financial analysis, forecasting, budgeting, risk assessment"}
{"_id":"q1a713b80","title":"","text":"stock-based compensation, 2018, 2019, financial analysis, equity compensation, company performance, expense reporting"}
{"_id":"q1a721ae6","title":"","text":"total revenue, Network Solutions, percentage, financial analysis, revenue sources, company performance"}
{"_id":"q1a728dd2","title":"","text":"Gold, average prices, 2019, 2018, financial analysis, commodity prices, market trends."}
{"_id":"q1a72559c","title":"","text":"capitalized interest, percentage change, 2019"}
{"_id":"q1a73aa1e","title":"","text":"Amended and Restated 2004 Stock Incentive Plan, shares of common stock, future issuance, September 29, 2019"}
{"_id":"q1a72a7a4","title":"","text":"Trade receivables, net, $150 million, financial analysis, accounts receivable, fiscal year, balance sheet, revenue recognition, credit risk, liquidity, financial metrics."}
{"_id":"q1a719ee0","title":"","text":"US Dollar, 2019, currency conversion, exchange rate, inflation adjustment"}
{"_id":"q1a73e95c","title":"","text":"adjusted EBITDA, $4,000 million, financial analysis, revenue, profitability, fiscal year, earnings, performance metrics"}
{"_id":"q1a72d922","title":"","text":"net financed service contracts, $2,000 million, years, financial analysis"}
{"_id":"q1a722c02","title":"","text":"cost of net revenue, 2019, 2018"}
{"_id":"q1a73887c","title":"","text":"multi-year agreement, customers, invoiced, revenue recognition, billing cycle, contract terms, payment schedule"}
{"_id":"q1a711e3e","title":"","text":"capital expenditure, fixed assets, property, plant, equipment, acquisition costs, installation costs, renovation costs, depreciation, maintenance costs, financing costs, project costs, long-term investments, tangible assets, intangible assets, capital budgeting, cash flow analysis, return on investment, asset management, capital projects, construction costs, equipment purchases, land acquisition, infrastructure development"}
{"_id":"q1a73028a","title":"","text":"weighted average, estimated life, client relationships, years"}
{"_id":"q1a734010","title":"","text":"revenue, 2018, 2017, financial analysis, year-over-year comparison"}
{"_id":"q1a71a1a6","title":"","text":"sales increase, 2019, locations, revenue growth, market expansion, geographic performance, regional sales, financial analysis"}
{"_id":"q1a7333cc","title":"","text":"inventory, 2019, 2018"}
{"_id":"q1a714508","title":"","text":"Accruals, financial reporting, accounting, revenue recognition, expense recognition, balance sheet, cash flow, financial analysis, GAAP, IFRS, financial period, adjustments, deferred revenue, accounts receivable, accounts payable."}
{"_id":"q1a72decc","title":"","text":"Notes payable, long-term debt, total contractual obligations, financial ratios, liabilities, balance sheet, debt-to-equity ratio, interest expense, maturity, financial leverage."}
{"_id":"q1a7182c0","title":"","text":"Bell Media, capital expenditures, 2019, cost-cutting measures, strategic investments, operational efficiency, media industry trends, revenue challenges, technology upgrades, content acquisition."}
{"_id":"q1a72ff38","title":"","text":"Other, percentage change, 2019, 2018"}
{"_id":"q1a730852","title":"","text":"VAS revenues, 2019, year-on-year percentage change, financial analysis, revenue growth, telecommunications, market trends."}
{"_id":"q1a73a7f8","title":"","text":"Trade accounts receivable, percentage change, noncurrent, 2019, 2018"}
{"_id":"q1a72db5c","title":"","text":"depreciation expense, financial analysis, accounting, asset valuation, tax implications, financial reporting, capital assets, straight-line method, declining balance method, fiscal year, company financials, asset lifespan, depreciation schedule"}
{"_id":"q1a74019e","title":"","text":"devices sold, average, 2017, 2018, 2019"}
{"_id":"q1a72617c","title":"","text":"total compensation, 2019, 2018, change, financial analysis"}
{"_id":"q1a734524","title":"","text":"Projected benefit obligation, 2018, pension plans, actuarial assumptions, discount rate, service cost, interest cost, benefit payments, financial reporting, liabilities."}
{"_id":"q1a71d1d0","title":"","text":"senior notes, company, debt securities, interest rate, maturity date, bondholders, credit rating, financial obligations, issuance, principal amount, coupon rate, indenture, covenants, refinancing, investment grade, yield to maturity, callable, convertible, subordinated debt"}
{"_id":"q1a718324","title":"","text":"capital intensity ratio, segment, % change, financial analysis, investment, capital allocation, industry comparison, operational efficiency, asset utilization, financial metrics"}
{"_id":"q1a7200a6","title":"","text":"Net profit, percentage change, impairment, 2019, 2018"}
{"_id":"q1a7229dc","title":"","text":"Total change, research and development expenses, 2017, 2019"}
{"_id":"q1a71f98a","title":"","text":"net carrying value, percentage change, 2018, 2019"}
{"_id":"q1a731946","title":"","text":"Board, Systems, revenue, 2019"}
{"_id":"q1a73eb78","title":"","text":"Dividend, interest income, smallest, year, financial analysis, revenue, earnings, fiscal year, investment income."}
{"_id":"q1a721c44","title":"","text":"liquidity, credit lines, equity financing, debt issuance, asset sales, private placements, venture capital, mezzanine financing, factoring, commercial paper, bank loans, public offerings, convertible bonds, treasury bills, liquidity facilities, repurchase agreements, hedge funds, private equity, crowdfunding, angel investors, term loans, short-term financing, working capital, cash reserves, financial derivatives, securitization, trade credit, government grants, strategic partnerships, joint ventures."}
{"_id":"q1a73aeb0","title":"","text":"deferred tax assets, deferred tax liabilities, offsetting, accounting standards, IAS 12, ASC 740, balance sheet, tax positions, recognition criteria, financial reporting, tax benefits, netting, reporting period, tax jurisdiction"}
{"_id":"q1a71c9ba","title":"","text":"franchise costs, average, 2018, 2019"}
{"_id":"q1a72a088","title":"","text":"Wireless subscribers, total subscribers, 2019, percentage"}
{"_id":"q1a7375b2","title":"","text":"MEI, common stock, traded, symbol, financial markets, stock exchange, companies, investment."}
{"_id":"q1a723120","title":"","text":"stock fluctuation, high, low, first quarter, fiscal year 2019"}
{"_id":"q1a73d318","title":"","text":"customers, company, primary, market segmentation, target audience"}
{"_id":"q1a714e54","title":"","text":"Keywords: financial data, revenue, expenses, profit, balance sheet, income statement, cash flow, fiscal year, company performance, financial analysis"}
{"_id":"q1a71861c","title":"","text":"goodwill, 2018, 2019"}
{"_id":"q1a72ecaa","title":"","text":"accrued taxes, 2018, 2019, financial analysis, tax liability, fiscal year, accounting period"}
{"_id":"q1a734f42","title":"","text":"SSARs, fair value, Black-Scholes model, binomial model, financial derivatives, equity compensation, valuation methods."}
{"_id":"q1a73bf5e","title":"","text":"Reserves, accruals, 2018, 2019, financial analysis, balance sheet, equity, liabilities, accounting standards."}
{"_id":"q1a739574","title":"","text":"accrued liabilities, 2018, 2019"}
{"_id":"q1a722e0a","title":"","text":"NEXTDC, APDC, rent, ancillary amounts, financial transaction, lease agreement, 2023"}
{"_id":"q1a731450","title":"","text":"operating income, September 2019, sequential growth, year-over-year growth"}
{"_id":"q1a72c6e4","title":"","text":"Valuation allowance, 2019, 2018, change, financial reporting, deferred tax assets, tax expense, accounting standards, GAAP, IRS regulations."}
{"_id":"q1a726d02","title":"","text":"Non-amortizing intangible assets, total gross carrying amount, 2018, financial analysis, intangible assets, proportion, accounting standards."}
{"_id":"q1a73af14","title":"","text":"TWDV, financial terms, companies, person names, dates"}
{"_id":"q1a7226ee","title":"","text":"total charges, Fiscal Year 2019, financial analysis, accounting, revenue, expenses, profit margin, financial reporting"}
{"_id":"q1a7144ae","title":"","text":"Non-current assets, Non-current liabilities, Long-term investments, Property, Plant and Equipment (PP&E), Intangible assets, Deferred tax assets, Long-term debt, Pension obligations, Goodwill, Lease liabilities, Equity investments, Fixed assets, Amortization, Depreciation, Financial instruments."}
{"_id":"q1a72937c","title":"","text":"value added, net sales, fiscal year 2019, subtotal"}
{"_id":"q1a71dc3e","title":"","text":"EMEA revenue, movement, financial performance, quarterly results, regional growth, revenue increase, company earnings, market trends, fiscal year, financial analysis."}
{"_id":"q1a72b41a","title":"","text":"change, amount, 31 December, financial analysis, year-end, balance sheet, fiscal year, financial reporting"}
{"_id":"q1a73a7c6","title":"","text":"Trade accounts receivable, net, noncurrent, 2019, 2018, change, financial analysis, balance sheet, accounts receivable, net, noncurrent assets."}
{"_id":"q1a72522c","title":"","text":"Charges, discontinued operations, financial reporting, accounting standards, GAAP, IFRS, 2023, 2022, 2021, company earnings, financial disclosures."}
{"_id":"q1a733fde","title":"","text":"Micron Technology, Inotera Memories, acquisition, cash, financing, debt issuance, equity financing, strategic investment, capital markets, bond offering, private placement, shareholder approval, transaction date, financial restructuring."}
{"_id":"q1a7190f8","title":"","text":"Provision for income tax expense, percentage change, 2017, 2018"}
{"_id":"q1a713e82","title":"","text":"Net Loss, December 31, 2018, December 31, 2019, financial analysis, year-over-year comparison, financial performance, fiscal year, accounting period."}
{"_id":"q1a715958","title":"","text":"unrecognized stock-based compensation expense, unvested employee stock options, 2019"}
{"_id":"q1a72c356","title":"","text":"total debt carrying value, increase, decrease, financial analysis, debt management, balance sheet, liabilities, interest expense, amortization, financial reporting"}
{"_id":"q1a734d80","title":"","text":"deferred value, 2019, 2018, financial analysis, accounting, valuation, balance sheet, financial reporting"}
{"_id":"q1a73c224","title":"","text":"interest income, 2019"}
{"_id":"q1a73215c","title":"","text":"earnings per share, basic earnings per share, diluted earnings per share, net income, common shares, stock options, convertible securities, weighted average shares, financial reporting, GAAP, IFRS"}
{"_id":"q1a7246b0","title":"","text":"income from operations, percentage change, 2017, 2018"}
{"_id":"q1a7201f0","title":"","text":"adjustment, values, 2018"}
{"_id":"q1a72105a","title":"","text":"goodwill, Agiletics, Inc, fiscal 2019, acquisition, percentage, total goodwill"}
{"_id":"q1a721c6c","title":"","text":"net cash from operating activities, 2019"}
{"_id":"q1a72b582","title":"","text":"common stock, shares, granted, 2018"}
{"_id":"q1a730faa","title":"","text":"income tax benefit, 2019, tax reform, corporate tax rate, deductions, credits, IRS, tax liability, net income, tax return, fiscal policy"}
{"_id":"q1a714f3a","title":"","text":"non-employee directors, highest compensation, corporate governance, board of directors, executive compensation, 2023, proxy statement, compensation committee, stock options, cash compensation, equity awards"}
{"_id":"q1a71313a","title":"","text":"gross profit, May 2019, August 2019, financial analysis, revenue, cost of goods sold, profit margin"}
{"_id":"q1a733a48","title":"","text":"AMER, Industrial\/Commercial, revenue percentage, total revenue, financial analysis, fiscal year, earnings report."}
{"_id":"q1a724ae8","title":"","text":"deferred income, 2019"}
{"_id":"q1a714684","title":"","text":"domestic pretax income, 2019"}
{"_id":"q1a72f31c","title":"","text":"Other liabilities, percentage change, 2019, 2018"}
{"_id":"q1a72ceaa","title":"","text":"prepaid expenses, 2018, total sum, financial analysis, accounting, balance sheet"}
{"_id":"q1a73a712","title":"","text":"Trade accounts receivable, net, current, balance sheet, assets, current assets, accounts receivable, financial reporting, liquidity, working capital."}
{"_id":"q1a723756","title":"","text":"Income tax expense, 2018, 2019, increase, decrease, financial analysis, tax benefit, fiscal year, comparison"}
{"_id":"q1a73b400","title":"","text":"outstanding shares, percentage, 2018, 2019"}
{"_id":"q1a715d04","title":"","text":"disallowance, shorter deductibility period, annual effective tax rate, accelerate payment, cash, taxing authority, tax implications, tax liability, cash flow, tax strategy"}
{"_id":"q1a731004","title":"","text":"average income tax benefit, 2018, 2019"}
{"_id":"q1a7418fa","title":"","text":"total retail subscribers, change, financial performance, subscriber growth, revenue impact, Q3 2023, company analysis"}
{"_id":"q1a721e4c","title":"","text":"Gross accounts receivables, 2019, 2018"}
{"_id":"q1a72079a","title":"","text":"PSP payments, Group, 2019, 2018, financial performance, year-over-year comparison"}
{"_id":"q1a739fc4","title":"","text":"revenue, geographic region, financial data, fiscal year, 2023, 2022, 2021, 2020, 2019"}
{"_id":"q1a712b04","title":"","text":"OFA, 2018, 2019, financial analysis, year-end comparison, financial metrics, investment performance, market trends"}
{"_id":"q1a73b3a6","title":"","text":"shares forfeited, 2019, financial reporting, equity, stock options, company shares, capital structure"}
{"_id":"q1a731482","title":"","text":"operating income, December 2018, sequential growth, year-over-year growth"}
{"_id":"q1a736e96","title":"","text":"Interest income, 2018, 2019, financial analysis, year-over-year comparison, revenue growth, interest rates, financial performance, income statement, fiscal year."}
{"_id":"q1a726aaa","title":"","text":"revenue, professional services, percentage, 2018, total revenue"}
{"_id":"q1a73d372","title":"","text":"Taiwan, 2019, percentage, customers"}
{"_id":"q1a7189aa","title":"","text":"Trade payables, 2018, 2019, change, financial analysis, accounts payable, liabilities, cash flow, working capital, company performance."}
{"_id":"q1a71690c","title":"","text":"intangible assets, negative, financial reporting, accounting standards, impairment, valuation, 2023, 2022, 2021, companies, financial analysis"}
{"_id":"q1a72e3ae","title":"","text":"Restricted Share Awards, RSAs, financial year, equity compensation, stock options, company performance, executive compensation, vesting schedule, market value, shareholder equity."}
{"_id":"q1a7133c4","title":"","text":"average deferral, revenues, 2017, 2018, 2019"}
{"_id":"q1a711452","title":"","text":"prepaid expenses, current assets, adjustment percentage, financial reporting, accounting standards"}
{"_id":"q1a716146","title":"","text":"cash dividends, fiscal years, 2017, 2018, 2019, average, declared per share"}
{"_id":"q1a72506a","title":"","text":"average number of potential common shares, diluted net loss per share, 2017, 2018, 2019"}
{"_id":"q1a72a218","title":"","text":"Taiwan Stock Exchange, Taipei Exchange, 2019, company rank"}
{"_id":"q1a728396","title":"","text":"amortization, purchased intangible assets, percentage change, 2018, 2019"}
{"_id":"q1a726154","title":"","text":"Share-based payments, financial reporting, IFRS 2, 2004, 2023, compensation expense, equity instruments, stock options, employee benefits, financial accounting."}
{"_id":"q1a72e386","title":"","text":"Restricted Share Awards, RSAs, fiscal year 2019, fiscal year 2018, fiscal year 2017, average value, compensation, equity awards, stock-based compensation."}
{"_id":"q1a73698c","title":"","text":"Other non-current assets, percentage change, 2018, 2019"}
{"_id":"q1a723918","title":"","text":"subscription revenue, increase, $76.3 million, 2018, 2017"}
{"_id":"q1a71634e","title":"","text":"Equity Securities, Target Allocation, 2020"}
{"_id":"q1a73221a","title":"","text":"noncontrolling interest, average net income, 2017, 2018, 2019"}
{"_id":"q1a73bf0e","title":"","text":"deferred tax assets, components, tax loss carryforwards, temporary differences, tax credits, valuation allowance, financial reporting, accounting standards"}
{"_id":"q1a72c37e","title":"","text":"debt value, interest rate, decrease, 1%, 2019"}
{"_id":"q1a73a9c4","title":"","text":"RSUs, Nonvested, stock options, equity compensation, employees, executives, board members, startups, public companies, vesting schedule, performance metrics, tax implications, shareholder value, retention strategy."}
{"_id":"q1a740612","title":"","text":"Supplier A, total inventory purchases, 2019, percentage, financial analysis, procurement, supply chain management."}
{"_id":"q1a713194","title":"","text":"net revenue, percentage change, November 2018, February 2019"}
{"_id":"q1a720024","title":"","text":"reconciliation, net profit, net loss, impairment, financial adjustments, operating income, non-operating income, tax expenses, depreciation, amortization, interest expense, extraordinary items, provisions, gains, losses, revenue recognition, accruals, cash flow adjustments, fiscal year, financial performance"}
{"_id":"q1a72ac68","title":"","text":"Total sales, 2019, revenue, financial performance, fiscal year, earnings report, sales figures, company performance."}
{"_id":"q1a717ffa","title":"","text":"APRU, off-net, 2017, 2018"}
{"_id":"q1a717dfc","title":"","text":"Shareholder distributions, dividends, 2019, 2018, change, financial analysis, corporate finance"}
{"_id":"q1a7146de","title":"","text":"financial terms, companies, person names, dates"}
{"_id":"q1a730956","title":"","text":"Online Advertising Business, revenue, year-on-year change, financial performance, digital marketing, advertising spend, growth rate, 2023, 2022, companies, market trends."}
{"_id":"q1a73bc34","title":"","text":"FSRU terminal, financial, investment, infrastructure, energy sector, LNG, floating storage regasification unit, global market, company partnerships, project financing."}
{"_id":"q1a713af4","title":"","text":"Gross profit, continuing operations, 2019"}
{"_id":"q1a74165c","title":"","text":"Brian Kinion, Christopher Lien, average number of shares, beneficial ownership, stock ownership, equity, shares outstanding, financial analysis, corporate governance."}
{"_id":"q1a71ae3a","title":"","text":"average Contract for future issue of equity, financial derivatives, equity financing, market trends, investment strategies, risk management, capital markets, hedge funds, stock options, futures contracts"}
{"_id":"q1a73c724","title":"","text":"total operating revenues, $ CHANGE, financial analysis, revenue growth, fiscal year, comparative analysis, financial metrics"}
{"_id":"q1a727054","title":"","text":"income tax obligations, percentage, total contractual obligations"}
{"_id":"q1a72cc98","title":"","text":"performance shares, average, 2017, 2018, 2019"}
{"_id":"q1a74066c","title":"","text":"Supplier B, inventory purchases, percentage change, 2017, 2018"}
{"_id":"q1a72b35c","title":"","text":"government grants, financial reporting, income statement, revenue recognition, accounting standards, GAAP, IFRS, public funding, fiscal policy, grant accounting, nonprofit organizations, government agencies, funding sources, financial disclosures, budgetary allocations"}
{"_id":"q1a71fdea","title":"","text":"VMware, Inc., common stockholders, Classes A and B, net income, weighted-average share, Q2 2020"}
{"_id":"q1a73d39a","title":"","text":"Taiwan, customers, increase, decrease, 2018, 2019"}
{"_id":"q1a71965c","title":"","text":"Golar Partners, net earnings, decrease, share, financial performance, earnings report, Q3 2023, revenue decline, operational costs, market conditions, investment returns."}
{"_id":"q1a72027c","title":"","text":"financial assets, year, comparison, growth, valuation, market trends"}
{"_id":"q1a72772a","title":"","text":"Sitting Fees, O P Bhatt, board meetings, committee meetings, corporate governance, remuneration, compensation, financial regulations, company policies."}
{"_id":"q1a72d8c8","title":"","text":"net lease receivables, 2019"}
{"_id":"q1a73088e","title":"","text":"FinTech, Business Services, year-on-year change, revenues, financial performance, market trends, growth drivers, company earnings, investment, consumer demand, regulatory impact, technology adoption, competitive landscape."}
{"_id":"q1a7280b2","title":"","text":"long-term debt obligations, less than 1 year, 1-3 years, financial liabilities, maturity, debt structure, refinancing, interest rates, cash flow management, balance sheet, corporate finance"}
{"_id":"q1a73a776","title":"","text":"accounts receivable, trade accounts, current assets, customer accounts, aging schedule, allowance for doubtful accounts, credit sales, invoice, payment terms, collection period, write-offs, factoring, bad debt expense, trade credit, financial reporting, accounts aging, receivables turnover, net realizable value, customer credit risk."}
{"_id":"q1a71c014","title":"","text":"accounts receivable, revenue, customer A, 2019"}
{"_id":"q1a73b75c","title":"","text":"Weighted-average interest rate, exceed, 3%, years, financial analysis, interest rates, economic indicators."}
{"_id":"q1a738e9e","title":"","text":"financial years, 2020, 2021, 2022, 2023"}
{"_id":"q1a7329b8","title":"","text":"dividends, cash, 2018, 2019, nominal difference"}
{"_id":"q1a7269c4","title":"","text":"total revenue, 2017, 2018"}
{"_id":"q1a72ced2","title":"","text":"prepaid services, % change, 2018, 2019"}
{"_id":"q1a71bb32","title":"","text":"restructuring expenses, future periods, company, financial outlook"}
{"_id":"q1a735ec4","title":"","text":"revenue, 2018, 2019, decline, economic downturn, market conditions, company performance, sales volume, pricing strategy, competition, consumer demand, financial analysis, quarterly earnings, fiscal year, profit margins, operational costs, industry trends, management decisions, external factors, regulatory changes"}
{"_id":"q1a716678","title":"","text":"percentage change, past due, not impaired receivable, overdue, 2018, 2019"}
{"_id":"q1a712e6a","title":"","text":"average, FY19, individual payout, amount"}
{"_id":"q1a71f76e","title":"","text":"free cash flow, percentage change, financial analysis, cash flow statement, fiscal year, earnings report, financial metrics"}
{"_id":"q1a734560","title":"","text":"Accumulated benefit obligation, 2019, pension plans, actuarial assumptions, liabilities, financial reporting, defined benefit plans."}
{"_id":"q1a7196b6","title":"","text":"Golar Partners, ownership interest, 2018, 2019, change in ownership, financial analysis, equity stake."}
{"_id":"q1a73a014","title":"","text":"South America, revenue, 2017, 2018, change, financial analysis"}
{"_id":"q1a721316","title":"","text":"total costs, percentage change, 2018, 2019"}
{"_id":"q1a7412f6","title":"","text":"buildings and improvements, 2019, financial data"}
{"_id":"q1a7383ea","title":"","text":"vessel operating expense, 2018, 2019"}
{"_id":"q1a71d932","title":"","text":"wages, salaries, compensation, bonuses, overtime pay, commissions, payroll, employee benefits, gross income, net income, labor costs, human resources, tax implications, deductions, employer contributions, labor market, minimum wage, collective bargaining, labor unions, compensation packages"}
{"_id":"q1a72acfe","title":"","text":"Rest of World, financial analysis, year, largest amount, data comparison"}
{"_id":"q1a73c17a","title":"","text":"Interest expense, 2019, 2018, financial analysis, year-over-year comparison, interest rates, corporate finance, expense reduction, financial reporting."}
{"_id":"q1a718ca2","title":"","text":"net income, percentage change, 2018, 2019"}
{"_id":"q1a725948","title":"","text":"Singtel, group share, associates, post-tax profits, 2019, financial contribution, telecommunications, associate companies."}
{"_id":"q1a741350","title":"","text":"Machinery and equipment, $200,000 thousand, years, financial analysis, asset valuation."}
{"_id":"q1a719f6c","title":"","text":"Dividend Paid, Ordinary Share, 2016, 2015, €"}
{"_id":"q1a724f7a","title":"","text":"convertible senior notes, 2017, 2018"}
{"_id":"q1a724976","title":"","text":"expected volatility, 2018, 2019, financial analysis, market trends"}
{"_id":"q1a73e574","title":"","text":"financial income, financial expenses, financial instruments, assignment, accounting standards, IFRS, GAAP, derivatives, interest income, interest expense, hedge accounting, fair value, amortized cost, financial assets, financial liabilities, recognition, measurement, reporting, disclosures"}
{"_id":"q1a7159bc","title":"","text":"unrecognized stock-based compensation expense, unvested RSUs, recognition period, financial reporting, expense recognition, equity compensation, vesting schedule"}
{"_id":"q1a72412e","title":"","text":"28nm, semiconductor technology, 2019, market share, revenue growth, TSMC, Intel, Samsung, chip manufacturing, technology nodes, investment, R&D, production capacity, industry trends."}
{"_id":"q1a71ab4c","title":"","text":"post-employment benefits, defined benefit plans, defined contribution plans, actuarial assumptions, pension obligations, healthcare benefits, retirement plans, employee benefits, funding status, service cost, interest cost, plan assets, projected benefit obligation, accumulated benefit obligation, vesting, employer contributions, retirement age, mortality rates, inflation rates, FASB, IASB, ASC 715, IFRS 19, financial reporting, actuarial gains, actuarial losses, plan amendments, termination benefits, multi-employer plans, individual retirement accounts (IRAs)"}
{"_id":"q1a735ef6","title":"","text":"total revenue, 2019"}
{"_id":"q1a73339a","title":"","text":"employee benefits, 2019, 2018"}
{"_id":"q1a738f7a","title":"","text":"provision for income taxes, percentage change, 2017, 2019"}
{"_id":"q1a7349d4","title":"","text":"revenue, increase, financial performance, earnings report, fiscal year, quarterly results, growth rate, company name, date"}
{"_id":"q1a72fe3e","title":"","text":"valuation allowance, deferred tax assets, 2019"}
{"_id":"q1a720768","title":"","text":"PSP payments, Group, year, financial analysis, payment trends"}
{"_id":"q1a735ac8","title":"","text":"shares, fiscal year 2018, fiscal year 2019, total number of shares, stock purchase, equity, financial analysis"}
{"_id":"q1a72128a","title":"","text":"costs, closed restaurants, 2018, 2019, financial analysis, restaurant industry, economic impact, revenue loss, operational expenses"}
{"_id":"q1a7241e2","title":"","text":"90 nanometers, 2019, percentage, total, semiconductor technology, manufacturing process, industry standards"}
{"_id":"q1a73efba","title":"","text":"Risk free rate of return, 2.0%, financial year, interest rates, Treasury bonds, 2021, 2022, 2023."}
{"_id":"q1a7342e0","title":"","text":"operating expenses, fiscal year 2018, fiscal year 2019"}
{"_id":"q1a73d67e","title":"","text":"shares balance, percentage change, 30 June 2018, 30 June 2019"}
{"_id":"q1a723c10","title":"","text":"total income, percentage change, 2018, 2019"}
{"_id":"q1a71555c","title":"","text":"total property and equipment, % change, 2018, 2019"}
{"_id":"q1a718cd4","title":"","text":"convertible notes, percentage change, 2018, 2019"}
{"_id":"q1a72d35a","title":"","text":"Dividend shares, companies, financial year, stock market, shareholder, equity, dividends, 2023, 2022, 2021."}
{"_id":"q1a7410f8","title":"","text":"Robert Dooley, Eric Lerner, non-equity incentive target amount, compensation, performance metrics, financial targets, executive compensation, incentive plan."}
{"_id":"q1a731630","title":"","text":"deferred income, revenue recognition, long-term contracts, ASC 606, IFRS 15, performance obligations, contract liabilities, amortization, financial reporting, accounting standards, revenue deferral, contract duration, recognition criteria, financial statements, accrual accounting"}
{"_id":"q1a72856c","title":"","text":"market value, calculation, equity, market capitalization, share price, outstanding shares, financial metrics, valuation, stock market, investment analysis, company valuation, earnings, revenue, assets, liabilities, market conditions, investor sentiment, financial ratios, date of valuation"}
{"_id":"q1a71d73e","title":"","text":"cloud services, license support agreements, amortization, 2018"}
{"_id":"q1a71e63e","title":"","text":"total other income, 2019, 2018"}
{"_id":"q1a735b4a","title":"","text":"average price per share, fiscal year 2018, fiscal year 2019, percentage change"}
{"_id":"q1a727da6","title":"","text":"Technology Development revenue, 2019, 2018"}
{"_id":"q1a71d9be","title":"","text":"personnel expenses, year, financial analysis, budget comparison, cost management"}
{"_id":"q1a72b1cc","title":"","text":"Webzone, larger, year"}
{"_id":"q1a72cdf6","title":"","text":"Note 4, financial disclosures, accounting policies, revenue recognition, lease obligations, contingent liabilities, financial instruments, fair value measurements, related party transactions, impairment testing, goodwill, intangible assets, operating segments, income taxes, pension obligations, risk management, hedging activities, investment securities, equity method investments, consolidation, joint ventures, subsidiaries, non-controlling interests, comprehensive income, earnings per share, cash flow statements, fiscal year 2023."}
{"_id":"q1a726442","title":"","text":"valuation allowance, deferred tax asset, U.S. foreign tax credits, 2018"}
{"_id":"q1a71e080","title":"","text":"net cash provided by operating activities, 2017"}
{"_id":"q1a723e72","title":"","text":"Cash flow from operating activities, increase, decrease, 2018, 2019"}
{"_id":"q1a7171f4","title":"","text":"executive officer, company, oldest, age, leadership, corporate governance"}
{"_id":"q1a72f0a6","title":"","text":"Earnings per share, basic, percentage change, 2018, 2019"}
{"_id":"q1a718090","title":"","text":"off-net APRU, percentage change, 2017, 2018"}
{"_id":"q1a731694","title":"","text":"contract lengths, revenue recognition, performance obligations, Group, financial reporting, accounting standards, contract terms, revenue cycle, deferred revenue, performance metrics"}
{"_id":"q1a721082","title":"","text":"goodwill, payment segment, average ending carrying amount, 2018, 2019"}
{"_id":"q1a7215b4","title":"","text":"software license revenue, percentage change, 2018, 2019"}
{"_id":"q1a7312ca","title":"","text":"Notes receivable, non-current assets, percentage change, 2018, 2019"}
{"_id":"q1a72de4a","title":"","text":"Non-cancelable purchase order obligations, purchase orders, contractual commitments, liabilities, suppliers, procurement, financial obligations, accounting standards, cash flow management, inventory management, vendor agreements."}
{"_id":"q1a72de18","title":"","text":"notes payable, long-term debt, interest expense, future interest, financial liabilities, amortization, debt instruments, interest rates, maturity dates, principal amount, financial obligations, cash flow, debt servicing, credit risk, bond issuance, loan agreements"}
{"_id":"q1a73033e","title":"","text":"Trade Names, Non-compete agreements, gross carrying value, intangible assets, amortization, valuation, financial reporting, accounting standards, goodwill, market value."}
{"_id":"q1a718cfc","title":"","text":"Diluted average shares outstanding, financial metrics, year, company analysis, stock performance, equity financing, share dilution, earnings per share, market capitalization, investor relations."}
{"_id":"q1a717fc8","title":"","text":"APRU, on-net, 2017, 2018"}
{"_id":"q1a73a366","title":"","text":"directors, total compensation, financial analysis, corporate governance, remuneration, executive pay, compensation committee, fiscal year, SEC filings, proxy statement"}
{"_id":"q1a73aee2","title":"","text":"Keywords: financial metrics, revenue, expenses"}
{"_id":"q1a71cec4","title":"","text":"Cash paid for interest, 2017"}
{"_id":"q1a73c6f2","title":"","text":"External service revenues, percentage change, 2019, previous year, financial analysis, revenue growth, fiscal year, financial performance."}
{"_id":"q1a722464","title":"","text":"total claims payable, total contractual obligations, percentage constitution, financial analysis, liabilities, obligations, claims, financial metrics"}
{"_id":"q1a720fce","title":"","text":"financial year, fiscal year, 2023, 2022, 2021, revenue, profit, loss, balance sheet, income statement"}
{"_id":"q1a72f7a4","title":"","text":"EMEA, Americas, revenue, percentage increase, 2019, 2018"}
{"_id":"q1a732c38","title":"","text":"Noncurrent assets, 2018, 2019, increase, decrease, financial analysis, balance sheet, asset valuation, depreciation, amortization."}
{"_id":"q1a7226bc","title":"","text":"Fiscal Year, 2021, 2022, 2023, 2024, Company, Revenue, Profit, Expenses, Quarter, Earnings Report"}
{"_id":"q1a712dac","title":"","text":"EAIP, FY19, Compensation Committee, payouts, reduction"}
{"_id":"q1a720d6c","title":"","text":"research and development credits, uncertain tax positions, percentage change, 2018, 2019"}
{"_id":"q1a7305e6","title":"","text":"amortization expense, 2017, 2018, financial analysis, accounting, depreciation, expense reporting"}
{"_id":"q1a71f962","title":"","text":"net carrying value, 2018, 2019"}
{"_id":"q1a715502","title":"","text":"property and equipment, categories, 2018, 2019"}
{"_id":"q1a73a2da","title":"","text":"non-returning directors, terms, end date, corporate governance, board of directors, company policy"}
{"_id":"q1a71765e","title":"","text":"revenue recognition, performance obligations, contract assets, contract liabilities, ASC 606, IFRS 15, variable consideration, transaction price, revenue streams, customer contracts"}
{"_id":"q1a738c3c","title":"","text":"Tax provision, federal statutory rate, 2018, 2019"}
{"_id":"q1a72c090","title":"","text":"Net cash used in investing activities, increase, capital expenditures, acquisitions, investments, asset purchases, divestitures, cash outflows, financial analysis, company performance, fiscal year, cash flow statement."}
{"_id":"q1a716ee8","title":"","text":"net income, 2019"}
{"_id":"q1a734ab0","title":"","text":"Operating income, fiscal 2018, fiscal 2017, average, financial analysis, income statement, profitability, earnings, revenue, expenses."}
{"_id":"q1a7370f8","title":"","text":"Ireland, revenue, 2019, 2018, financial performance, economic growth, GDP, fiscal year, tax revenue, corporate tax, economic indicators."}
{"_id":"q1a73e8a8","title":"","text":"net income, 2015"}
{"_id":"q1a73f500","title":"","text":"unrecognized tax benefits, average annual, ending balance, tax liabilities, financial reporting, IRS, GAAP, tax compliance, companies, tax reserves, financial analysis, tax provisions, accounting standards, tax audits, fiscal year"}
{"_id":"q1a73841c","title":"","text":"average voyage revenue, 2018, 2019"}
{"_id":"q1a723e4a","title":"","text":"Cash and cash equivalents, percentage change, 2018, 2019"}
{"_id":"q1a71f4d0","title":"","text":"Gross Profit, Fiscal Year, April 28, 2018, April 29, 2017, average, financial analysis"}
{"_id":"q1a7236ca","title":"","text":"EBITDA, Earnings Before Interest, Taxes, Depreciation, and Amortization, is a financial metric used to evaluate a company's operating performance. It focuses on earnings generated from core business operations without the impact of capital structure, tax rates, and non-cash accounting items. \n\nKeywords: EBITDA, Earnings, Interest, Taxes, Depreciation, Amortization, financial metric, operating performance."}
{"_id":"q1a731036","title":"","text":"income tax benefit, lower than -10,000 thousands, year, financial analysis"}
{"_id":"q1a723972","title":"","text":"Total Revenue, 2019"}
{"_id":"q1a716b32","title":"","text":"income tax benefit, 2018, tax reform, corporate tax rate, IRS, deductions, credits, tax liability, net income, fiscal year"}
{"_id":"q1a72d0ee","title":"","text":"interest income, year, financial analysis, revenue, interest rates, fiscal year, earnings report, financial performance"}
{"_id":"q1a735b7c","title":"","text":"fiscal year, total shares purchased, stock buyback, company, financial analysis, market trends, investment strategy"}
{"_id":"q1a71e918","title":"","text":"capitalized, Company, U.S., build-to-suit facility, March 31, 2018"}
{"_id":"q1a711416","title":"","text":"inventories, accrued liabilities, Topic 606, financial reporting, balances, millions"}
{"_id":"q1a719f9e","title":"","text":"Dividend Paid, Ordinary Share, Percentage Change, 2015, 2016, €"}
{"_id":"q1a71ec1a","title":"","text":"Disposals, 2018, 2019, change, financial analysis, year-over-year, asset management, accounting, financial reporting"}
{"_id":"q1a726a00","title":"","text":"revenue, subscription, returns, professional service, 2017, 2018"}
{"_id":"q1a72216c","title":"","text":"research and development expense, average, 2017, 2018"}
{"_id":"q1a72277a","title":"","text":"Acquisition-related costs, fiscal year 2019, fiscal year 2018, financial analysis, cost comparison, mergers and acquisitions, financial reporting, corporate finance, expense analysis."}
{"_id":"q1a72d6ac","title":"","text":"maintenance revenue, software-related revenues, 2019"}
{"_id":"q1a73f4d8","title":"","text":"unrecognized tax benefits, Beginning balance, Ending balance, 2019"}
{"_id":"q1a7193fa","title":"","text":"PSAs, percentage increase, 2017, 2019"}
{"_id":"q1a729ade","title":"","text":"net revenues, December 31, 2019, December 31, 2018, average percentage, financial analysis"}
{"_id":"q1a733cb4","title":"","text":"Fair value, restricted stock units, vested, percentage change, 2018, 2019"}
{"_id":"q1a71b56a","title":"","text":"compensation, 2018, 2019, salary, bonus, payroll, financial analysis, year-over-year change"}
{"_id":"q1a71986e","title":"","text":"Cash and cash equivalents, 2019"}
{"_id":"q1a7230c6","title":"","text":"OTCQB, compliance, company, regain, date"}
{"_id":"q1a720452","title":"","text":"cash inflows, investing activities, capital gains, asset sales, equity investments, real estate transactions, mergers and acquisitions, dividend income, interest income, venture capital, private equity, stock sales, bond sales, investment returns, cash flow, financial markets, portfolio management, investment strategy, liquidity events, divestitures, capital appreciation, investment portfolio, cash management."}
{"_id":"q1a7386c4","title":"","text":"leasehold improvements, 2019, percentage, total property equipment, depreciation, amortization, fixed assets, not in service"}
{"_id":"q1a73ca30","title":"","text":"cash remuneration, total compensation, Board of Directors, fiscal year, June 30, 2017"}
{"_id":"q1a71549e","title":"","text":"Note 5, financial disclosures, accounting policies, contingent liabilities, related party transactions, revenue recognition, lease obligations, impairment testing, fair value measurements, financial instruments, tax provisions."}
{"_id":"q1a726c12","title":"","text":"non-amortizing intangible assets, goodwill, trademarks, brand names, customer relationships, indefinite-lived assets, intellectual property, acquisition date, fair value, impairment testing"}
{"_id":"q1a71de32","title":"","text":"total inventories, raw materials, work in progress, finished goods, inventory valuation, cost of goods sold, FIFO, LIFO, weighted average cost, inventory turnover, supply chain management, accounting standards, GAAP, IFRS, balance sheet, asset management"}
{"_id":"q1a740e82","title":"","text":"average interest cost, 2017, 2018, 2019, financial analysis, interest rates, cost of capital, economic conditions"}
{"_id":"q1a73eb46","title":"","text":"Dividend, interest income, years, financial analysis, revenue, earnings, investment income, fiscal year, accounting period."}
{"_id":"q1a73b158","title":"","text":"internally-developed software, cost, 2019"}
{"_id":"q1a736766","title":"","text":"loss, financial year, revenue decline, net loss, fiscal year, financial performance, earnings report, company performance, quarterly results, annual report"}
{"_id":"q1a7364a0","title":"","text":"net value, unrealized gains, unrealized losses, municipal bonds, company, financial analysis"}
{"_id":"q1a739a9c","title":"","text":"gross receivables, $4,000 million"}
{"_id":"q1a715534","title":"","text":"Equipment and software, total property and equipment, 2019, depreciation"}
{"_id":"q1a71a926","title":"","text":"lowest percentage difference, basic net earnings per share, diluted net earnings per share, financial analysis, earnings report, fiscal year, company performance"}
{"_id":"q1a72494e","title":"","text":"risk-free interest rate, 2018, 2019, financial markets, Treasury bonds, yield curve, economic indicators"}
{"_id":"q1a71e8e6","title":"","text":"capitalized amount, Company, U.S. build-to-suit facility, March 31, 2019"}
{"_id":"q1a72f2ea","title":"","text":"Other liabilities, 2019, 2018, change, financial analysis, balance sheet, accounting, liabilities, fiscal year, financial reporting."}
{"_id":"q1a71d16c","title":"","text":"Roper, $2.5 billion, unsecured credit facility, five-year, October 2021"}
{"_id":"q1a71e6c0","title":"","text":"total revenue, percentage change, 2018, 2019"}
{"_id":"q1a733188","title":"","text":"risk-free interest rate, 2018, 2019, financial markets, economic indicators, Federal Reserve, Treasury yields, interest rate changes"}
{"_id":"q1a72a970","title":"","text":"loss from discounted operations, financial reporting, asset impairment, non-operating income, tax implications, company restructuring, divestiture, financial analysis, earnings impact, cash flow, accounting standards, GAAP, IFRS, financial metrics"}
{"_id":"q1a720c7c","title":"","text":"valuation allowance, 2018, company valuation"}
{"_id":"q1a711844","title":"","text":"total expenses, percentage change, 2017, 2018"}
{"_id":"q1a712a82","title":"","text":"FVOCI, 31 December 2019, financial instruments, fair value, Level 1, accounting standards, IFRS 9, investment securities."}
{"_id":"q1a72c11c","title":"","text":"cash, investing activities, percentage increase, decrease, financial analysis, cash flow, investment, capital expenditures, liquidity, cash management"}
{"_id":"q1a741ba2","title":"","text":"Raw materials, supplies, percentage change, 2019, 2018"}
{"_id":"q1a736298","title":"","text":"restricted stock, average annual number of shares, June 30, 2018, June 30, 2019"}
{"_id":"q1a73c1fc","title":"","text":"interest expense, 2019"}
{"_id":"q1a7214e2","title":"","text":"long-term deferred revenue, 2018"}
{"_id":"q1a741120","title":"","text":"NEOs, non-equity incentive, target amounts, 2019"}
{"_id":"q1a71242e","title":"","text":"uncertain tax positions, provisions, tax liability, financial reporting, ASC 740, IRS, tax compliance, tax audit, financial statements, tax reserves, companies, tax strategies, tax regulations, accounting standards, tax risk, tax expense, tax planning, tax law, tax authority, tax disputes"}
{"_id":"q1a7241ba","title":"","text":"nanometers"}
{"_id":"q1a72f772","title":"","text":"hardware revenue, cloud revenue, license revenue, 2018, total revenue"}
{"_id":"q1a740bc6","title":"","text":"Net cash provided by operating activities, 2018, 2019, change, financial analysis, cash flow, operating cash flow, year-over-year comparison."}
{"_id":"q1a735f50","title":"","text":"net income, gross margin, company, 2017"}
{"_id":"q1a72bc30","title":"","text":"depreciation, 2019"}
{"_id":"q1a711bdc","title":"","text":"average annual total assets, fiscal years, financial analysis, balance sheet, asset management, company performance, financial metrics"}
{"_id":"q1a7217d0","title":"","text":"surcharge mechanism, financial regulation, pricing strategy, cost allocation, revenue management, utility companies, consumer pricing, regulatory compliance, market dynamics, economic impact"}
{"_id":"q1a71b59c","title":"","text":"Gross deferred income tax assets, percentage change, 2018, 2019"}
{"_id":"q1a732f1c","title":"","text":"outstanding options, warrants, Amended and Restated 2010 Share Incentive Plan, total value"}
{"_id":"q1a7217f8","title":"","text":"gross margin, financial analysis, fiscal year, revenue, cost of goods sold, profitability, 2023, 2022, 2021, 2020, 2019"}
{"_id":"q1a72446c","title":"","text":"Innovation center expenditure, FY 2018, FY 2019, percentage change, consolidated, financial analysis, fiscal year, budget comparison."}
{"_id":"q1a73fa0a","title":"","text":"APJC, service revenue, $1,500 million, years, financial analysis"}
{"_id":"q1a7298e0","title":"","text":"restructuring charges, 2017, total goodwill impairment, percentage, financial analysis"}
{"_id":"q1a712794","title":"","text":"operating profit, 2019, target group, actual group, ratio"}
{"_id":"q1a71ada4","title":"","text":"stapled securities, 2019, 2018, financial instruments, investment trusts, real estate investment trusts, companies, market capitalization, yield, distribution, capital structure"}
{"_id":"q1a71c8e8","title":"","text":"franchise rental revenues, 2019, increase"}
{"_id":"q1a733138","title":"","text":"warrants, company, issuance, total, financial instruments"}
{"_id":"q1a71ab7e","title":"","text":"Provisions for post-employment benefits, employer commitments, financial analysis, actuarial assumptions, pension liabilities, 2023, 2022, financial reporting, accounting standards, company obligations."}
{"_id":"q1a722950","title":"","text":"financial years, comparison, fiscal year, 2022, 2023, revenue, expenses, profit, loss, budget, forecast"}
{"_id":"q1a73bcb6","title":"","text":"other non-current assets, percentage change, 2018, 2019"}
{"_id":"q1a72c144","title":"","text":"cash from financing activities, average, cash flow, financial analysis, capital structure, debt issuance, equity financing, dividends, interest payments, financial metrics"}
{"_id":"q1a7176b8","title":"","text":"licensing revenue, 2018, 2019, decrease"}
{"_id":"q1a730fdc","title":"","text":"pre-tax loss, 2019, 2018, percentage, financial performance, fiscal year"}
{"_id":"q1a73240e","title":"","text":"TCE revenues, TCE, revenues, financial metrics, shipping industry, earnings, revenue generation, financial performance, companies, maritime sector, market analysis, operational efficiency."}
{"_id":"q1a733458","title":"","text":"deferred tax asset, financial year, tax accounting, balance sheet, tax liability, tax benefits, accounting standards, financial reporting, tax strategy, corporate finance"}
{"_id":"q1a728058","title":"","text":"contractual obligations, payments due, less than 1 year, financial liabilities, current liabilities, short-term debt, cash flow management, liquidity, financial analysis, balance sheet"}
{"_id":"q1a740112","title":"","text":"devices sold, revenue, sales volume, inventory turnover, market demand, financial performance, product line, sales forecast, company earnings, quarterly report"}
{"_id":"q1a71b4e8","title":"","text":"Net operating loss carryforwards, 2019, tax, IRS, financial reporting, corporations, losses, deferred tax assets."}
{"_id":"q1a7189fa","title":"","text":"GST, employment taxes, 2018, 2019, tax rates, tax compliance, revenue, fiscal policy, government revenue, tax reform."}
{"_id":"q1a7412ce","title":"","text":"Property, plant and equipment, financial reporting, fiscal years, asset valuation, depreciation, capital expenditures, balance sheet, investment analysis."}
{"_id":"q1a734786","title":"","text":"general and administrative expenses, total revenues, financial year ends, percentage, fiscal year, operating expenses, cost structure, financial analysis"}
{"_id":"q1a73e98e","title":"","text":"Interest expense, percentage change, 2015, 2016"}
{"_id":"q1a736478","title":"","text":"unrealized gains, municipal bonds, corporate bonds, company values"}
{"_id":"q1a73b126","title":"","text":"Research and development expense, 2019, increase, financial analysis, company performance, budget allocation, investment, R&D growth, expense report."}
{"_id":"q1a718658","title":"","text":"Net recognized amounts, identifiable assets, liabilities assumed, 2018, 2019"}
{"_id":"q1a728512","title":"","text":"finished goods, total inventories, 2019, proportion, value"}
{"_id":"q1a73141e","title":"","text":"operating income, fourth quarter, sequential growth, year-over-year growth, financial performance, earnings report, fiscal year, revenue, profit margin"}
{"_id":"q1a713b58","title":"","text":"Gross profit, continuing operations, 2018, 2019, change, financial analysis, year-over-year comparison."}
{"_id":"q1a7375e4","title":"","text":"First Quarter, High price, Fiscal Year Ended April 28, 2018, Fiscal Year Ended April 27, 2019"}
{"_id":"q1a72be74","title":"","text":"sales and marketing expenses, 2019, 2018, percentage change"}
{"_id":"q1a718c66","title":"","text":"diluted shares outstanding, stock options, convertible securities, restricted stock units, warrants, treasury stock, common stock, preferred stock, earnings per share, equity dilution"}
{"_id":"q1a733480","title":"","text":"inventory, 2018, 2019, value difference"}
{"_id":"q1a73beb4","title":"","text":"net change, total valuation allowance, December 31, 2019"}
{"_id":"q1a73931c","title":"","text":"non-current assets, current assets, cash, inventory, accounts receivable, short-term investments, property, plant, equipment, intangible assets, long-term investments, depreciation, amortization"}
{"_id":"q1a71f282","title":"","text":"APAC, AMER, operating income, 2019, financial performance, regional comparison"}
{"_id":"q1a721e9c","title":"","text":"Allowance for returns, Allowance for doubtful accounts, 2019, 2018"}
{"_id":"q1a72b9b0","title":"","text":"carrying value, 2018, financial analysis, valuation, asset management"}
{"_id":"q1a73951a","title":"","text":"accrued interest, 2018, 2019"}
{"_id":"q1a7121a4","title":"","text":"Note 3, financial disclosures, accounting policies, revenue recognition, related party transactions, contingent liabilities, estimates and assumptions, financial instruments, risk management, segment reporting, compliance, IFRS, GAAP, company-specific details, fiscal year-end."}
{"_id":"q1a71870c","title":"","text":"equipment notes payable, percentage change, 2018, 2019"}
{"_id":"q1a714c74","title":"","text":"average revenue, Europe, 2018, 2019"}
{"_id":"q1a719c24","title":"","text":"year, financial data, fiscal year, reporting period"}
{"_id":"q1a7159e4","title":"","text":"stock-based compensation expense, unrecognized stock-based compensation expense, 2019"}
{"_id":"q1a713eaa","title":"","text":"Weighted average common shares, basic, December 31, 2018, December 31, 2019, change, financial analysis, earnings per share, company performance."}
{"_id":"q1a72bef6","title":"","text":"sales expenses, marketing expenses, 2018, 2019, average expenses"}
{"_id":"q1a72ce28","title":"","text":"impairment charges, prepaid licenses, production tooling, financial reporting, asset valuation, accounting standards, balance sheet, income statement, GAAP, IFRS"}
{"_id":"q1a73ff3c","title":"","text":"depreciation, amortisation, EBITDA, F19, financial analysis, percentage"}
{"_id":"q1a722b44","title":"","text":"decrease, gross profit percentage, year ended, December 31, 2019, revenue decline, cost of goods sold, operating expenses, market competition, pricing strategy, economic conditions, inventory management, sales volume, product mix, financial analysis"}
{"_id":"q1a71683a","title":"","text":"deferred income taxes, tax liability, tax asset, temporary differences, accounting, financial reporting, IRS, GAAP, tax expense, balance sheet, income tax expense, tax deferral, tax strategy, corporate tax, tax planning"}
{"_id":"q1a71a8cc","title":"","text":"earnings per share, EPS, financial reporting, fiscal year, quarterly earnings, 2023, 2022, 2021, 2020, 2019, 2018, public companies, SEC filings, annual reports"}
{"_id":"q1a712488","title":"","text":"balance change, 2018, 2019, January 1"}
{"_id":"q1a71968e","title":"","text":"net losses, earnings, affiliates, financial performance, year comparison"}
{"_id":"q1a720952","title":"","text":"Total compensation expense, performance-based RSUs, service-based RSUs, market-based RSUs, December 31, 2019."}
{"_id":"q1a725efc","title":"","text":"deferred revenue, average, current portion, 2018, 2019"}
{"_id":"q1a7253b2","title":"","text":"Total charges, average, 3 years, financial analysis, revenue, expenses, fiscal year, accounting, financial metrics."}
{"_id":"q1a7126ae","title":"","text":"N\/A"}
{"_id":"q1a7395a6","title":"","text":"accrued liabilities, 2018, 2019"}
{"_id":"q1a731eb4","title":"","text":"fiscal year, financial year, accounting period, December 31, March 31, June 30, September 30, companies, tax year, budget year"}
{"_id":"q1a73b9d2","title":"","text":"restricted stock, restricted stock unit, awards, granted, year, financial analysis"}
{"_id":"q1a7198fa","title":"","text":"restricted cash, 2018, 2019, financial analysis, cash flow, liquidity, balance sheet"}
{"_id":"q1a72f7d6","title":"","text":"operating expense, fiscal 2019, fiscal 2018, financial analysis, cost increase, company performance, budget allocation, expense management, operational efficiency, financial reporting"}
{"_id":"q1a71d46e","title":"","text":"AOCI, accumulated other comprehensive income, financial reporting, components, changes, fiscal years, 2021, 2022, 2023."}
{"_id":"q1a71f6b0","title":"","text":"tax, 2019, amount, tax paid"}
{"_id":"q1a71a69c","title":"","text":"provision for doubtful receivables, 2018, 2019, financial analysis, accounts receivable, allowance for doubtful accounts"}
{"_id":"q1a73a38e","title":"","text":"total compensation, non-returning director, average amount, financial analysis, corporate governance, compensation committee, executive pay, director remuneration, fiscal year, benchmarking, salary, stock options, performance bonuses, SEC filings, proxy statement"}
{"_id":"q1a7195f8","title":"","text":"equity in net earnings, affiliates, financial reporting, earnings, investment, accounting standards, 2023, 2022, 2021, 2020, 2019"}
{"_id":"q1a71b13c","title":"","text":"General and administrative expenses, increase, operational costs, overhead, salaries, benefits, office supplies, technology investments, inflation, corporate restructuring, 2023."}
{"_id":"q1a729dc2","title":"","text":"total revenue, 2018, 2017, ratio"}
{"_id":"q1a71fb2e","title":"","text":"accrued revenue, increase, 2018, 2019, revenue recognition, accounting standards, deferred revenue, financial performance, company growth, sales volume, customer contracts, service delivery, financial reporting, cash flow, earnings, revenue growth"}
{"_id":"q1a717e24","title":"","text":"employee expenditure, average, 2018, 2019"}
{"_id":"q1a721f00","title":"","text":"note receivable, product line, 2005, company, received"}
{"_id":"q1a7418a0","title":"","text":"retail satellite TV, net customer losses, percentage change, 2018, 2019"}
{"_id":"q1a718680","title":"","text":"equipment notes payable, 2018, 2019"}
{"_id":"q1a721f5a","title":"","text":"Gross accounts receivables, percentage change, 2018, 2019"}
{"_id":"q1a716416","title":"","text":"Debt Securities, Other assets, target allocations, 2020"}
{"_id":"q1a71c988","title":"","text":"franchise revenues, 2018, 2019, financial analysis, revenue comparison"}
{"_id":"q1a72958e","title":"","text":"loan, repayment schedule, interest rate, principal, amortization, lender, borrower, due date, payment frequency, maturity date, collateral, default, refinancing, payment plan, financial institution"}
{"_id":"q1a715728","title":"","text":"sales reserves, revenue recognition, deferred revenue, unearned revenue, financial reporting, accounting standards, accrual accounting, liability, sales forecast, company earnings, financial performance, balance sheet, cash flow, revenue management, sales projections"}
{"_id":"q1a71f73c","title":"","text":"free cash flow, change, financial analysis, cash flow statement, liquidity, investment, operating cash flow, capital expenditures, financial performance, fiscal year"}
{"_id":"q1a71efb2","title":"","text":"AMT credit, 10,000, tax year, 2018, IRS, Alternative Minimum Tax, taxpayers, deductions."}
{"_id":"q1a72b226","title":"","text":"Webzone, percentage change, 2019, 2018"}
{"_id":"q1a716934","title":"","text":"Other non-current deferred tax assets, 2018, 2019, change, financial reporting, tax assets, deferred tax, accounting standards."}
{"_id":"q1a73d5c0","title":"","text":"ordinary shares, total balance, 30 June 2018"}
{"_id":"q1a72a2fe","title":"","text":"Others, 2017, 2018, increase, decrease"}
{"_id":"q1a721550","title":"","text":"incremental costs, obtaining a contract, capitalized costs, ASC 340-40, contract acquisition costs, amortization, revenue recognition, IFRS 15, contract fulfillment costs, expense recognition"}
{"_id":"q1a73406a","title":"","text":"Micron, shareholders' equity, total equity, 2019"}
{"_id":"q1a73edf8","title":"","text":"Pro forma revenues, percentage change, 2018, 2019"}
{"_id":"q1a720074","title":"","text":"Net profit, impairment, 2019, 2018, financial performance, year-over-year change"}
{"_id":"q1a729822","title":"","text":"restructuring charges, 2018, 2017"}
{"_id":"q1a724386","title":"","text":"Keywords: financial data, revenue, expenses, profit, balance sheet, income statement, cash flow, fiscal year, company performance, financial ratios."}
{"_id":"q1a721cf8","title":"","text":"cash and short-term marketable securities, percentage change, 2018, 2019"}
{"_id":"q1a7351f4","title":"","text":"Proceeds from issuance of shares, 2017, 2018, change, financial analysis, equity financing, capital markets, stock issuance, company performance."}
{"_id":"q1a71e134","title":"","text":"net increase in cash, cash equivalents, restricted cash, percentage change, 2018, 2019"}
{"_id":"q1a73d624","title":"","text":"shares issued, dates, equity financing, stock issuance, IPO, secondary offering, capital markets, company name, transaction date"}
{"_id":"q1a7316bc","title":"","text":"revenue, Group, performance obligations, contracts, year"}
{"_id":"q1a72a6e6","title":"","text":"billed trade receivables, 2019"}
{"_id":"q1a734cf4","title":"","text":"tax rate, fluctuations, economic conditions, fiscal policy, government regulations, corporate tax, personal income tax, capital gains tax, tax reforms, inflation, recession, tax incentives, deductions, credits, international tax, tax brackets, 2023 tax changes"}
{"_id":"q1a7295ca","title":"","text":"Loans due from subsidiaries, non-current portion, 2018, 2019"}
{"_id":"q1a73cf44","title":"","text":"net loss, percentage change, 2018, 2019"}
{"_id":"q1a72650a","title":"","text":"percentage change, income, foreign countries, 2018, 2019"}
{"_id":"q1a73f1f4","title":"","text":"Depreciation, amortization, expense, increase, financial reporting, asset valuation, capital expenditures, intangible assets, accounting standards, fiscal year, company performance, cash flow, tax implications, investment, asset lifecycle, financial analysis."}
{"_id":"q1a7157be","title":"","text":"Accrued expenses, other liabilities, $200 million, financial analysis, company performance, fiscal years, balance sheet, financial reporting."}
{"_id":"q1a72e520","title":"","text":"amortization, intangible assets, 2018, 2019, financial analysis, accounting, depreciation, asset valuation"}
{"_id":"q1a727ce8","title":"","text":"reportable segments, operations, financial reporting, segment reporting"}
{"_id":"q1a739150","title":"","text":"accumulated benefit obligation, regions, financial reporting, pension plans, actuarial assumptions, liabilities, GAAP, IFRS, United States, Europe, Asia, pension accounting, employee benefits, financial disclosures"}
{"_id":"q1a734d4e","title":"","text":"deferred tax assets, financial year, tax liabilities, accounting standards, balance sheet, tax regulations, financial reporting, tax deferral, corporate finance, tax strategy"}
{"_id":"q1a711baa","title":"","text":"Fiscal Year, 2023, 2022, 2021, 2020, 2019"}
{"_id":"q1a728b5c","title":"","text":"Security, 2018, revenue"}
{"_id":"q1a714440","title":"","text":"government grants, payments received on account, 2018"}
{"_id":"q1a71d554","title":"","text":"percentage change, total balance, 2017, 2018"}
{"_id":"q1a73690a","title":"","text":"Other assets, 2018"}
{"_id":"q1a713784","title":"","text":"Other purchase obligations, commitments, financial liabilities, contractual obligations, future payments, fiscal year, company disclosures, financial reporting, contingent liabilities."}
{"_id":"q1a71a958","title":"","text":"Net earnings, operations, 2018, 2019, financial performance, year-over-year, earnings growth, profitability, fiscal year."}
{"_id":"q1a73a334","title":"","text":"non-returning director, total compensation, financial analysis, corporate governance, executive pay, compensation package, board of directors, remuneration, fiscal year, company performance"}
{"_id":"q1a71546c","title":"","text":"net property and equipment, financial reporting, fiscal year, depreciation, asset valuation, balance sheet, capital expenditures, 2023, 2022, 2021, company assets, accounting standards"}
{"_id":"q1a72a4b6","title":"","text":"non-material adjusted carrying values, assets, financial reporting, impairment, valuation, accounting standards, fair value, asset management, financial analysis"}
{"_id":"q1a73cc7e","title":"","text":"warranty reserve, 2017, financial analysis, accounting, liability, balance sheet, accrual, expense, company financials"}
{"_id":"q1a7141b6","title":"","text":"percentage change, share of net earnings, other affiliates, 2018, 2017"}
{"_id":"q1a728364","title":"","text":"Amortization, purchased intangible assets, 2017, 2018, financial analysis, accounting standards, intangible assets, depreciation, financial reporting."}
{"_id":"q1a714738","title":"","text":"domestic pretax income, 2018, 2017, change, financial analysis"}
{"_id":"q1a72c0ea","title":"","text":"cash from operating activities, increase, decrease, 2018, 2019"}
{"_id":"q1a73e628","title":"","text":"Other financial income, 2018, 2019, 2017, financial performance, income statement, year-over-year change, financial analysis."}
{"_id":"q1a73433a","title":"","text":"investor relations, consultants, total operating expense, 2019"}
{"_id":"q1a737a4e","title":"","text":"operating expenses, average, 2017, 2018"}
{"_id":"q1a731504","title":"","text":"Operating income, December 31, 2018, Operating income, December 31, 2019, increase, decrease, financial analysis, year-over-year comparison."}
{"_id":"q1a73ce90","title":"","text":"net loss, 2018, 2019"}
{"_id":"q1a71cb72","title":"","text":"cost of living indexation, inflation rate, consumer price index, economic indicators, wage adjustments, tax brackets, pension benefits, social security, financial planning, economic policy"}
{"_id":"q1a73e34e","title":"","text":"Activision, segment operating income, percentage change, 2018, 2019"}
{"_id":"q1a72775c","title":"","text":"commission, percentage, Ceiling, Section 198, Companies Act"}
{"_id":"q1a7223d8","title":"","text":"operating leases, payment, total, liabilities, financial obligations, lease agreements, cash flow, accounting standards, ASC 842, IFRS 16"}
{"_id":"q1a729a20","title":"","text":"net income, fourth quarter, 2019"}
{"_id":"q1a73709e","title":"","text":"total revenue, geographic areas, financial analysis, revenue breakdown, market segmentation"}
{"_id":"q1a728080","title":"","text":"contributions, fiscal 2019, financial performance, economic conditions, investment returns, regulatory changes, company policies, market trends, stakeholder expectations, budget allocations"}
{"_id":"q1a72b9d8","title":"","text":"South African Credit Facility, Colombian Credit Facility, Brazil Credit Facility, Carrying Value, USD, 2019"}
{"_id":"q1a734312","title":"","text":"salaries, wages, benefits expense, percentage change, 2019, 2018"}
{"_id":"q1a711484","title":"","text":"inventories, percentage change, balance, adjusted, financial analysis, accounting, valuation, fiscal year, inventory management"}
{"_id":"q1a715d5e","title":"","text":"deferred tax assets, accrued expenses, federal credits, percentage change, 2019, 2018"}
{"_id":"q1a72a02e","title":"","text":"BCE, Wireless, High-speed Internet, subscribers, 2018, telecommunications, Canada"}
{"_id":"q1a7308c0","title":"","text":"Online Advertising Business, year-on-year change, revenues, digital marketing, advertising spend, e-commerce growth, social media platforms, Google, Facebook, Amazon, Q3 2023, market trends, consumer behavior, ad placements, ROI, programmatic advertising."}
{"_id":"q1a72b3e8","title":"","text":"amount, 1 January, year, financial analysis"}
{"_id":"q1a7330d4","title":"","text":"dividend yield, company, dividends, stock price, financial metrics, investment, shareholder return, equity, yield calculation, market value"}
{"_id":"q1a73b7b6","title":"","text":"Standby letters of credit, percentage change, 2018, 2019"}
{"_id":"q1a71da18","title":"","text":"personnel expenses, percentage change, 2018, 2019, 2017, financial analysis"}
{"_id":"q1a73ca08","title":"","text":"cash remuneration, Board of Directors, fiscal year, June 30, 2018, June 30, 2019, financial comparison, compensation analysis"}
{"_id":"q1a73c9ae","title":"","text":"share-based payments, Board of Directors, fiscal year, June 30, 2017, June 30, 2018, June 30, 2019"}
{"_id":"q1a73ac94","title":"","text":"inventories, work in progress, 2018, 2019, change, financial analysis"}
{"_id":"q1a7206dc","title":"","text":"Share Incentive Plan, SIP, employee ownership, tax advantages, HMRC, shares, UK, companies, employee benefits, stock options, equity compensation, long-term incentives, share purchase, dividend shares, tax-free, National Insurance contributions, employee engagement, retention strategies."}
{"_id":"q1a720484","title":"","text":"net change in cash, cash equivalents, 2019"}
{"_id":"q1a73ba22","title":"","text":"non-vested shares, percentage change, 2018, 2019"}
{"_id":"q1a730b04","title":"","text":"land value, 2018, 2019, company, valuation, real estate, asset management"}
{"_id":"q1a737616","title":"","text":"Second Quarter, High price, Fiscal Year Ended April 28, 2018, Fiscal Year Ended April 27, 2019"}
{"_id":"q1a739d44","title":"","text":"obligations, time periods, company, liabilities, current liabilities, long-term liabilities, financial obligations, due dates, payment terms, maturity dates"}
{"_id":"q1a740b6c","title":"","text":"Net cash, investing activities, 2018"}
{"_id":"q1a73d0ac","title":"","text":"cash and cash equivalents, 2018"}
{"_id":"q1a73e2f4","title":"","text":"Blizzard, segment operating income, 2018"}
{"_id":"q1a729d04","title":"","text":"financial terms, companies, person names, dates"}
{"_id":"q1a71a6c4","title":"","text":"net accounts receivables, percentage change, 2018, 2019"}
{"_id":"q1a741634","title":"","text":"L. Gordon Crovitz, Donald P. Hutchison, average number of shares, ownership, stock, equity, investment, financial analysis."}
{"_id":"q1a72219e","title":"","text":"research and development expense, 40,000 thousands, year, financial analysis"}
{"_id":"q1a7297f0","title":"","text":"goodwill impairment charges, 2017, 2018"}
{"_id":"q1a71dcc0","title":"","text":"Asia Pacific revenue, 2018, 2019, increase, decrease"}
{"_id":"q1a73d0de","title":"","text":"liquidity, 2018, financial metrics, cash reserves, current assets, marketable securities"}
{"_id":"q1a71e440","title":"","text":"high price per share, percentage change, second quarter, 2018, 2019"}
{"_id":"q1a7272de","title":"","text":"money market funds, fair value, June 30, 2019"}
{"_id":"q1a73cc4c","title":"","text":"percentage change, provisions, warranty reserve, 2018, 2019"}
{"_id":"q1a72bca8","title":"","text":"total cost of revenues, 2018, 2019, company, financial analysis"}
{"_id":"q1a73e934","title":"","text":"net income, exceed, $1,000 million, financial analysis, fiscal years, profitability, earnings report"}
{"_id":"q1a7246d8","title":"","text":"net income per share, basic shares, diluted shares, 2018"}
{"_id":"q1a717d3e","title":"","text":"shareholder distributions, dividends, financial reporting, equity, return on investment, cash flow, company profits, shareholder value, corporate finance"}
{"_id":"q1a719f12","title":"","text":"Annual Dividends Paid, Proposed, dividends, financial year, company, shareholder, distribution, earnings, cash flow, dividend yield, payout ratio, 2023, 2022, 2021, 2020, 2019."}
{"_id":"q1a737120","title":"","text":"Ireland, revenue, percentage change, 2019, 2018"}
{"_id":"q1a728544","title":"","text":"raw materials, finished goods, average value, 2018"}
{"_id":"q1a7239cc","title":"","text":"Professional services revenue, 2018, 2019, change, financial analysis, revenue growth, fiscal year, company performance, year-over-year comparison."}
{"_id":"q1a728896","title":"","text":"media revenue, 2018, advertising growth, digital platforms, subscription models, content monetization, mergers and acquisitions, streaming services, social media advertising, audience engagement, Nielsen ratings, programmatic advertising, e-commerce integration, data analytics, market trends."}
{"_id":"q1a73db1a","title":"","text":"IFRS, IFRS 9, IFRS 15, IFRS 16, IFRS 17, Group, adoption, financial reporting, standards, compliance"}
{"_id":"q1a72cc70","title":"","text":"performance shares, increase, decrease, 2018, 2019"}
{"_id":"q1a717da2","title":"","text":"spend analysis, compensation, payroll, employee benefits, labor costs, salary structure, variable pay, fixed pay, total compensation, benchmarking, cost of living adjustments, performance bonuses, incentive plans, HR metrics, financial modeling, budget allocation, workforce planning, expense management, financial reporting, organizational structure"}
{"_id":"q1a7163a8","title":"","text":"Debt Securities, Plan Assets, 2018, 2019, Percentage, Exceed 80%"}
{"_id":"q1a7316ee","title":"","text":"contracts, change, amount, one year, financial analysis"}
{"_id":"q1a730c08","title":"","text":"net owned property, equipment, 2018, 2019, company, difference"}
{"_id":"q1a720f9c","title":"","text":"Keywords: financial data, revenue, expenses, profit margin, fiscal year, balance sheet, income statement, cash flow, assets, liabilities, equity, earnings report, quarterly results, financial ratios, market capitalization, dividends, stock price, investment, shareholder value."}
{"_id":"q1a71a444","title":"","text":"net sales, $200,000 thousand, years, financial analysis"}
{"_id":"q1a718c3e","title":"","text":"diluted net income per share, earnings per share, net income, convertible securities, stock options, preferred stock, weighted average shares, financial metrics, equity financing, share dilution, accounting standards, GAAP, IFRS, financial analysis"}
{"_id":"q1a72ad62","title":"","text":"Rest of World, percentage change, 2019, 2018"}
{"_id":"q1a71dc66","title":"","text":"average total revenue"}
{"_id":"q1a721f28","title":"","text":"net Receivables, 2018, 2019, change, financial analysis"}
{"_id":"q1a71834c","title":"","text":"Bell Media, capital expenditures, 2018, 2019"}
{"_id":"q1a71abce","title":"","text":"Provisions for post-employment benefits, employer’s commitments, FY2019, FY2018, percentage change"}
{"_id":"q1a739f92","title":"","text":"total revenue, 2017"}
{"_id":"q1a730b36","title":"","text":"warehouse equipment, value, 2018, 2019, company"}
{"_id":"q1a71bce0","title":"","text":"Expected long-term return, plan assets, net periodic benefit cost, actuarial assumptions, investment strategy, historical returns, risk premium, discount rate, pension plans, financial modeling."}
{"_id":"q1a72243c","title":"","text":"financial terms, companies, person names, dates"}
{"_id":"q1a7230f8","title":"","text":"closing price, March 2020, stock market, financial data"}
{"_id":"q1a71e940","title":"","text":"capitalized amount, U.K., build-to-suit facility, March 31, 2018, company"}
{"_id":"q1a721ece","title":"","text":"net receivables, 2019, 2018"}
{"_id":"q1a71a3e0","title":"","text":"segment operating income, 2017, 2018, financial analysis, year-over-year comparison"}
{"_id":"q1a734038","title":"","text":"gross profit margin, company, 2015"}
{"_id":"q1a715192","title":"","text":"EPS, Basic earnings per share, calculation, net income, preferred dividends, weighted average shares outstanding, financial metrics, earnings, shares, profitability, financial analysis."}
{"_id":"q1a728d78","title":"","text":"raw materials, manufacturing, supply chain, production costs, commodities, inventory management, procurement, materials sourcing"}
{"_id":"q1a7345e2","title":"","text":"fair value, plan assets, percentage change, 2018, 2019"}
{"_id":"q1a74160c","title":"","text":"Daina Middleton, Wister Walcott, shares, beneficial ownership, stock, equity, securities, ownership percentage, financial disclosure, corporate governance."}
{"_id":"q1a73af3c","title":"","text":"Deferred tax assets, 2018, tax loss carryforwards, temporary differences, tax credits, accounting standards, tax regulations, financial reporting, corporate tax rates, valuation allowance."}
{"_id":"q1a7319a0","title":"","text":"product sales segment, percentage change, 2018, 2019"}
{"_id":"q1a731298","title":"","text":"long-term prepaid ground rent, percentage, notes receivable, non-current assets, 2018"}
{"_id":"q1a7248f4","title":"","text":"average expected volatility, 2018, 2019"}
{"_id":"q1a7165ce","title":"","text":"write-off, uncollectable debts, allowance method, direct write-off method, bad debt expense, financial reporting, accounts receivable, GAAP, IFRS, tax implications, balance sheet, income statement, provision for doubtful accounts, credit risk, collection efforts, financial analysis, company policies, accounting standards."}
{"_id":"q1a713e50","title":"","text":"restricted stock awards, diluted earnings per share, fiscal year 2018"}
{"_id":"q1a736ec8","title":"","text":"Other components of net periodic benefit cost, 2018, 2019, financial analysis, pension costs, actuarial gains, losses, interest cost, service cost, company financials, year-over-year comparison."}
{"_id":"q1a737a76","title":"","text":"average total operating expenses, 2017-2018, 2018-2019, change, financial analysis"}
{"_id":"q1a713306","title":"","text":"deferred revenues, unearned revenue, liability, revenue recognition, accounting, financial reporting, ASC 606, IFRS 15, subscription services, prepaid services, contract liabilities, cash basis accounting, accrual basis accounting"}
{"_id":"q1a714922","title":"","text":"valuation, leased equipment, finance lease agreements, December 31, 2019"}
{"_id":"q1a72bc80","title":"","text":"average cost of revenues, 2018, 2019, company, financial analysis"}
{"_id":"q1a73954c","title":"","text":"accrued expense, 2018, 2019"}
{"_id":"q1a71a3a4","title":"","text":"net sales, 2017, 2018, financial performance, revenue growth"}
{"_id":"q1a732c60","title":"","text":"Long-term debt, average, financial metrics, liabilities, balance sheet, corporate finance, interest rates, amortization, debt-to-equity ratio, financial leverage."}
{"_id":"q1a714c1a","title":"","text":"North America, revenue, 2018, 2019"}
{"_id":"q1a7202d6","title":"","text":"Other, FY2019, FY2018, percentage change"}
{"_id":"q1a72833c","title":"","text":"cost of sales, 2017, 2018, financial analysis, year-over-year comparison"}
{"_id":"q1a72525e","title":"","text":"Total charges, Year 2019"}
{"_id":"q1a736bf8","title":"","text":"Grocery & Snacks, net derivative gains (losses), fiscal year 2017, fiscal year 2018, percentage change"}
{"_id":"q1a72900c","title":"","text":"Land and improvements, 2018, 2019, change, financial analysis, asset valuation, depreciation, real estate, investment, balance sheet, accounting standards."}
{"_id":"q1a725ce0","title":"","text":"Online Advertising, revenue, costs, fourth quarter, 2018, 2019"}
{"_id":"q1a734fd8","title":"","text":"Weighted average grant date fair value, year-on-year change, 2017, 2018, 2019, average, financial analysis"}
{"_id":"q1a739380","title":"","text":"operating segments, non-current assets, financial reporting, balance sheet, asset allocation, segment reporting, IFRS, GAAP, company disclosures, financial analysis"}
{"_id":"q1a73b96e","title":"","text":"fair value, award, service conditions, market conditions, valuation, equity awards, performance metrics, compensation expense, stock options, grant date, market price, vesting period, financial modeling, IFRS, ASC 718, companies, valuation techniques, risk factors, expected volatility, discount rate, performance targets, measurement date"}
{"_id":"q1a72d300","title":"","text":"charge, financial year, expenses, depreciation, amortization, interest, taxes, operating costs, non-operating income, provisions, accruals, financial reporting, income statement, balance sheet, cash flow, company performance, fiscal year, accounting standards"}
{"_id":"q1a71cbfe","title":"","text":"post-employment benefit obligations, life expectancy, age 65, actuarial assumptions, pension plans, demographic factors, financial reporting, liability valuation, mortality rates, 2023, 2022, 2021"}
{"_id":"q1a71d4d2","title":"","text":"Minimum Pension Liability, 2018, balance, pension, liability, financial reporting, accounting standards"}
{"_id":"q1a736b9e","title":"","text":"cumulative amount, net derivative gains, economic hedges, general corporate expenses, reporting segments"}
{"_id":"q1a7243e0","title":"","text":"R&D centers, India, technology companies, Tata Consultancy Services, Infosys, Wipro, HCL Technologies, Bangalore, Hyderabad, Pune, Chennai, Gurgaon, Noida, Mumbai, research and development, innovation, software development, engineering services."}
{"_id":"q1a7410c6","title":"","text":"Barry Litwin, Thomas Clark, non-equity incentive target amount, compensation, executive pay, performance metrics, financial targets."}
{"_id":"q1a715264","title":"","text":"Weighted average common shares outstanding, basic, 2019, 2018, 2017"}
{"_id":"q1a736216","title":"","text":"total number of shares, June 30, 2018, June 30, 2019"}
{"_id":"q1a7123e8","title":"","text":"state income tax returns, examination periods, IRS, tax audits, compliance, tax years, 2023, 2022, 2021, tax liabilities, tax regulations"}
{"_id":"q1a71d202","title":"","text":"long-term debt, percentage change, 2019, 2018"}
{"_id":"q1a718c0c","title":"","text":"net income, earnings per share, basic EPS, net income attributable to common shareholders, weighted average shares outstanding, financial metrics, dividends, preferred stock, common stock, accounting principles"}
{"_id":"q1a73733c","title":"","text":"currency translation losses, foreign exchange rates, multinational companies, financial reporting, currency fluctuations, economic conditions, hedging strategies, balance sheet, earnings impact, fiscal year 2023, international operations, exchange rate volatility, accounting standards, foreign subsidiaries, currency risk management"}
{"_id":"q1a71273a","title":"","text":"remuneration, key performance indicators, Annual Incentive Plan, performance measures, compensation, financial metrics, employee incentives, corporate governance, performance evaluation, bonus structure"}
{"_id":"q1a73ac08","title":"","text":"inventories, work in progress, 2018"}
{"_id":"q1a72dddc","title":"","text":"total contractual obligations, August 31, 2019, financial reporting, fiscal year, liabilities, commitments"}
{"_id":"q1a71578c","title":"","text":"accrued liabilities, company, financial year, 2023, 2022, 2021, 2020, 2019"}
{"_id":"q1a728f80","title":"","text":"Keywords: financial data, revenue, expenses, profit, balance sheet, income statement, cash flow, fiscal year, company performance, financial metrics"}
{"_id":"q1a732eea","title":"","text":"Number of Shares, Outstanding Options, Warrants, Rights, 2001 Share Incentive Plan, Proportion, Exercise"}
{"_id":"q1a717dca","title":"","text":"Total employee expenditure, financial analysis, year comparison, payroll costs, employee benefits, labor expenses, fiscal year, budget allocation, company financials."}
{"_id":"q1a72bbfe","title":"","text":"cost of revenues, 2019, 2018"}
{"_id":"q1a73a30c","title":"","text":"All Other Compensation, executive compensation, bonuses, stock options, retirement contributions, health benefits, perquisites, non-equity incentive plan, company car, life insurance, 401(k) contributions, severance pay, relocation expenses, tax gross-ups, personal security, entertainment expenses, fringe benefits."}
{"_id":"q1a713810","title":"","text":"contractual obligations, percentage, total contractual obligations, financial analysis, long-term liabilities, company financials, fiscal year, debt maturity, cash flow management"}
{"_id":"q1a740eaa","title":"","text":"net actuarial loss, average, 2017, 2018, 2019"}
{"_id":"q1a71cbd6","title":"","text":"healthcare costs, annual increase, insurance premiums, hospital services, prescription drugs, outpatient care, long-term care, medical devices, healthcare providers, 2023"}
{"_id":"q1a725380","title":"","text":"Restructuring charges, Total charges, 2019, percentage"}
{"_id":"q1a7368e2","title":"","text":"deferred tax assets, 2019, financial reporting, tax liabilities, accounting standards"}
{"_id":"q1a7311d0","title":"","text":"note receivables, 2019, financial assets, accounts receivable, interest income, balance sheet, liquidity, credit risk, amortization, financial reporting"}
{"_id":"q1a73cec2","title":"","text":"weighted average common shares outstanding, 2018, 2019"}
{"_id":"q1a7364d2","title":"","text":"amortized costs, municipal bonds, percentage, total amortized cost"}
{"_id":"q1a71d52c","title":"","text":"Unrealized Holding Gains, Available-for-sale Securities, $1 million, financial analysis, investment portfolio, market valuation, asset management, fiscal year, financial reporting."}
{"_id":"q1a737c9c","title":"","text":"Sales, foreign distributors, domestic distributors, 2019"}
{"_id":"q1a73c74c","title":"","text":"Total Bell Wireless, revenues, 2018, 2019"}
{"_id":"q1a7373e6","title":"","text":"total assets, total liabilities, total equity, 2019"}
{"_id":"q1a71792e","title":"","text":"software services, 2017, 2018, revenue growth, market trends, company performance, industry analysis"}
{"_id":"q1a723b5c","title":"","text":"domestic income, income taxes, 2019"}
{"_id":"q1a7259a2","title":"","text":"group share, associates' profits, 2018, 2019, pre-tax, post-tax"}
{"_id":"q1a715db8","title":"","text":"net deferred taxes, assets, liabilities, 2018, 2019"}
{"_id":"q1a72fb0a","title":"","text":"interest expense, bonds, realized loss, CCSs, 2019"}
{"_id":"q1a72b97e","title":"","text":"South African Credit Facility, carrying value, 2019, 2018, USD, change"}
{"_id":"q1a73060e","title":"","text":"impairment losses, percentage change, 2017, 2018"}
{"_id":"q1a7408e2","title":"","text":"total debt, increase, decrease, financial analysis, debt management, liabilities, balance sheet, fiscal year, debt ratio, company financials"}
{"_id":"q1a7321c0","title":"","text":"excluded potential common shares, 2018, financial analysis, diluted earnings per share, convertible securities, stock options, warrants, financial reporting, equity dilution"}
{"_id":"q1a71add6","title":"","text":"Issued and paid up capital, 2019"}
{"_id":"q1a7137de","title":"","text":"Term Loan Facility, total contractual obligations, percentage"}
{"_id":"q1a731b8a","title":"","text":"Repurchases, 2018, stock buybacks, corporate buybacks, financial analysis, market trends, S&P 500, companies, capital allocation, shareholder returns."}
{"_id":"q1a722752","title":"","text":"total charges, fiscal year 2019, fiscal year 2018, financial comparison, year-over-year analysis"}
{"_id":"q1a73ce5e","title":"","text":"net loss, 2017, 2018"}
{"_id":"q1a7209c0","title":"","text":"RSUs, performance criteria, expense recognition, fair value, grant date, vesting period, compensation expense, stock-based compensation, ASC 718, IFRS 2, performance metrics, market conditions, service conditions, expense amortization, tax implications, financial reporting, equity awards."}
{"_id":"q1a7152b4","title":"","text":"net loss per share, 2019, financial performance, earnings report"}
{"_id":"q1a72d0c6","title":"","text":"other income, 2018, 2019, financial performance, revenue streams, investment income, non-operating income, company analysis, financial results"}
{"_id":"q1a736450","title":"","text":"fair value, municipal bonds, corporate bonds, company values"}
{"_id":"q1a72d94a","title":"","text":"net total, percentage change, 2018, 2019"}
{"_id":"q1a721c12","title":"","text":"cash flows, increase, December 31, 2019, operating activities, revenue growth, cost reduction, investment income, working capital management, capital expenditures, financial performance, liquidity, cash management, net income, cash from operations"}
{"_id":"q1a71b7ae","title":"","text":"net operating cash, financial performance, year, analysis, cash flow, metrics"}
{"_id":"q1a7151c4","title":"","text":"Net loss, December 31, 2019, December 31, 2018, average, financial analysis"}
{"_id":"q1a73cb98","title":"","text":"warranty obligation, financial liability, product defects, company reputation, customer satisfaction, accounting standards, warranty reserves, legal compliance, industry regulations, warranty claims, financial forecasting, risk management"}
{"_id":"q1a73e376","title":"","text":"Activision, Blizzard, 2017, segment operating income, financial comparison"}
{"_id":"q1a71de00","title":"","text":"inventories, valuation, FIFO, LIFO, weighted average cost, lower of cost or market, GAAP, IFRS, balance sheet, cost of goods sold, inventory turnover, accounting standards, financial reporting"}
{"_id":"q1a71bd9e","title":"","text":"net periodic benefit cost, compensation increase, percentage change, 2017, 2018"}
{"_id":"q1a73249a","title":"","text":"Shipping revenues, Years Ended December 31, 2018, 2019, change, financial analysis, revenue growth, year-over-year comparison."}
{"_id":"q1a71e04e","title":"","text":"receivables, operating activities, net sales, 2019, decrease"}
{"_id":"q1a741db4","title":"","text":"diluted earnings per share, net income, weighted average shares, convertible securities, stock options, preferred stock, treasury stock method, earnings, financial analysis, equity financing, share dilution, financial metrics, accounting standards, GAAP, IFRS"}
{"_id":"q1a72e660","title":"","text":"acquisition cost, total cost, 2019, proportion, financial analysis"}
{"_id":"q1a714e86","title":"","text":"restricted stock unit, option grant, non-employee director, equity compensation, vesting schedule, stock options, grant date, company policy, board of directors, compensation committee, tax implications, shareholder value, performance metrics, liquidity event, stock market, SEC regulations, corporate governance, stockholder approval, award agreement, fair market value"}
{"_id":"q1a7267a8","title":"","text":"average total bookings, 2018, 2019"}
{"_id":"q1a712e38","title":"","text":"NEOs, average salary, compensation, executive pay, corporate governance, SEC filings, 2023, salary trends, performance bonuses, stock options, equity compensation, financial analysis."}
{"_id":"q1a73f4a6","title":"","text":"unrecognized tax benefits, ending balance, 2019, 2017, tax liabilities, financial reporting, IRS, compliance, tax provisions, accounting standards"}
{"_id":"q1a725f2e","title":"","text":"payroll, benefits, percentage change, 2018, 2019"}
{"_id":"q1a734754","title":"","text":"general and administrative expenses, financial years, chronological order"}
{"_id":"q1a71ebf2","title":"","text":"freehold investment property, 2018, 2019, change, financial reporting, reclassification, asset management"}
{"_id":"q1a71a41c","title":"","text":"net sales, 2017"}
{"_id":"q1a726802","title":"","text":"average total bookings, 2017, 2018, 2018, 2019, change, financial analysis"}
{"_id":"q1a71ef58","title":"","text":"lease liability, 2019, 2018"}
{"_id":"q1a73b78e","title":"","text":"Balance outstanding, 2018, 2019, financial analysis, year-over-year change, financial metrics, outstanding balance, fiscal year, comparative analysis."}
{"_id":"q1a73b1bc","title":"","text":"Research and Development Expense, 2018, 2019, Average, Financial Analysis, Company Performance, R&D Investment"}
{"_id":"q1a716178","title":"","text":"operating income, fiscal year 2019, fiscal year 2018, financial analysis, year-over-year comparison"}
{"_id":"q1a71b51a","title":"","text":"Net operating loss carryforwards, 2018, tax, IRS, financial reporting, corporations, losses, deferred tax assets."}
{"_id":"q1a73f9d8","title":"","text":"EMEA, service revenue, 2017, 2018, change, financial analysis"}
{"_id":"q1a737396","title":"","text":"total equity, % change, 2018, 2019"}
{"_id":"q1a729a84","title":"","text":"net income, third quarter, 2019"}
{"_id":"q1a7240fc","title":"","text":"65-nanometer technology, company, year, semiconductor, Intel, 2006"}
{"_id":"q1a721528","title":"","text":"revenue, operating revenue, non-operating revenue, recurring revenue, one-time revenue, gross revenue, net revenue, deferred revenue, recognized revenue, subscription revenue, service revenue, product revenue, interest income, dividend income, sales revenue, rental income"}
{"_id":"q1a72be9c","title":"","text":"sales and marketing expense, year ended 2018, year ended 2019"}
{"_id":"q1a726a50","title":"","text":"total revenue, 2017, 2018"}
{"_id":"q1a73515e","title":"","text":"ESPP, purchase rights, activity, years, financial data"}
{"_id":"q1a71baa6","title":"","text":"restructuring expenses, 2018, 2019, total amount, financial analysis"}
{"_id":"q1a7224be","title":"","text":"purchasing obligations, total, liabilities, contracts, financial commitments, accounts payable, cash flow, due dates, obligations management"}
{"_id":"q1a716f42","title":"","text":"total adjustments, exceed, $50,000 thousand, years"}
{"_id":"q1a72f07e","title":"","text":"Weighted average number of shares—basic, 2017, 2018, change, financial analysis, equity, earnings per share, stock market, company performance."}
{"_id":"q1a7165f6","title":"","text":"percentage change, total past due, not impaired receivables, 2018, 2019"}
{"_id":"q1a734a2e","title":"","text":"Operating income, fiscal 2017, fiscal 2018, variance, percent, financial analysis, year-over-year comparison"}
{"_id":"q1a73911e","title":"","text":"accumulated benefit obligation, financial reporting, pension plans, actuarial valuations, 2023, 2022, 2021, 2020, 2019"}
{"_id":"q1a7198c8","title":"","text":"Cash and cash equivalents, 2017, 2018, change, financial analysis, liquidity, balance sheet, year-over-year comparison."}
{"_id":"q1a72778e","title":"","text":"independent director, highest commission, compensation, corporate governance, board of directors, remuneration, financial performance, shareholder value, executive pay, 2023"}
{"_id":"q1a7219f6","title":"","text":"Subscriber Solutions & Experience, Charter Communications, 2023, financial reporting, revenue segment, business unit."}
{"_id":"q1a72c9b4","title":"","text":"Unlevered free cash flow, 2019, financial analysis, cash flow, valuation, EBITDA, capital expenditures, operating income, net working capital, discount rate."}
{"_id":"q1a741b20","title":"","text":"inventories, financial analysis, accounting periods, fiscal year, balance sheet, asset valuation, 2023, 2022, 2021, 2020, 2019"}
{"_id":"q1a71b16e","title":"","text":"finance costs, interest expense, debt financing, company earnings, financial leverage, capital structure, market interest rates, refinancing, credit risk, operational costs, fiscal year 2023, financial analysis"}
{"_id":"q1a737a1c","title":"","text":"average total operating expenses, 2018, 2019"}
{"_id":"q1a725c36","title":"","text":"FinTech, Business Services, revenue, fourth quarter, 2018, 2019, percentage increase"}
{"_id":"q1a73fa3c","title":"","text":"total service revenue, percentage change, 2017, 2018"}
{"_id":"q1a71575a","title":"","text":"income taxes payable, 2019, financial reporting, tax liabilities, corporate tax, income tax expense"}
{"_id":"q1a72fb64","title":"","text":"lease charge, 2018, 2019, financial analysis, expense comparison"}
{"_id":"q1a7232ba","title":"","text":"inventories, wireless devices, merchandise for resale, measurement, valuation, cost basis, FIFO, LIFO, weighted average cost, GAAP, IFRS, financial reporting, asset valuation, inventory turnover, supply chain management, retail sector, accounting standards"}
{"_id":"q1a72317a","title":"","text":"average stock price, first quarter, 2020, stock market, financial analysis"}
{"_id":"q1a73d12e","title":"","text":"liquidity, 2018, 2019, financial analysis, cash flow, balance sheet, current assets, current liabilities, liquidity ratio, financial metrics"}
{"_id":"q1a721ab4","title":"","text":"Subscriber Solutions & Experience, Traditional & Other Products, total revenue, financial analysis, revenue comparison, fiscal year, financial performance, revenue streams"}
{"_id":"q1a738714","title":"","text":"fixed assets, 2018, 2019, change, financial analysis, capital expenditures, depreciation, asset management"}
{"_id":"q1a733a20","title":"","text":"total external revenue, segment revenue, percentage constituent"}
{"_id":"q1a73a514","title":"","text":"dilutive securities, 2019, 2018, earnings per share, convertible bonds, stock options, preferred stock, share dilution, financial impact, equity financing, market capitalization, shareholder value"}
{"_id":"q1a726712","title":"","text":"total bookings, financial year, chronological order, revenue, earnings, fiscal year, financial performance, company reports, quarterly earnings, annual revenue, growth rate, projections, financial analysis"}
{"_id":"q1a732e2c","title":"","text":"Number of Shares, Outstanding Options, Company, Exercise, Equity, Stock Options, Dilution, Shareholder Equity"}
{"_id":"q1a73d3c2","title":"","text":"Singapore, average customers, financial analysis, market research, consumer behavior, demographics, economic trends."}
{"_id":"q1a719378","title":"","text":"RSAs, Restricted Stock Awards, granted in 2019, companies, stock options, equity compensation, vesting schedule, executive compensation, shareholder value, performance metrics, market trends, financial reporting."}
{"_id":"q1a73fc26","title":"","text":"NEOs, annual salary, FY19, total compensation, executive compensation, financial reporting, SEC filings, corporate governance."}
{"_id":"q1a7117ae","title":"","text":"sales and marketing expense, 2017"}
{"_id":"q1a721852","title":"","text":"surcharge revenue, 2018, 2019, financial analysis, revenue change"}
{"_id":"q1a71721c","title":"","text":"Vice Presidents, average age, company, executive team, demographics"}
{"_id":"q1a73f21c","title":"","text":"Personnel costs, teammate benefits, 2018, 2019, financial analysis, cost comparison, expense management"}
{"_id":"q1a715a3e","title":"","text":"RSUs, percentage change, 2018, 2019, equity compensation, stock options, financial analysis, company performance, vesting schedule."}
{"_id":"q1a73fee2","title":"","text":"sales growth, second half, revenue increase, market demand, consumer spending, economic recovery, product launch, strategic investment, Q3, Q4, earnings report, financial performance, company growth, profitability, market share, competitive advantage"}
{"_id":"q1a72ecdc","title":"","text":"accrued expenses, percentage change, 2018, 2019"}
{"_id":"q1a729408","title":"","text":"minimally prepared chicken, average contribution, fiscal years, 2017, 2018, 2019, net sales dollars"}
{"_id":"q1a7220e0","title":"","text":"R&D, 2018, increase, investment, companies, financial analysis, budget allocation, expenditures, growth rate"}
{"_id":"q1a73eba0","title":"","text":"Dividend income, interest income, 2018, 2017, financial performance, revenue comparison, earnings report."}
{"_id":"q1a7126e0","title":"","text":"maximum group operating profit, 2019, financial performance, earnings report, profit margin, revenue growth, operating income, financial analysis"}
{"_id":"q1a72eb60","title":"","text":"accrued interest, 2018"}
{"_id":"q1a719346","title":"","text":"authorized common stock, issuance, plan"}
{"_id":"q1a71ab1a","title":"","text":"benefits, plans, financial analysis, cost structure, risk assessment, investment strategies, company performance, revenue growth, market trends, fiscal policies"}
{"_id":"q1a73763e","title":"","text":"2019 Q1, 2019 Q2, high price, $40.00"}
{"_id":"q1a71b8da","title":"","text":"net cash, financing activities, 2019, $2.95 billion"}
{"_id":"q1a7395ce","title":"","text":"accrued liabilities, average, 2018, 2019"}
{"_id":"q1a739af6","title":"","text":"lease receivables, gross receivables, percentage, financial analysis, receivables management"}
{"_id":"q1a737990","title":"","text":"financial years, fiscal year, 2022, 2023, quarterly results, annual report, revenue, profit, expenses"}
{"_id":"q1a739fec","title":"","text":"total revenue, exceed, $500,000 thousand, years"}
{"_id":"q1a71de64","title":"","text":"Inventories, financial analysis, accounting, balance sheet, fiscal year, 2020, 2021, 2022, 2023, financial reporting, cost of goods sold, valuation, stock management."}
{"_id":"q1a728bb6","title":"","text":"Other products, revenue, $1,000 million, financial analysis, year-over-year growth, revenue streams, fiscal year, financial performance."}
{"_id":"q1a71ae08","title":"","text":"Issued and paid up capital, increase, decrease, 2018, 2019"}
{"_id":"q1a729b06","title":"","text":"Net income, parent company, December 31, 2018, December 31, 2019, increase, decrease"}
{"_id":"q1a738c64","title":"","text":"Permanent differences, 2018, 2019, average, tax, accounting, financial reporting, deferred tax, income tax expense, non-deductible expenses, tax-exempt income."}
{"_id":"q1a741e68","title":"","text":"OpenText, Basic earnings per share, average annual, financial performance, EPS, fiscal year, revenue, net income, market capitalization."}
{"_id":"q1a71aba6","title":"","text":"Provisions, post-employment benefits, employer commitments, FY2019, FY2018"}
{"_id":"q1a7114b6","title":"","text":"current assets, current liabilities, ratio, balance, financial analysis"}
{"_id":"q1a738c96","title":"","text":"Foreign rate differential, percentage change, 2018, 2019"}
{"_id":"q1a71f3ea","title":"","text":"Medical segment, gross profit, fiscal 2018, fiscal 2017"}
{"_id":"q1a71c046","title":"","text":"revenue, customer A, customer B, 2019"}
{"_id":"q1a73ed9e","title":"","text":"American Tower Corporation, Diluted net income, common stockholders, 2018, 2019, financial performance, earnings per share, revenue growth, net income change."}
{"_id":"q1a713df6","title":"","text":"incremental shares, December 31, 2019, December 31, 2018"}
{"_id":"q1a74040a","title":"","text":"prepaid taxes, 2018, 2019, financial analysis, tax accounting"}
{"_id":"q1a72aefc","title":"","text":"tax liabilities, deferred tax, income tax, corporate tax, sales tax, property tax, payroll tax, tax provisions, tax credits, tax deductions, IRS, tax compliance, tax audits, tax returns, tax planning, tax regulations, tax law, tax obligations, tax assessments, tax liabilities due dates"}
{"_id":"q1a716eb6","title":"","text":"Adjusted EBITDA, company, expenses, calculation, financial metrics, earnings, non-recurring items, operational performance, financial analysis, investors, 2023."}
{"_id":"q1a7293d6","title":"","text":"minimally prepared chicken, fiscal year 2018, fiscal year 2019, contribution change, percentage of net sales, financial analysis"}
{"_id":"q1a724ba6","title":"","text":"Current deferred income, percentage change, financial analysis, accounting, revenue recognition, deferred revenue, fiscal year, financial reporting, balance sheet, income statement."}
{"_id":"q1a721cc6","title":"","text":"net cash from operating activities, percentage change, 2017, 2018"}
{"_id":"q1a715a0c","title":"","text":"stock options, 2019, 2018, change, financial analysis"}
{"_id":"q1a7361e4","title":"","text":"Keywords: financial data, revenue, expenses, profit margin, fiscal year, balance sheet, income statement, cash flow, assets, liabilities, equity, earnings report, quarterly results, financial ratios, market capitalization, dividend yield."}
{"_id":"q1a740856","title":"","text":"financial covenants, credit agreement, leverage ratio, interest coverage ratio, debt service coverage ratio, net worth, liquidity ratio, EBITDA, financial metrics, compliance, borrower, lender, covenant breach, financial performance, reporting requirements, thresholds, financial ratios, amortization, collateral, default, financial obligations"}
{"_id":"q1a72d648","title":"","text":"software-as-a-service, revenue, 2018, 2019, average, market growth, subscription model, SaaS companies, financial performance"}
{"_id":"q1a7117e0","title":"","text":"research and development expense, 2017, 2018, financial analysis, expense comparison"}
{"_id":"q1a73e90c","title":"","text":"interest expense, 2019"}
{"_id":"q1a7264e2","title":"","text":"income, Foreign countries, 2018, 2019"}
{"_id":"q1a725ed4","title":"","text":"operating accruals, 2018, 2019"}
{"_id":"q1a733160","title":"","text":"exercise price, percentage change, 2018, 2019"}
{"_id":"q1a720a1a","title":"","text":"Weighted-Average Grant Date Fair Value, Nonvested shares, RSUs, December 31, 2018, December 31, 2019"}
{"_id":"q1a729322","title":"","text":"Keywords: Registrant, financial reporting, compliance, SEC, public company, disclosures, filings, corporate governance."}
{"_id":"q1a71f67e","title":"","text":"free cash flow, 2019"}
{"_id":"q1a71fdb8","title":"","text":"VMware, Inc., Q3 2020, net income, financial results."}
{"_id":"q1a72c9e6","title":"","text":"unlevered free cash flow, net cash flow, operating activities, capital expenditures, changes in working capital, tax rate, depreciation, amortization, interest expense, non-operating income, forecast period, discount rate"}
{"_id":"q1a724e26","title":"","text":"average financing activities, 2018, 2019"}
{"_id":"q1a720740","title":"","text":"share-based payment, equity instruments, fair value, vesting period, employee stock options, performance conditions, expense recognition, IFRS 2, stock compensation, grant date, market conditions, service conditions, intrinsic value, dilution, compensation expense, tax implications"}
{"_id":"q1a72efd4","title":"","text":"financial data, fiscal years, 2020, 2021, 2022, 2023"}
{"_id":"q1a741e0e","title":"","text":"OpenText, Basic earnings per share, fiscal year 2019, fiscal year 2018, financial performance, earnings comparison."}
{"_id":"q1a7121fe","title":"","text":"weighted average number of shares, financial analysis, year comparison, stock market, equity, share count, corporate finance"}
{"_id":"q1a72ec28","title":"","text":"accrued running costs, 2018"}
{"_id":"q1a73bee6","title":"","text":"pre-tax losses, 2018, financial performance, earnings report, fiscal year, net loss, income statement"}
{"_id":"q1a737670","title":"","text":"high price, 2019, first quarter, second quarter"}
{"_id":"q1a740bee","title":"","text":"Net cash and cash equivalents, 2017, 2018, change, increase, decrease, financial analysis, cash flow, liquidity, fiscal year."}
{"_id":"q1a714c4c","title":"","text":"Asia Pacific, average revenue, 2018, 2019"}
{"_id":"q1a73db7e","title":"","text":"operating profit, revenue, cost of goods sold, operating expenses, selling expenses, administrative expenses, depreciation, amortization, earnings before interest and taxes (EBIT), gross profit, operating income, financial analysis, profit margin"}
{"_id":"q1a72b65e","title":"","text":"Fair value, common stock, vested, 2019, 2018, percentage change"}
{"_id":"q1a71f25a","title":"","text":"EMEA, operating income, $3 million, years, financial performance"}
{"_id":"q1a717168","title":"","text":"Loral, executive officers, Item 10, March 12, 2020"}
{"_id":"q1a73b216","title":"","text":"revenue, 2018, 2019, percentage change"}
{"_id":"q1a722112","title":"","text":"research and development, 2018, 2017"}
{"_id":"q1a73af96","title":"","text":"deferred tax assets, tax loss carryforwards, temporary differences, accounting standards, tax regulations, financial reporting, corporate tax rates, valuation allowance, income tax expense, balance sheet, tax credits, tax liabilities, tax planning strategies, fiscal year-end, tax deferral strategies"}
{"_id":"q1a71ba4c","title":"","text":"restructuring expenses, 2018, 2019, average, financial analysis, corporate restructuring, cost management"}
{"_id":"q1a73c6ca","title":"","text":"Bell Wireless, operating revenues, 2019, growth, subscriber base, data services, wireless plans, market competition, ARPU, customer retention, promotional offers, network expansion, capital expenditures."}
{"_id":"q1a72964c","title":"","text":"Loans due from subsidiaries, percentage change, 2018, 2019, financial analysis, current portion, subsidiary loans, financial metrics"}
{"_id":"q1a71bf92","title":"","text":"Company, revenues, customers, September 30, 2018, September 30, 2019, total revenues"}
{"_id":"q1a736e14","title":"","text":"pension charges, benefit charges, 2019, financial reporting, employee benefits, actuarial assumptions, pension plans, company financials"}
{"_id":"q1a735258","title":"","text":"Proceeds from issuance of shares, percentage change, 2018, 2019"}
{"_id":"q1a713ac2","title":"","text":"stock-based compensation, 2019, financial reporting, equity compensation, expense recognition, companies, accounting standards"}
{"_id":"q1a715200","title":"","text":"Weighted average common shares outstanding, basic, December 31, 2019, December 31, 2018."}
{"_id":"q1a719314","title":"","text":"shares, shareholders, approved amendment, increase, corporate governance, equity, stock, capital structure"}
{"_id":"q1a723314","title":"","text":"Cost of equipment sales, merchandise for resale, inventory, direct costs, manufacturing costs, purchase price, shipping costs, handling fees, supplier discounts, depreciation, overhead costs, sales tax, warranty costs, returns, and allowances."}
{"_id":"q1a73c1a2","title":"","text":"Interest income, 2019, 2018, financial analysis, year-over-year comparison, revenue growth, interest rates, financial performance, earnings report."}
{"_id":"q1a73f424","title":"","text":"unrecognized tax benefit, deferred tax liabilities, tax positions, IRS, financial reporting, tax compliance, tax reserves, accounting standards, tax audits, tax strategies"}
{"_id":"q1a7173b6","title":"","text":"APAC, total assets, 2019"}
{"_id":"q1a731c0c","title":"","text":"Balance at end of period, exceed, 30,000,000, years, financial analysis, fiscal year, financial reporting"}
{"_id":"q1a7207c2","title":"","text":"PSP payments, Group, percentage change, 2019, 2018"}
{"_id":"q1a72e75a","title":"","text":"acquisition costs, transaction fees, legal fees, due diligence expenses, financing costs, integration costs, advisory fees, regulatory fees, accounting fees, employee retention bonuses, asset valuation costs, merger-related expenses, closing costs, tax implications, contingent liabilities, purchase price allocation, goodwill, intangible assets, restructuring costs, investment banking fees"}
{"_id":"q1a716f1a","title":"","text":"amortization, depreciation, expense, 2018"}
{"_id":"q1a71983c","title":"","text":"Cash, Cash Equivalents, short-term investments, marketable securities, treasury bills, money market funds, commercial paper, bank deposits, liquidity, current assets."}
{"_id":"q1a71a1ce","title":"","text":"% change, items, financial analysis, threshold, data comparison"}
{"_id":"q1a740b9e","title":"","text":"Net cash used in financing activities, 2019"}
{"_id":"q1a727d4c","title":"","text":"Products and Licensing revenue, December 31, 2018, December 31, 2019, average revenue, financial analysis, revenue growth, fiscal year, company performance."}
{"_id":"q1a719634","title":"","text":"share of net earnings, affiliates, financial reporting, equity method, investment income, earnings contribution, consolidated financials, ownership stake, financial performance, accounting standards"}
{"_id":"q1a74168e","title":"","text":"Daina Middleton, Wister Walcott, average number of shares, beneficial ownership, stock ownership, equity, shares outstanding, financial analysis, investment, corporate governance."}
{"_id":"q1a71d22a","title":"","text":"senior notes, total debt, 2020, 2021, 2019"}
{"_id":"q1a71712c","title":"","text":"executive officers, age, corporate governance, leadership, management, company profiles"}
{"_id":"q1a726776","title":"","text":"financial years, chronological order"}
{"_id":"q1a714ee0","title":"","text":"Darcy Antonellis, David C. Habiger, total compensation, ratio, financial analysis, executive compensation, corporate governance, salary comparison, 2023."}
{"_id":"q1a729066","title":"","text":"Property and equipment, net, Accumulated depreciation and amortization, percentage difference, 2018, 2019"}
{"_id":"q1a72dad0","title":"","text":"assets, estimated useful lives, depreciation, capital expenditures, accounting standards, financial reporting, asset valuation, useful life estimation, IFRS, GAAP"}
{"_id":"q1a72a524","title":"","text":"Property and equipment, net, financial metrics, asset valuation, depreciation, fiscal year, balance sheet, capital expenditures, investment analysis."}
{"_id":"q1a713338","title":"","text":"deferred software, deferred subscription-based service, performance obligations, useful life, duration, accounting standards, revenue recognition, ASC 606, IFRS 15"}
{"_id":"q1a71f930","title":"","text":"net carrying amount, unamortized debt issuance costs, percentage change, 2018, 2019"}
{"_id":"q1a73f9b0","title":"","text":"EMEA, service revenue, 2018"}
{"_id":"q1a71b542","title":"","text":"tax credits, 2018, 2019, tax policy, IRS, financial impact, tax reform"}
{"_id":"q1a714986","title":"","text":"Land, 2018, real estate, valuation, property market, investment, land acquisition, land use, market trends, land prices"}
{"_id":"q1a714706","title":"","text":"foreign pretax income, 2018, 2019, change, financial analysis"}
{"_id":"q1a72810c","title":"","text":"total benefit obligations, total capital lease obligations, pension liabilities, lease liabilities, financial obligations, accounting standards, balance sheet, present value, actuarial assumptions, lease agreements"}
{"_id":"q1a71f200","title":"","text":"APAC, operating income, 2019"}
{"_id":"q1a712460","title":"","text":"interest, penalties, uncertain tax positions, company classification, tax liability, financial reporting, accounting standards"}
{"_id":"q1a725916","title":"","text":"associate's results, line item, Other associates, financial disclosure"}
{"_id":"q1a73e5ce","title":"","text":"Other financial income, Other financial expenses, interest income, foreign exchange gains, investment income, dividend income, interest expense, foreign exchange losses, impairment losses, transaction costs, financial derivatives, hedge accounting, amortization of financial assets, penalties, fees, and commissions."}
{"_id":"q1a71eb98","title":"","text":"agreement, group, 28 June 2019"}
{"_id":"q1a73b6c6","title":"","text":"revolving credit facility, variable rate, fixed rate, debt, interest rate swap, hedging strategy, financial instruments, risk management, company, debt restructuring, financial derivatives"}
{"_id":"q1a71b812","title":"","text":"net cash, investing activities, capital expenditures, acquisitions, investments, divestitures, property, plant, equipment, securities, cash outflows, cash inflows, financial assets, mergers, joint ventures, depreciation, amortization."}
{"_id":"q1a729d90","title":"","text":"adjusted revenue, percentage change, 2016, 2017"}
{"_id":"q1a73556e","title":"","text":"revenue, Year Ended December 31, 2019, financial performance, fiscal year, earnings report"}
{"_id":"q1a73f014","title":"","text":"Weighted average grant date stock price, 2017, 2018, stock options, equity compensation, financial analysis, market trends, valuation, company performance."}
{"_id":"q1a718068","title":"","text":"on-net APRU, percentage change, 2017, 2018"}
{"_id":"q1a722c2a","title":"","text":"gross profit, 2019, 2018"}
{"_id":"q1a726fa0","title":"","text":"total purchase obligations, financial commitments, liabilities, contracts, future payments, accounting standards, cash flow, financial analysis"}
{"_id":"q1a71b7e0","title":"","text":"net increase in cash, cash equivalents, 2017, 2018, financial analysis, cash flow, year-over-year comparison"}
{"_id":"q1a73d106","title":"","text":"revolving credit facility, availability, 2018, 2019, financial analysis, credit terms, liquidity, borrowing capacity"}
{"_id":"q1a73ed12","title":"","text":"pro forma results, exclusions, non-recurring items, one-time expenses, restructuring costs, stock-based compensation, tax impacts, extraordinary gains, financial projections, earnings adjustments"}
{"_id":"q1a72ac9a","title":"","text":"Total foreign countries sales, 2018, international sales, export revenue, global market, trade statistics."}
{"_id":"q1a739768","title":"","text":"allowance for credit loss, company, financial analysis, risk assessment, credit risk, financial modeling, historical loss data, economic conditions, management judgment, regulatory requirements, impairment, loan portfolio, provisioning, financial reporting, credit quality, loss forecasting, industry benchmarks, 2023"}
{"_id":"q1a7221c6","title":"","text":"revenue, percentage change, financial analysis, fiscal year, earnings report, growth rate, company performance, quarterly results, year-over-year, financial metrics"}
{"_id":"q1a725538","title":"","text":"capitalized interest, 2018"}
{"_id":"q1a725c5e","title":"","text":"Online Advertising revenue, percentage change, fourth quarter, 2018, 2019"}
{"_id":"q1a72a4f2","title":"","text":"impairment losses, Americas, Consolidated Statements of Operations, financial reporting, asset impairment, goodwill impairment, long-lived assets, intangible assets, accounting standards, ASC 360, ASC 350, financial analysis, quarterly results, annual reports"}
{"_id":"q1a7130a4","title":"","text":"acquisition charges, integration charges, collaboration, JJMD, Q4, Fiscal year 2019"}
{"_id":"q1a727702","title":"","text":"V Thyagarajan, Sitting Fees, board meetings, committee meetings, corporate governance, remuneration, compensation, financial disclosure, company policy, director fees."}
{"_id":"q1a71f4f8","title":"","text":"Loss from Operations, Fiscal Year, April 28, 2018, April 29, 2017, average, financial analysis, operating loss"}
{"_id":"q1a731c34","title":"","text":"Restricted stock unit issuances, percentage change, 2018, 2019"}
{"_id":"q1a71a142","title":"","text":"CTS, sales, percentage increase, 2019"}
{"_id":"q1a732634","title":"","text":"Company's property, plant and equipment, location, assets, valuation, depreciation, investment, capital expenditure, balance sheet."}
{"_id":"q1a72aa60","title":"","text":"Income tax effect, discontinued operations, average, 2017, 2018, 2019, financial analysis, tax impact, corporate finance."}
{"_id":"q1a73f19a","title":"","text":"Selling and administrative expenses, 2019, 2018, increase, financial analysis, expense report."}
{"_id":"q1a72feac","title":"","text":"Teradyne, deferred tax assets, deferred tax liabilities, financial reporting, 2023, 2022, 2021, 2020, 2019"}
{"_id":"q1a71aae8","title":"","text":"Provisions, post-employment benefits, recognition, IAS 19, employee benefits, actuarial assumptions, financial statements, balance sheet, income statement, discount rate, service cost, interest cost, defined benefit plans, defined contribution plans, employer obligations, funding status, actuarial gains, actuarial losses, plan assets, liabilities, accounting standards."}
{"_id":"q1a7236fc","title":"","text":"Net income, 2018, 2019, increase, decrease, financial performance, year-over-year, earnings, profit, loss"}
{"_id":"q1a73fba4","title":"","text":"NEO, cryptocurrency, blockchain, smart contracts, decentralized applications, digital assets, NEO Foundation, 2014, China."}
{"_id":"q1a712adc","title":"","text":"FVOCI, 2018, 2019, financial instruments, fair value, change, year end, accounting standards, IFRS 9, investment securities"}
{"_id":"q1a730f64","title":"","text":"income tax benefits, 2019, 2018"}
{"_id":"q1a72b38e","title":"","text":"government grants, funding, financial assistance, economic development, research and development, small business support, education funding, healthcare initiatives, infrastructure projects, renewable energy, agriculture subsidies, disaster relief, community development, innovation grants, tax incentives, federal funding, state grants, local government funding, nonprofit support, job creation, workforce development, environmental projects, public health initiatives, technology grants, arts funding, housing assistance, transportation funding, economic stimulus, grant programs, eligibility criteria."}
{"_id":"q1a7329ea","title":"","text":"average cents per share, 2018, 2019, interim, financial analysis"}
{"_id":"q1a7113c6","title":"","text":"cumulative-effect adjustment, fiscal 2019, retained earnings"}
{"_id":"q1a71bdd0","title":"","text":"projected benefit obligation, discount rate, percentage change, 2018, 2019"}
{"_id":"q1a725ea2","title":"","text":"payroll, benefits, 2018, 2019"}
{"_id":"q1a7261ae","title":"","text":"total compensation, percentage change, 2019, 2018"}
{"_id":"q1a71a61a","title":"","text":"provision for doubtful receivables, 2018"}
{"_id":"q1a72179e","title":"","text":"gross profit, 2019"}
{"_id":"q1a7319d2","title":"","text":"Altium Nexus, total product sales, 2018, percentage"}
{"_id":"q1a73f76c","title":"","text":"percentage change, total net property, plant and equipment, 2018, 2019"}
{"_id":"q1a717438","title":"","text":"APAC, total assets, 2018, 2019, change, financial analysis"}
{"_id":"q1a7182f2","title":"","text":"Bell Wireless, capital expenditures, $ change, financial analysis, investment, telecommunications, 2023"}
{"_id":"q1a73fbd6","title":"","text":"NEOs, company, executives, compensation, leadership, financial performance, governance, SEC, disclosure, management team."}
{"_id":"q1a72e11a","title":"","text":"Asia, Pacific Rim, revenue, 2018"}
{"_id":"q1a729d36","title":"","text":"cost of revenue, Adjusted Revenue, financial analysis, expense, operating costs, revenue recognition, gross profit, income statement, financial metrics"}
{"_id":"q1a733c00","title":"","text":"Tax benefit, stock compensation expense, 2019, financial reporting, tax deduction, equity compensation, deferred tax asset."}
{"_id":"q1a736c2a","title":"","text":"Foodservice, net derivative losses, fiscal year 2018, fiscal year 2019"}
{"_id":"q1a71719a","title":"","text":"Vice Presidents, company, ages, current, financial management, corporate governance"}
{"_id":"q1a730370","title":"","text":"weighted average estimated life, computer software, client relationships, years"}
{"_id":"q1a717adc","title":"","text":"financial terms, companies, person names, dates"}
{"_id":"q1a73a744","title":"","text":"Trade accounts receivable, net, noncurrent, balance sheet, assets, current assets, long-term assets, financial reporting, accounts receivable, net receivables."}
{"_id":"q1a719d14","title":"","text":"non-cash change, liabilities, impact, financial reporting, accounting, depreciation, amortization, provisions, contingent liabilities, lease liabilities"}
{"_id":"q1a74037e","title":"","text":"prepaid taxes, 2019, tax liability, tax payments, accounting, financial reporting, deferred tax assets, IRS, tax credits, cash flow management"}
{"_id":"q1a71bfba","title":"","text":"accounts receivable, long term receivable, Customer B, September 30, 2019"}
{"_id":"q1a71336a","title":"","text":"beginning balance, December 31, 2019"}
{"_id":"q1a73aa46","title":"","text":"stock options, average, 2017, 2018, 2019"}
{"_id":"q1a71580e","title":"","text":"accrued liabilities, percentage change, 2018, 2019"}
{"_id":"q1a714bb6","title":"","text":"Asia Pacific, revenue, 2018, 2019"}
{"_id":"q1a72d094","title":"","text":"interest expense, 2017, 2018, debt levels, interest rates, refinancing, financial leverage, company performance, bond issuance, credit risk, market conditions"}
{"_id":"q1a7323aa","title":"","text":"shipping revenues, decreased, year ended, December 31, 2019, 2018"}
{"_id":"q1a72ea5c","title":"","text":"Accrued expenses, liabilities, financial reporting, fiscal year, balance sheet, accounting period, 2023, 2022, 2021, 2020."}
{"_id":"q1a7178fc","title":"","text":"data services, analytic services, 2017, financial analytics, data management, predictive analytics, business intelligence, data visualization, market analysis, financial modeling, risk assessment, investment analysis, big data, data mining, analytics software, financial technology, fintech, data governance, cloud analytics, machine learning, artificial intelligence, data-driven decision making."}
{"_id":"q1a7193a0","title":"","text":"RSAs, 2018, 2019, increase, decrease, financial analysis, compensation, equity awards, stock options, performance metrics, company performance."}
{"_id":"q1a73b9a0","title":"","text":"restricted stock, restricted stock units, stock awards, vesting schedule, tax implications, liquidity events, company policies, employee compensation, stockholder rights, market value, performance metrics, grant date, exercise price, forfeiture, transfer restrictions, SEC regulations, equity compensation, shareholder agreements, tax withholding, reporting requirements"}
{"_id":"q1a73efec","title":"","text":"Expected volatility, 2017, 2018, financial markets, VIX, options pricing, risk assessment, market sentiment, investment strategies."}
{"_id":"q1a71fbe2","title":"","text":"accrued revenue, average, 2018, 2019"}
{"_id":"q1a73623e","title":"","text":"Balance, June 30, 2017"}
{"_id":"q1a72a2d6","title":"","text":"consumer, average, 3 years, financial analysis, economic trends"}
{"_id":"q1a71fe80","title":"","text":"total revenue, Q3 2020, Q4 2020, financial performance, quarterly earnings, revenue growth, fiscal year 2020"}
{"_id":"q1a71fe44","title":"","text":"VMware, Inc., Net income, 2020, quarters, $1,000 million"}
{"_id":"q1a71ae6c","title":"","text":"Total, contributed equity, less than 100,000 thousands, year, financial analysis"}
{"_id":"q1a72a47a","title":"","text":"assets, measurement, fair value, historical cost, impairment, market value, financial instruments, intangible assets, depreciation, amortization, IFRS, GAAP, investment properties, derivatives, equity securities, liabilities, cash equivalents, goodwill, revaluation, financial reporting, valuation techniques, market approach, income approach, cost approach, financial analysis, risk assessment, accounting standards, asset classification, liquidity, solvency, balance sheet, income statement."}
{"_id":"q1a72f830","title":"","text":"2019, 2018, financial year end, fiscal year, accounting period"}
{"_id":"q1a73260c","title":"","text":"net book value, property, plant and equipment, September 30, 2019"}
{"_id":"q1a72d382","title":"","text":"dividend shares, 2019, 2018, change, financial analysis"}
{"_id":"q1a72a57e","title":"","text":"Property and equipment, net, percentage change, 2018, 2017, financial analysis, asset valuation."}
{"_id":"q1a72ca68","title":"","text":"adjusted operating profit, percentage change, 2019, 2018"}
{"_id":"q1a72cc48","title":"","text":"restricted stock, average, 2017, 2018, 2019"}
{"_id":"q1a724b74","title":"","text":"Current deferred income, change, financial reporting, revenue recognition, accounting standards, balance sheet, deferred revenue, liability, financial period, company earnings, fiscal year, revenue deferral, recognition criteria."}
{"_id":"q1a719922","title":"","text":"Total cash, cash equivalents, restricted cash, percentage change, 2018, 2019"}
{"_id":"q1a729a52","title":"","text":"net income, fourth quarter, 2019, financial performance, earnings report, revenue, expenses, profit margin, company analysis"}
{"_id":"q1a71fbba","title":"","text":"accrued revenue, percentage change, 2019, financial analysis, revenue recognition"}
{"_id":"q1a72dbb6","title":"","text":"computer hardware, cost, 2019, 2018"}
{"_id":"q1a734d26","title":"","text":"deferred income tax liabilities, temporary differences, taxable income, accounting income, tax rates, future tax payments, tax deductions, financial reporting, balance sheet, income tax expense, tax deferral, tax liabilities, tax assets, GAAP, IFRS, tax provisions, corporate tax, tax compliance, tax planning"}
{"_id":"q1a741aee","title":"","text":"LIFO, inventories, reductions, financial impact, tax implications, cash flow, earnings, inventory valuation, cost of goods sold, accounting methods, inflation, companies, financial reporting, balance sheet, profit margins, tax liability, asset valuation, fiscal year, inventory management."}
{"_id":"q1a71d996","title":"","text":"personnel expenses, salaries, wages, bonuses, benefits, payroll taxes, employee stock options, retirement contributions, health insurance, training costs, recruitment expenses, severance pay, overtime pay, commissions, labor costs"}
{"_id":"q1a73578a","title":"","text":"operating income, 2015, 2016, financial analysis, year-over-year comparison"}
{"_id":"q1a714954","title":"","text":"property, equipment, company, years, financial data"}
{"_id":"q1a711f10","title":"","text":"cable expenditure, average, consumer spending, telecommunications, media companies, 2023, Nielsen, Comcast, Charter Communications, AT&T"}
{"_id":"q1a73f456","title":"","text":"income tax provision, December 31, 2019, company, decrease, financial impact"}
{"_id":"q1a7209e8","title":"","text":"Nonvested shares, RSUs, December 31, 2018, 2019, change, equity compensation, stock options, vesting schedule."}
{"_id":"q1a71b1c8","title":"","text":"profit margin, fourth quarter, 2018"}
{"_id":"q1a71e3aa","title":"","text":"low price per share, third quarter, 2018"}
{"_id":"q1a72859e","title":"","text":"inventory cost basis, inventory management, cost reduction, supply chain optimization, Just-In-Time (JIT), economic order quantity (EOQ), inventory turnover, carrying costs, ABC analysis, markdowns, write-downs, FIFO, LIFO, inventory valuation, financial efficiency, operational cost, working capital, asset management."}
{"_id":"q1a73ac3a","title":"","text":"Parts, raw materials, inventories, 2019"}
{"_id":"q1a72aa2e","title":"","text":"Netsmart, Gain on Sale, 2017, 2018, 2019, average, financial performance, revenue, transaction, valuation."}
{"_id":"q1a7260be","title":"","text":"Key Management, financial governance, corporate strategy, executive leadership, risk management, financial oversight, compliance, financial reporting, investment decisions, stakeholder engagement."}
{"_id":"q1a718946","title":"","text":"Other payables, accruals, payment terms, due dates, financial obligations, liabilities, cash flow management, accounting period, company policies, vendor agreements."}
{"_id":"q1a73d8ae","title":"","text":"Audit Fees, NT$, 2018, 2019, increase, decrease"}
{"_id":"q1a740e28","title":"","text":"pre-tax curtailment gain, 2018, financial reporting, pension plans, accounting standards"}
{"_id":"q1a737fc6","title":"","text":"Personnel-related items, 2018, 2019, change, financial analysis, payroll expenses, employee benefits, compensation, labor costs, human resources, company performance, fiscal year, budget allocation."}
{"_id":"q1a714c9c","title":"","text":"average revenue, North America, 2018, 2019"}
{"_id":"q1a740dce","title":"","text":"service cost, 2019"}
{"_id":"q1a728fb2","title":"","text":"ASU 2016-02, Leases (Topic 842), introduces significant changes to lease accounting, requiring lessees to recognize lease assets and liabilities on the balance sheet for most leases. Key terms include:\n\nlease assets, lease liabilities, balance sheet, lessees, operating leases, finance leases, ASC 842, FASB, effective date, transition, financial reporting, compliance, disclosures, lease term, incremental borrowing rate, right-of-use asset, lease expense, amortization, financial impact, accounting standards."}
{"_id":"q1a731be4","title":"","text":"Balance at beginning of the year, 2018, 2019, change, financial analysis, year-over-year comparison"}
{"_id":"q1a71dc0c","title":"","text":"Americas revenue, movement, financial performance, quarterly results, revenue growth, fiscal year, earnings report, company performance, market trends, revenue decline, revenue increase, financial analysis, revenue projections, economic impact, revenue sources."}
{"_id":"q1a741ddc","title":"","text":"Common Share equivalents, such as stock options or convertible securities, are excluded from the computation of diluted earnings per share when they are anti-dilutive. This typically occurs when the exercise price of the options is greater than the average market price of the common shares during the reporting period, or when including them would result in a higher earnings per share than the basic earnings per share. \n\nKeywords: Common Share equivalents, diluted earnings per share, anti-dilutive, exercise price, average market price, basic earnings per share."}
{"_id":"q1a72ff06","title":"","text":"Other, 2019, 2018, financial analysis, year-over-year change"}
{"_id":"q1a71cf46","title":"","text":"Purchases of property and equipment, finance leases, perpetual easements, capital leases, percentage change, 2018, 2019"}
{"_id":"q1a725e7a","title":"","text":"deferred revenue, current portion, 2018, 2019"}
{"_id":"q1a719eae","title":"","text":"US$ values, 2015, 2016, 2017, 2018, currency translation, exchange rates, inflation adjustment, financial reporting, multinational corporations, foreign exchange impact."}
{"_id":"q1a71bb00","title":"","text":"restructuring costs, 2019 restructuring plan, May 31, 2019, total estimated costs, remaining costs"}
{"_id":"q1a72182a","title":"","text":"gross margin, year, financial analysis, profitability, revenue, cost of goods sold, fiscal year, financial performance"}
{"_id":"q1a7298ae","title":"","text":"goodwill impairment, restructuring charges, 2017, 2018"}
{"_id":"q1a72467e","title":"","text":"net sales, percentage change, 2017, 2018"}
{"_id":"q1a733bd8","title":"","text":"tax benefit, stock compensation expense, Consolidated Statements of Operations, financial reporting, accounting standards, deferred tax assets, income tax expense, equity compensation, GAAP, ASC 718"}
{"_id":"q1a7140b2","title":"","text":"equity in net earnings, affiliates, financial reporting, earnings, investment, accounting standards, 2023, 2022, 2021, 2020, 2019"}
{"_id":"q1a739d6c","title":"","text":"total contractual obligations, financial commitments, liabilities, lease agreements, service contracts, purchase agreements, debt obligations, contingent liabilities, company disclosures, SEC filings, financial reporting, contractual terms, maturity dates, interest rates, payment schedules, risk assessment, compliance requirements, financial analysis, corporate governance."}
{"_id":"q1a72ca40","title":"","text":"adjusted operating profit, 2019, 2018, financial performance, year-over-year comparison"}
{"_id":"q1a711b3c","title":"","text":"financial terms, companies, person names, dates"}
{"_id":"q1a72db34","title":"","text":"software costs, immediately expensed, capitalized costs, operating expenses, accounting software, SaaS, subscription fees, development costs, amortization, financial reporting, GAAP, IFRS, expense recognition, software licenses, maintenance costs, small business accounting, tax implications, expense categorization, technology investments"}
{"_id":"q1a72d120","title":"","text":"interest expense, percentage change, 2018, 2019"}
{"_id":"q1a72d148","title":"","text":"other, net, 2018, 2019, financial analysis, year-over-year change"}
{"_id":"q1a714eae","title":"","text":"Richard S. Hill, Christopher A. Seams, total compensation, financial analysis, executive compensation, salary, bonuses, stock options, fiscal year, SEC filings."}
{"_id":"q1a73436c","title":"","text":"integration incentives expense, 2019, 2018, ratio"}
{"_id":"q1a73d340","title":"","text":"top ten customers, percentage, total operating revenues, 2019"}
{"_id":"q1a7336a6","title":"","text":"liability, uncertain tax positions, company, tax compliance, financial reporting, tax risk, IRS, GAAP, tax reserves, audit, tax liabilities, tax provisions, tax strategies, tax regulations"}
{"_id":"q1a72d5bc","title":"","text":"SaaS revenue, 2018, 2019, software-as-a-service, market growth, subscription model, cloud computing, revenue forecast, industry analysis, financial performance, technology sector."}
{"_id":"q1a726122","title":"","text":"management compensation, base salary, bonuses, stock options, restricted stock units, performance-based incentives, long-term incentives, short-term incentives, equity compensation, cash compensation, executive compensation, salary structure, incentive plans, compensation packages, total compensation, pay-for-performance, benchmarking, compensation committee, annual reviews, retention bonuses"}
{"_id":"q1a716b64","title":"","text":"income tax benefit, 2019, tax policy, IRS, deductions, credits, tax return, fiscal year, revenue, tax liability"}
{"_id":"q1a71debe","title":"","text":"Finished goods, 2018, 2019, inventory, balance sheet, financial analysis, year-over-year change, manufacturing, supply chain, cost of goods sold, company performance."}
{"_id":"q1a72e0b6","title":"","text":"revenues, geographic area, financial analysis, market segmentation, regional performance, sales distribution, company earnings, fiscal year, financial reporting, revenue streams"}
{"_id":"q1a71eef4","title":"","text":"valuation allowance, 2019, 2018"}
{"_id":"q1a719076","title":"","text":"Change in foreign operations tax exposure reserves, 2019"}
{"_id":"q1a73f28a","title":"","text":"Personnel costs, teammate benefits, 2018, 2019, average, financial analysis"}
{"_id":"q1a7280da","title":"","text":"operating lease obligations, total contractual obligations, percentage, financial analysis, liabilities, accounting standards, ASC 842, IFRS 16, company financials, lease liabilities, balance sheet, cash flow, financial reporting, obligations comparison"}
{"_id":"q1a7144d6","title":"","text":"Accruals, financial analysis, accounting, fiscal year, financial reporting, revenue recognition, expense matching, balance sheet, cash flow, financial metrics."}
{"_id":"q1a71a4a8","title":"","text":"segment operating income, percentage change, 2017, 2018"}
{"_id":"q1a71b1fa","title":"","text":"cost of revenue, fourth quarter 2019, revenue percentage"}
{"_id":"q1a7319fa","title":"","text":"Other, total product sales, 2019, percentage"}
{"_id":"q1a72a9de","title":"","text":"Netsmart, Gain on sale, 2018, financial transaction, acquisition, revenue, investment, healthcare technology, sale proceeds, valuation."}
{"_id":"q1a72f808","title":"","text":"Oracle, hardware revenues, fiscal 2019, fiscal 2018, constant currency decreases, revenue decline, market conditions, product demand, competitive landscape."}
{"_id":"q1a71ce6a","title":"","text":"Acquisition, Commercialization Rights, financial transaction, licensing agreement, intellectual property, market access, revenue generation, strategic partnership, company valuation, investment opportunity."}
{"_id":"q1a735190","title":"","text":"ESPP, shares issued, 2019, employee stock purchase plan, equity compensation, stock options, company shares, financial reporting, employee benefits."}
{"_id":"q1a736c52","title":"","text":"net derivative gains, segment operating profit, fiscal year 2017, expected operating result gains, fiscal year 2020"}
{"_id":"q1a73b93c","title":"","text":"granted shares, excluded, table, stock options, restricted stock units, performance shares, equity compensation, vesting schedule, shareholder equity, company policy"}
{"_id":"q1a7267d0","title":"","text":"total bookings, 2017, 2018, average, financial analysis"}
{"_id":"q1a72b8f2","title":"","text":"South African Credit Facility, maturity date, finance, loans, credit, South Africa, financial institutions, agreements."}
{"_id":"q1a717b40","title":"","text":"loans payable, long term position, 2018, financial liabilities, balance sheet, debt obligations"}
{"_id":"q1a71177c","title":"","text":"R&D expense, 2019, financial analysis, company performance, investment, innovation, budget allocation, expense report, fiscal year, industry comparison"}
{"_id":"q1a71def0","title":"","text":"Finished goods, percentage change, 2018, 2019"}
{"_id":"q1a739dc6","title":"","text":"current liabilities, long-term debt, financial obligations, accounts payable, short-term debt, lease obligations, bonds payable, interest payments, maturity dates, cash flow management"}
{"_id":"q1a724d40","title":"","text":"cash flow from operating activities, fiscal 2019"}
{"_id":"q1a727360","title":"","text":"long-lived assets, fair value, 2018, 2019, average total, held for sale"}
{"_id":"q1a7160ec","title":"","text":"operating income, fiscal year 2019, fiscal year 2018"}
{"_id":"q1a72ce50","title":"","text":"restructuring expenses, financial reporting, company filings, SEC, earnings call, balance sheet, income statement, management discussion, financial analysis, accounting standards"}
{"_id":"q1a732c92","title":"","text":"Noncurrent liabilities, percentage increase, 2018, 2019, financial analysis, balance sheet, accounting, liabilities, debt exclusion."}
{"_id":"q1a7175dc","title":"","text":"license agreements, marketed products, financial terms, royalties, revenue sharing, intellectual property, contract duration, compliance, negotiation, partnership, exclusivity, market access, product development, financial obligations, performance metrics"}
{"_id":"q1a741d82","title":"","text":"Basic earnings per share, EPS, net income, preferred dividends, weighted average shares outstanding, financial metrics, earnings calculation, company performance, stock valuation."}
{"_id":"q1a715232","title":"","text":"net loss, -10,000, year, financial performance"}
{"_id":"q1a71eb66","title":"","text":"agreement, group, 21 December 2018"}
{"_id":"q1a72443a","title":"","text":"Capital Expenditure, R&D, Innovation, FY 2018, FY 2019, Consolidated, Change"}
{"_id":"q1a73db4c","title":"","text":"restated values, 2018, financial reporting, accounting adjustments, revenue recognition, impairment losses, tax adjustments, company disclosures, financial restatement"}
{"_id":"q1a72bbcc","title":"","text":"cost of revenues, decrease, financial analysis, fiscal year, profit margins, expense reduction, company performance, quarterly report, earnings call"}
{"_id":"q1a7204de","title":"","text":"cash flows from financing activities, percentage change, 2018, 2019"}
{"_id":"q1a71a228","title":"","text":"average annual operating income, 2018, 2019"}
{"_id":"q1a740356","title":"","text":"prepayments, balance sheet, current assets, accounting, financial reporting, deferred expenses, cash flow, accrual accounting"}
{"_id":"q1a7418d2","title":"","text":"retail IPTV, net subscriber activations, 2019, market trends, competition, consumer preferences, technology advancements, pricing strategies, service providers, subscriber growth, churn rate, content offerings, regulatory changes"}
{"_id":"q1a722982","title":"","text":"expenses, facilities, fiscal year, 2017, 2019"}
{"_id":"q1a73375a","title":"","text":"purchase obligations, total payment due, 2023-2024, percentage, company value"}
{"_id":"q1a731068","title":"","text":"pre-tax loss, 2018, 2019, percentage change"}
{"_id":"q1a722e96","title":"","text":"FY18, significant expense, operating expenses, research and development, marketing expenses, personnel costs, company financials, budget allocation, fiscal year 2018."}
{"_id":"q1a73a9f6","title":"","text":"RSUs, outstanding RSUs, September 2019"}
{"_id":"q1a7305b4","title":"","text":"depreciation expense, exceed, $2,000 thousand, years"}
{"_id":"q1a7202ae","title":"","text":"Other, FY2019, FY2018, change, financial analysis"}
{"_id":"q1a720222","title":"","text":"non-current assets, segment reporting, financial reporting, tangible assets, intangible assets, property, plant and equipment, goodwill, investments, deferred tax assets, segments, IFRS, GAAP"}
{"_id":"q1a7403d8","title":"","text":"Prepaid maintenance, services, financial analysis, revenue growth, 2023, 2022, financial performance, service contracts, company earnings."}
{"_id":"q1a71cf1e","title":"","text":"cash paid for income taxes, exceed, $150 million, years"}
{"_id":"q1a71bf56","title":"","text":"accounts receivable, Customer A, 2019"}
{"_id":"q1a723de6","title":"","text":"cash flow from operating activities, 2019, increase"}
{"_id":"q1a72f01a","title":"","text":"Weighted average number of shares, basic, 2018"}
{"_id":"q1a73120c","title":"","text":"long-term prepaid ground rent, decrease, financial analysis, real estate, market trends, interest rates, investment returns, property valuation, lease agreements, amortization, cash flow, economic conditions, regulatory changes, 2023"}
{"_id":"q1a7245f2","title":"","text":"legal costs, professional fees, transaction costs, compliance costs, due diligence expenses, consulting fees, litigation expenses, regulatory fees, accounting costs, tax advisory fees, merger costs, acquisition costs, operational costs, financial advisory fees, legal retainers, contract negotiation costs, audit fees, investment banking fees, underwriting costs, closing costs, escrow fees, appraisal costs, insurance premiums, risk management costs, legal settlements, arbitration costs, service provider fees, engagement costs, project management fees, contingency costs."}
{"_id":"q1a726ca8","title":"","text":"amortization expense, accumulated amortization, fiscal year 2019"}
{"_id":"q1a71e698","title":"","text":"interest income, percentage change, 2018, 2019"}
{"_id":"q1a73051e","title":"","text":"N\/A"}
{"_id":"q1a7330ac","title":"","text":"risk-free interest rate, Treasury bonds, government securities, yield curve, inflation rate, nominal interest rate, real interest rate, Federal Reserve, market expectations, financial instruments, investment horizon, credit risk, term structure, economic indicators, interest rate swaps, duration, maturity, benchmark rates, LIBOR, SOFR."}
{"_id":"q1a73f6ea","title":"","text":"Property, plant and equipment, financial reporting, asset valuation, depreciation, capital expenditure, balance sheet, fiscal year, investment, accounting standards."}
{"_id":"q1a734cc2","title":"","text":"tax rate, stabilize, medium-term, fiscal policy, government revenue, economic growth, inflation, budget deficit, tax reform, public spending, economic indicators, monetary policy, tax brackets, corporate tax, individual tax, 2023, 2024, economic forecasts, tax compliance, revenue generation"}
{"_id":"q1a72fb32","title":"","text":"interest income, year, financial analysis, revenue, earnings report, fiscal year, interest rates, financial performance"}
{"_id":"q1a725c04","title":"","text":"VAS revenues, percentage increase, fourth quarter, 2018, 2019"}
{"_id":"q1a730b7c","title":"","text":"vehicles value, 2018, 2019, company, financial analysis"}
{"_id":"q1a7314b4","title":"","text":"Operating income, December 31, 2019, December 31, 2018, average, financial analysis, income statement, fiscal year, revenue, expenses, profitability."}
{"_id":"q1a730bd6","title":"","text":"percentage change, land value, September 2018, September 2019, company"}
{"_id":"q1a712230","title":"","text":"Weighted average number of shares, dilutive effect, share options, 2018, 2019"}
{"_id":"q1a728b02","title":"","text":"company, groups, products, services, years, financial data"}
{"_id":"q1a738ed0","title":"","text":"Current Federal provision, income tax, 2019, tax brackets, IRS, tax rates, deductions, credits, tax reform, corporate tax rate, individual tax rate, Tax Cuts and Jobs Act, 2017."}
{"_id":"q1a73e31c","title":"","text":"intersegment revenues, financial reporting, company divisions, revenue recognition, internal transactions, consolidation, financial performance, accounting standards, transfer pricing, segment reporting"}
{"_id":"q1a72c662","title":"","text":"Federal statutory tax expense, 2018, corporate tax rate, tax reform, Tax Cuts and Jobs Act, IRS, taxable income, effective tax rate, financial reporting, compliance."}
{"_id":"q1a71e0da","title":"","text":"net cash provided by operating activities, 2017, 2018, 2019, financial analysis, cash flow, operating cash flow"}
{"_id":"q1a738930","title":"","text":"average balance, 2017, 2018, 2019, financial analysis, period comparison"}
{"_id":"q1a7149b8","title":"","text":"furniture, fixtures, equipment, exceed, $10 million, years"}
{"_id":"q1a72de72","title":"","text":"contractual obligations, total payments, $500,000, financial analysis, liabilities, obligations, due payments"}
{"_id":"q1a724188","title":"","text":"28 nanometers, increase, decrease, 2018, 2019"}
{"_id":"q1a72e174","title":"","text":"Canada, revenue, 2019, total revenue, percentage"}
{"_id":"q1a71e378","title":"","text":"high price per share, first quarter, 2019"}
{"_id":"q1a713162","title":"","text":"Jabil Inc., basic earnings per share, May 2019, August 2019, stockholders, financial performance, earnings report."}
{"_id":"q1a740e50","title":"","text":"service cost, increase, decrease, 2018, 2019"}
{"_id":"q1a734a88","title":"","text":"net revenue, fiscal 2018, fiscal 2017, average, financial analysis"}
{"_id":"q1a73df0c","title":"","text":"Gross profit, 2019, 2018, financial analysis, year-over-year comparison, revenue, cost of goods sold, profitability, financial metrics."}
{"_id":"q1a7373be","title":"","text":"average share capital, 2 years, financial analysis, equity, capital structure"}
{"_id":"q1a731662","title":"","text":"Keywords: financial data, revenue, expenses, profit, balance sheet, income statement, cash flow, fiscal year, company performance, financial metrics"}
{"_id":"q1a71ebca","title":"","text":"agreement, 28 June 2019, financial terms, companies, contract, negotiation, outcome, compliance, obligations, stakeholders"}
{"_id":"q1a72b924","title":"","text":"Columbian Credit Facility, carrying value, USD, 2019"}
{"_id":"q1a728daa","title":"","text":"Silver, average prices, year, 2023, 2022, market trends, commodities, investment, precious metals."}
{"_id":"q1a71f1ce","title":"","text":"AMER, operating income, increase, 2018, 2019"}
{"_id":"q1a74117a","title":"","text":"Barry Litwin, Robert Dooley, 2019 plan, target amount, percentage"}
{"_id":"q1a73c148","title":"","text":"income tax expense, 2019, corporate tax rate, tax reform, Tax Cuts and Jobs Act, deferred tax liabilities, taxable income, effective tax rate, IRS regulations, financial performance, earnings before tax, tax deductions, tax credits, compliance costs"}
{"_id":"q1a73df66","title":"","text":"net loss, 2016"}
{"_id":"q1a72372e","title":"","text":"Interest expense, net of interest income, 2018, 2019, increase, decrease, financial analysis, interest rates, company performance, fiscal year, earnings report."}
{"_id":"q1a717bf4","title":"","text":"equipment notes payable, financial analysis, year comparison, liabilities, balance sheet, debt obligations"}
{"_id":"q1a732bac","title":"","text":"noncurrent assets, capital expenditures, acquisitions, investments, depreciation, asset revaluation, mergers, financial reporting, balance sheet, fiscal year 2023, company growth, asset management, cash flow, strategic investments"}
{"_id":"q1a731b58","title":"","text":"common shares, roll forward, outstanding shares, financial years, equity, share capital, stock issuance, buybacks, dividends, company performance"}
{"_id":"q1a72c716","title":"","text":"Valuation allowance, 2019, 2018, percentage change, financial analysis, tax assets, deferred tax, accounting standards."}
{"_id":"q1a71d19e","title":"","text":"public offerings, August 26, 2019, IPO, stock market, companies, financial markets"}
{"_id":"q1a741328","title":"","text":"Machinery and equipment, 2018"}
{"_id":"q1a7173e8","title":"","text":"total assets, 2018"}
{"_id":"q1a721582","title":"","text":"revenue, percentage change, 2018, 2019"}
{"_id":"q1a720d3a","title":"","text":"net deferred taxes, 2018, 2019"}
{"_id":"q1a738444","title":"","text":"voyage expenses, voyage revenue, 2019, percentage"}
{"_id":"q1a725c86","title":"","text":"VAS revenue, fourth quarter, 2018, 2019, costs, change, financial analysis, revenue comparison."}
{"_id":"q1a741b7a","title":"","text":"Raw materials, supplies, 2019, 2018, change, inventory, cost of goods sold, financial analysis, manufacturing, supply chain management."}
{"_id":"q1a726744","title":"","text":"customers, period end, chronological order"}
{"_id":"q1a72f25e","title":"","text":"restructuring reserves, financial years, accounting periods, 2023, 2022, 2021, 2020, 2019"}
{"_id":"q1a72489a","title":"","text":"Black-Scholes, option valuation, assumptions, European options, no dividends, constant volatility, risk-free rate, efficient markets, lognormal distribution, no arbitrage, continuous trading, time to expiration."}
{"_id":"q1a73f956","title":"","text":"service revenue, increase, financial performance, revenue growth, company earnings, market demand, pricing strategy, customer acquisition, fiscal year, quarterly results"}
{"_id":"q1a72bece","title":"","text":"sales and marketing expense, 2017, 2018"}
{"_id":"q1a73d908","title":"","text":"Tax fees, 2018, 2019, percentage increase, decrease"}
{"_id":"q1a71a476","title":"","text":"segment operating income, net sales, percentage change, 2017, 2018"}
{"_id":"q1a733994","title":"","text":"Healthcare, Life Sciences, total revenue, segment, financial performance, fiscal year, earnings report, company name, quarterly results, market analysis."}
{"_id":"q1a735b22","title":"","text":"total number of shares, fiscal year 2018, fiscal year 2019, change in shares, stock purchase, equity, financial analysis"}
{"_id":"q1a71d25c","title":"","text":"average total debt, 2018, 2019"}
{"_id":"q1a71b1a0","title":"","text":"profit margin, fourth quarter, 2019"}
{"_id":"q1a72a54c","title":"","text":"Property and equipment, net, 2018, 2017, change, financial analysis, asset valuation"}
{"_id":"q1a7160b0","title":"","text":"net sales, fiscal year 2019, fiscal year 2018"}
{"_id":"q1a728864","title":"","text":"cable revenue, 2018, subscription growth, advertising revenue, Comcast, Charter Communications, AT&T, content investment, broadband services, customer retention, market competition"}
{"_id":"q1a71686c","title":"","text":"gross federal net operating loss, 2019"}
{"_id":"q1a716894","title":"","text":"Federal net operating losses, foreign net operating losses, tax credits, 2019, 2018, IRS, tax regulations, carryforward, carryback, tax liability, financial reporting."}
{"_id":"q1a721a8c","title":"","text":"total revenue, network solutions, services & support, financial analysis, revenue comparison, fiscal year, earnings report, company performance"}
{"_id":"q1a728fe4","title":"","text":"Accumulated depreciation, amortization, 2019, financial reporting, asset valuation, depreciation expense, amortization expense, balance sheet, accounting standards, GAAP, IFRS."}
{"_id":"q1a732a12","title":"","text":"percentage constitution, prior year special, total dividends paid, 2019"}
{"_id":"q1a738ba6","title":"","text":"income tax benefit, 2019, tax policy, IRS, corporate tax rate, deductions, credits, tax reform, revenue, fiscal year"}
{"_id":"q1a724dcc","title":"","text":"operating activities, increase, decrease, 2018, 2019"}
{"_id":"q1a7408ba","title":"","text":"company's financial covenants, 2019"}
{"_id":"q1a72d670","title":"","text":"average maintenance revenue, 2018, 2019"}
{"_id":"q1a7189d2","title":"","text":"Accrued expenses, 2018, 2019, financial analysis, year-over-year change, accounting, liabilities, financial reporting."}
{"_id":"q1a727a4a","title":"","text":"Revenue, 2017"}
{"_id":"q1a73e650","title":"","text":"Other financial income, percentage change, 2018, 2019, 2017, financial analysis, income statement, year-over-year comparison."}
{"_id":"q1a724dfe","title":"","text":"investing activities, 2018, 2019, average, financial analysis, capital expenditures, investment portfolio, cash flow, asset acquisition, market trends"}
{"_id":"q1a73bc02","title":"","text":"non-current assets, financial reporting, accounting standards, balance sheet, fiscal year, asset classification, depreciation, amortization, 2023, 2022, 2021, 2020, 2019"}
{"_id":"q1a712172","title":"","text":"RSUs, diluted earnings per share, 2018, 2017, stock-based compensation, equity awards, financial reporting, GAAP, non-GAAP measures, share dilution, earnings per share calculation, company policy, accounting standards."}
{"_id":"q1a731f40","title":"","text":"Cost of Customer Support Revenues, Fiscal Year 2019, $0.4 million, miscellaneous costs"}
{"_id":"q1a717b72","title":"","text":"equipment notes payable, percentage change, 2018, 2019"}
{"_id":"q1a728832","title":"","text":"Wireless revenue, 2018, growth drivers, market demand, 5G technology, Verizon, AT&T, T-Mobile, customer acquisition, service plans, data usage, competition, investment, infrastructure, mobile devices, promotions, subscriber growth."}
{"_id":"q1a741954","title":"","text":"Satellite subscribers, retail subscribers, 2019"}
{"_id":"q1a7366da","title":"","text":"revenue, 2019"}
{"_id":"q1a720d12","title":"","text":"valuation allowance, increase, 2018, 2019"}
{"_id":"q1a71a5e8","title":"","text":"accounts receivable, financial years, 2023, 2022, 2021, 2020, 2019"}
{"_id":"q1a71e346","title":"","text":"fiscal year, price range, common stock, share price, financial data"}
{"_id":"q1a71cc30","title":"","text":"Cost of living indexation, post-employment benefit obligations, percentage change, financial reporting, actuarial assumptions, inflation rate, pension liabilities, employee benefits, accounting standards, FASB, IASB, 2023."}
{"_id":"q1a717988","title":"","text":"related party revenues, percentage change, 2018, 2019"}
{"_id":"q1a71e9e0","title":"","text":"Property and equipment, net, South Africa, Year Ending March 31, 2018, Year Ending March 31, 2019, change"}
{"_id":"q1a736266","title":"","text":"shares, June 30, 2018, June 30, 2019"}
{"_id":"q1a736b6c","title":"","text":"Keywords: financial data, revenue, expenses, profit, balance sheet, income statement, cash flow, fiscal year, company performance, financial ratios."}
{"_id":"q1a73dbb0","title":"","text":"Operating profit, companies, financial performance, year comparison, profitability analysis"}
{"_id":"q1a71d766","title":"","text":"company, developed technology, 2018, 2019, spending, financial comparison"}
{"_id":"q1a722b6c","title":"","text":"Cost of net revenue, average, Years Ended December 31, 2019, 2018"}
{"_id":"q1a72b3c0","title":"","text":"government grants, trade payables, value at 1 January, value at 31 December, financial variables, accounting period, recognition criteria, deferred income, amortization, eligibility criteria, compliance, reporting standards, cash flow impact, fiscal year-end, government assistance, financial liabilities, revenue recognition, grant conditions, adjustments, financial reporting."}
{"_id":"q1a72b1f4","title":"","text":"Webzone, 2019, 2018, financial performance, revenue growth, profit margin, market share, investment, valuation, earnings report."}
{"_id":"q1a7255c4","title":"","text":"capitalized interest, 2018, 2019"}
{"_id":"q1a73190a","title":"","text":"product sales, segments, revenue, market share, consumer goods, B2B, B2C, retail, wholesale, e-commerce, direct sales, distribution channels, sales volume, pricing strategy, target market, sales growth, product categories, geographic segmentation, demographic segmentation, industry analysis"}
{"_id":"q1a71d4a0","title":"","text":"Other comprehensive loss, reclassifications, 2017, financial reporting, accounting standards, comprehensive income, net loss, equity, financial performance."}
{"_id":"q1a72accc","title":"","text":"Sales, unaffiliated customers, financial years, revenue, fiscal year, 2021, 2022, 2023."}
{"_id":"q1a72e2fa","title":"","text":"Restricted Share Awards, RSAs, fiscal year 2019, fiscal year 2018, fiscal year 2017, compensation, equity awards, stock-based compensation, company performance, vesting schedule."}
{"_id":"q1a71746a","title":"","text":"Corporate, eliminations, total assets, percentage change, 2018, 2019"}
{"_id":"q1a73550a","title":"","text":"financial data, five years, December 31, 2019, derived, sources, financial reports, annual reports, SEC filings, company disclosures"}
{"_id":"q1a7391aa","title":"","text":"accumulated benefit obligation, foreign defined benefit pension plans, 2019, 2018, change"}
{"_id":"q1a73df34","title":"","text":"revenue, 500,000 thousands, financial analysis, fiscal year, earnings report, company performance, historical data, revenue trends"}
{"_id":"q1a711e7a","title":"","text":"capital expenditures, wireless, telecommunications, infrastructure investment, 5G deployment, AT&T, Verizon, T-Mobile, technology upgrades, market competition, 2023, network expansion, operational efficiency, shareholder value, return on investment"}
{"_id":"q1a734812","title":"","text":"general and administrative expenses, 2017, 2018, average, financial analysis"}
{"_id":"q1a738692","title":"","text":"software, 2019, market value, revenue, industry growth, companies, technology sector"}
{"_id":"q1a737c6a","title":"","text":"Direct sales, contract manufacturers, consignment warehouses, 2019, 2018, 2017, percentage"}
{"_id":"q1a737d50","title":"","text":"Avnet Logistics, average revenue, 2017, 2018, 2019"}
{"_id":"q1a71cc58","title":"","text":"life expectancy, post-employment benefit obligations, 2019, percentage change"}
{"_id":"q1a71d798","title":"","text":"Oracle, intangible assets, amortization, financial notes, investors, disclosures, fiscal year, 2023, SEC filings."}
{"_id":"q1a74197c","title":"","text":"IPTV, retail subscribers, 2019, percentage, market share, telecommunications, subscriber growth, revenue, digital services."}
{"_id":"q1a71762c","title":"","text":"revenue recognition, accounting standards, ASC 606, IFRS 15, performance obligations, contract, transfer of control, timing, financial reporting, revenue streams, companies, transactions, recognition criteria, date of sale, delivery, services rendered"}
{"_id":"q1a720420","title":"","text":"lower cash flow, operating activities, 2019, 2018, financial performance, revenue decline, operating expenses, working capital changes, economic conditions, company analysis"}
{"_id":"q1a71f480","title":"","text":"Net Sales, Fiscal Year, April 28, 2018, April 29, 2017, average, financial analysis"}
{"_id":"q1a73c986","title":"","text":"cash remuneration, Board of Directors, fiscal year, June 30, 2017, June 30, 2018, June 30, 2019"}
{"_id":"q1a73d084","title":"","text":"cash and cash equivalents, 2019"}
{"_id":"q1a7405e0","title":"","text":"inventory purchase, accounts payable, purchase order, supplier, cost of goods sold, inventory valuation, cash flow, procurement, inventory management, financial analysis"}
{"_id":"q1a720a42","title":"","text":"Nonvested shares, RSUs, December 31, 2018, December 31, 2019, average, equity compensation, stock-based compensation, vesting schedule."}
{"_id":"q1a727306","title":"","text":"money market funds, fair value, June 30, 2018"}
{"_id":"q1a72c694","title":"","text":"U.S. Federal statutory rate, tax rates, 2017, 2018, 2019, 2020, 2021, 2022, 2023"}
{"_id":"q1a737efe","title":"","text":"Other, financial terms, companies, person names, dates"}
{"_id":"q1a72a9ac","title":"","text":"Loss from discontinued operations, 2019, financial reporting, accounting standards, impairment charges, restructuring costs, company financials, earnings report."}
{"_id":"q1a727d7e","title":"","text":"Products and Licensing revenue, 25,000,000, year, financial analysis, revenue trends."}
{"_id":"q1a716b96","title":"","text":"Effective tax rate, 2019, 2018"}
{"_id":"q1a72de9a","title":"","text":"operating lease obligations, capital lease obligations, financial reporting, lease accounting, ASC 842, IFRS 16, balance sheet, liabilities, cash flow, lease classification, depreciation, interest expense, lease term, lessee, lessor, financial analysis, lease payments, asset valuation, financial metrics"}
{"_id":"q1a714530","title":"","text":"Accruals, percentage change, financial analysis, accounting, revenue recognition, expense recognition, financial reporting, cash flow, balance sheet, income statement."}
{"_id":"q1a71f8d6","title":"","text":"principal amount, 2019"}
{"_id":"q1a71cba4","title":"","text":"weighted average duration, post-employment benefit obligation, actuarial assumptions, discount rate, pension liabilities, financial reporting, employee benefits, liability management, cash flow projections, pension plans"}
{"_id":"q1a712d7a","title":"","text":"EAIP, FY19, payout, financial compensation, employee compensation, performance metrics, company policy"}
{"_id":"q1a734fa6","title":"","text":"risk-free interest rate, 2018, financial markets, Treasury bonds, Federal Reserve, yield curve"}
{"_id":"q1a71a1f6","title":"","text":"Adjusted EBITDA, 2018, 2019, financial performance, year-over-year, earnings, company analysis, profitability, financial metrics"}
{"_id":"q1a736932","title":"","text":"deferred tax assets, 2018, 2019, financial reporting, tax liabilities, accounting standards, balance sheet, tax regulations"}
{"_id":"q1a7279b4","title":"","text":"revenue growth rate, 2019, financial performance, earnings report, fiscal year, company analysis"}
{"_id":"q1a7379f4","title":"","text":"operating expenses, salaries, rent, utilities, depreciation, marketing, insurance, office supplies, maintenance, research and development, travel expenses, professional fees, administrative costs, payroll taxes, employee benefits"}
{"_id":"q1a72b5dc","title":"","text":"shares of common stock, granted, vested, years, financial reporting, equity compensation, stock options, vesting schedule, common stock, financial disclosures"}
{"_id":"q1a73058c","title":"","text":"amortization expense, 2019"}
{"_id":"q1a72c05e","title":"","text":"net cash provided by operating activities, decrease, cash flow, operating income, working capital, accounts receivable, inventory, accounts payable, depreciation, amortization, financial performance, fiscal year, earnings report, cash management, liquidity, operating expenses, revenue recognition, tax liabilities, interest expenses."}
{"_id":"q1a739d12","title":"","text":"Total short-term lines of credit, 2019."}
{"_id":"q1a729ffc","title":"","text":"Bell, new subscribers, growth services, retail Internet, IPTV, wireless, 2023"}
{"_id":"q1a717956","title":"","text":"data and analytic services, 2017, 2019, market growth, revenue increase, analytics companies, data-driven decision making, investment trends, technology adoption, financial performance, industry analysis"}
{"_id":"q1a7323dc","title":"","text":"shipping revenues, supply chain disruptions, global trade, fuel prices, container shipping companies, demand fluctuations, economic downturn, port congestion, shipping rates, 2023, Maersk, Hapag-Lloyd, ZIM Integrated Shipping Services, pandemic impact, inflation, labor shortages, geopolitical tensions"}
{"_id":"q1a725e48","title":"","text":"operating accruals, 2018, 2019"}
{"_id":"q1a71de96","title":"","text":"Purchased parts and assemblies, financial analysis, year comparison, cost of goods sold, supply chain management, inventory valuation, manufacturing expenses."}
{"_id":"q1a7146ac","title":"","text":"foreign pretax income, 2018"}
{"_id":"q1a727338","title":"","text":"money market funds, fair value, 2018, 2019, total assets, financial analysis"}
{"_id":"q1a730924","title":"","text":"FinTech, Business Services, revenue, year-on-year change, 2023, financial performance, growth rate, market analysis, investment trends."}
{"_id":"q1a712a14","title":"","text":"fair value, financial instruments, active markets, valuation techniques, market participants, discounted cash flows, comparable transactions, pricing models, inputs, assumptions, liquidity risk, credit risk, market risk, IFRS 13, ASC 820, non-active markets, valuation hierarchy, observable inputs, unobservable inputs, financial reporting, risk-adjusted return, valuation adjustments."}
{"_id":"q1a7258ee","title":"","text":"BTL, losses, financial performance, operational costs, asset impairment, market conditions, revenue decline, expense management, fiscal year 2023, investment write-downs."}
{"_id":"q1a717bcc","title":"","text":"loan, acquisition, excavator, outstanding, percentage"}
{"_id":"q1a72f736","title":"","text":"Americas, Asia Pacific, revenue, 2019"}
{"_id":"q1a73d8d6","title":"","text":"Audit-related Fees, Average, Financial Audit, Compliance Audit, External Audit, Internal Audit, Public Companies, SEC, Audit Committee, 2023, Big Four, Deloitte, PwC, EY, KPMG, Audit Engagement, Sarbanes-Oxley Act, Audit Quality, Risk Assessment."}
{"_id":"q1a7215dc","title":"","text":"long-term deferred revenue, percentage change, 2018, 2019"}
{"_id":"q1a7137b6","title":"","text":"operating lease obligations, Other purchase obligations, commitments, financial analysis, liabilities, accounting standards, ASC 842, IFRS 16, balance sheet, cash flow, financial reporting"}
{"_id":"q1a726fc8","title":"","text":"total debt obligations, financial analysis, liabilities, balance sheet, corporate debt, debt-to-equity ratio, interest expense, maturity schedule, credit rating, company financials"}
{"_id":"q1a73f6b8","title":"","text":"Building, building improvements, 2018, construction, real estate, investment, capital expenditures, property development, renovation, infrastructure, market trends."}
{"_id":"q1a722b9e","title":"","text":"net revenue, cost of net revenue, average percentage, December 31, 2019, December 31, 2018"}
{"_id":"q1a7157e6","title":"","text":"income taxes payable, 2018, 2019, change, financial analysis"}
{"_id":"q1a7386ec","title":"","text":"property and equipment, 2018, top 3, financial analysis, asset valuation"}
{"_id":"q1a737fee","title":"","text":"accrued expenses, payables, liabilities, interest payable, wages payable, taxes payable, utilities payable, financial reporting, accounting standards, balance sheet"}
{"_id":"q1a729354","title":"","text":"processed chicken, salable, poultry industry, food processing, supply chain, market demand, retail distribution, consumer preferences"}
{"_id":"q1a732198","title":"","text":"excluded potential common shares, 2019, financial analysis, diluted earnings per share, convertible securities, stock options, warrants, financial reporting, equity instruments"}
{"_id":"q1a728be8","title":"","text":"total product revenue, percentage change, 2018, 2019"}
{"_id":"q1a73e600","title":"","text":"Other financial income, financial performance, year comparison, revenue growth, financial metrics, income statement analysis."}
{"_id":"q1a71415c","title":"","text":"Golar Partners, net earnings, share, year, financial performance, earnings report"}
{"_id":"q1a735f28","title":"","text":"DRAM, NAND, revenue increase, 2017, 2018, demand, supply constraints, technology advancements, Samsung, SK Hynix, Micron Technology, market growth, pricing power, data centers, mobile devices, consumer electronics."}
{"_id":"q1a738f2a","title":"","text":"foreign provision for income tax, $40 million, years, financial analysis"}
{"_id":"q1a73a546","title":"","text":"exercisable shares, 2019, 2018"}
{"_id":"q1a72967e","title":"","text":"Total loans due from subsidiaries, financial analysis, subsidiaries, fiscal year comparison, financial reporting, corporate finance, intercompany loans, balance sheet, financial year 2022, financial year 2023."}
{"_id":"q1a717b9a","title":"","text":"loans payable, percentage change, 2018, 2019, financial analysis"}
{"_id":"q1a724ab6","title":"","text":"deferred income, liabilities, revenue recognition, accounting, financial reporting, Group, balance sheet, income statement"}
{"_id":"q1a735f78","title":"","text":"gross margin, percentage change, 2018, 2019"}
{"_id":"q1a72a24a","title":"","text":"company, primary business, financial services, investment banking, asset management, mergers and acquisitions, private equity, venture capital, corporate finance, revenue streams, market analysis, financial advisory, risk management, equity research, trading, underwriting, financial modeling, valuation, capital markets, client portfolio, fiscal year, earnings report, shareholder value, dividend policy, financial performance."}
{"_id":"q1a72c2ca","title":"","text":"carrying value, long term debt, amortized cost, market value, financial reporting"}
{"_id":"q1a73c954","title":"","text":"key management personnel, Group, financial management, executive team, leadership, corporate governance"}
{"_id":"q1a73d886","title":"","text":"audit approval, non-audit services, Ernst & Young, audit committee, corporate governance, financial oversight, regulatory compliance"}
{"_id":"q1a73b374","title":"","text":"shares granted, 2018, equity compensation, stock options, employee stock ownership, share-based payments"}
{"_id":"q1a7406bc","title":"","text":"Accounts Payable, Supplier A, 2018, 2019, percentage change"}
{"_id":"q1a72b60e","title":"","text":"Weighted average grant-date fair value, common stock, smallest, year, financial analysis, stock options, equity compensation, valuation, financial reporting."}
{"_id":"q1a72ce82","title":"","text":"prepaid expenses, 2019, accounting, financial reporting, asset management"}
{"_id":"q1a73ef92","title":"","text":"Expected volatility, 2018, 2017"}
{"_id":"q1a71f9bc","title":"","text":"effective interest rate, liability component, financial analysis, interest expense, amortization, bond issuance, market rate, discount rate, financial instruments, accounting standards"}
{"_id":"q1a711740","title":"","text":"R&D expenses, sales and marketing expenses, G&A expenses, financial analysis, fiscal year, budget allocation, expense trends, company performance, investment strategy, cost management."}
{"_id":"q1a724160","title":"","text":"14 nanometers, semiconductor technology, 2017, market share, percentage, Intel, TSMC, semiconductor industry, technology nodes."}
{"_id":"q1a721230","title":"","text":"restructuring costs, 2018, 2019, cost reduction, operational efficiency, company restructuring, financial performance, expense management, corporate strategy, workforce optimization"}
{"_id":"q1a721c9e","title":"","text":"cash and cash equivalents, December 31, 2019, jurisdictions, U.S."}
{"_id":"q1a737f30","title":"","text":"Keywords: financial data, revenue, expenses, profit, balance sheet, income statement, cash flow, fiscal year, company performance, financial ratios."}
{"_id":"q1a735af0","title":"","text":"Lifeway, share repurchase program, expiration date, financial strategy, stock buyback, corporate finance, market capitalization."}
{"_id":"q1a738f02","title":"","text":"Current State provision, income tax, 2017"}
{"_id":"q1a71f232","title":"","text":"operating income, reportable segment, financial year, segment reporting, fiscal year, revenue, profit margin, 2021, 2022, 2023"}
{"_id":"q1a71ba74","title":"","text":"restructuring expenses, 2019, 2018, financial analysis, cost reduction, corporate restructuring, fiscal year, financial reporting"}
{"_id":"q1a72fad8","title":"","text":"bond repurchases, premium, loss, 2019"}
{"_id":"q1a7282d8","title":"","text":"amortization, purchased intangible assets, financial reporting, fiscal years, accounting standards, intangible assets, depreciation, financial analysis, asset valuation"}
{"_id":"q1a718914","title":"","text":"trade payables, payment terms, accounts payable, cash flow management, supplier agreements, due dates, financial obligations, working capital, credit terms, invoice processing"}
{"_id":"q1a71d9f0","title":"","text":"personnel expenses, 2018, 2019, 2017, change, financial analysis"}
{"_id":"q1a731978","title":"","text":"percentage change, total product sales, 2018, 2019"}
{"_id":"q1a736ef0","title":"","text":"Early debt extinguishment costs, 2018, 2019, financial analysis, debt management, cost comparison, fiscal year, financial reporting."}
{"_id":"q1a732666","title":"","text":"United States, sales, percentage change, 2018, 2019"}
{"_id":"q1a71efda","title":"","text":"Accrued expenses, 2018, 2019, average, financial analysis, accounting, liabilities, balance sheet, company financials"}
{"_id":"q1a73574e","title":"","text":"return on assets, 2017, company, financial performance"}
{"_id":"q1a72af38","title":"","text":"accruals, liabilities, financial reporting, adjustments, accounting standards, revenue recognition, expense matching, financial statements, GAAP, IFRS, company audits, fiscal year, financial performance, cash flow, provisions, estimates, management decisions, compliance, risk assessment, financial analysis"}
{"_id":"q1a736676","title":"","text":"net liabilities, 2019"}
{"_id":"q1a7333fe","title":"","text":"accounts receivable, 2019, 2018"}
{"_id":"q1a7347b8","title":"","text":"general and administrative expenses, 2019, financial analysis, operating expenses, company financials"}
{"_id":"q1a728b8e","title":"","text":"total products and services, 2017, 2018, change, financial analysis"}
{"_id":"q1a7204b6","title":"","text":"cash flows from operating activities, percentage change, 2018, 2019"}
{"_id":"q1a7308f2","title":"","text":"VAS Business, year-on-year change, revenue, financial performance, fiscal year, growth rate, company earnings, revenue analysis."}
{"_id":"q1a73feba","title":"","text":"ROFE, F18, F19, increase, financial metrics, normalized basis"}
{"_id":"q1a729dea","title":"","text":"transaction-based cost, year, financial analysis, cost reduction, expense management"}
{"_id":"q1a72b636","title":"","text":"Fair value, common stock, vested, 2019, 2018, change"}
{"_id":"q1a7401c6","title":"","text":"active users, 2018, 2019, change, growth, user acquisition, metrics"}
{"_id":"q1a73292c","title":"","text":"dividends, franked, tax rate, Australia, corporate tax, imputation system, 30%, shareholders, tax credits"}
{"_id":"q1a735226","title":"","text":"Shares issued, ESPP, $2 million, years, financial analysis"}
{"_id":"q1a73d5e8","title":"","text":"Shares issued, February 2018, company, stock issuance, equity financing, capital raise, public offering, private placement, share capital, market capitalization."}
{"_id":"q1a741922","title":"","text":"IPTV, retail subscribers, 2019, market growth, subscriber increase, telecommunications, revenue, industry analysis."}
{"_id":"q1a7403b0","title":"","text":"total prepayments, components, financial analysis, accounting, balance sheet, current assets, deferred expenses, prepaid insurance, prepaid rent, prepaid taxes, company financials, fiscal year, accounting period"}
{"_id":"q1a7370d0","title":"","text":"UK, revenue, financial year, 2023, 2022, economic growth, GDP, fiscal policy"}
{"_id":"q1a71909e","title":"","text":"statutory rate, 2018, 2019, change, amount, financial analysis"}
{"_id":"q1a72e714","title":"","text":"amortization, intangible assets, 2019, financial reporting, accounting standards, acquisition, goodwill, impairment, valuation, company performance"}
{"_id":"q1a738f52","title":"","text":"current provision for income tax, 2017, 2018, financial analysis, tax liability, fiscal year, accounting period"}
{"_id":"q1a71418e","title":"","text":"Golar Partners, ownership interest, change, Golar LNG, financial restructuring, equity stake, investment, partnership, 2023."}
{"_id":"q1a722e64","title":"","text":"finance costs, percentage change, 2018, 2019"}
{"_id":"q1a719ce2","title":"","text":"non-cash changes, depreciation, amortization, stock-based compensation, deferred taxes, impairment losses, foreign exchange adjustments, changes in working capital, financial reporting, accounting standards"}
{"_id":"q1a71276c","title":"","text":"2019, actual group cash generation, target group cash generation, financial performance, cash flow analysis"}
{"_id":"q1a7366a8","title":"","text":"net liabilities, 2018"}
{"_id":"q1a717d70","title":"","text":"employee expenditure, payroll, benefits, bonuses, taxes, compensation, labor costs, company expenses, financial reporting, fiscal year"}
{"_id":"q1a7345b0","title":"","text":"Projected benefit obligation, 2018, 2019, pension plans, actuarial assumptions, discount rate, service cost, interest cost, benefit payments, financial reporting, liabilities, GAAP, FASB, pension expense."}
{"_id":"q1a73224c","title":"","text":"percentage increase, earnings, participating securities, 2018, 2019"}
{"_id":"q1a72e7c8","title":"","text":"ASTRO Acquisition, 2023"}
{"_id":"q1a729d68","title":"","text":"adjusted revenue, revenue recognition, non-recurring items, discounts, returns, allowances, accounting standards, GAAP, IFRS, financial performance, revenue adjustments, fiscal year, earnings report, revenue growth, company valuation, financial analysis"}
{"_id":"q1a73f47e","title":"","text":"unrecognized tax benefits, effective income tax rate, tax years, financial reporting, tax liabilities, deferred tax assets, tax compliance, IRS regulations, tax provisions, accounting standards"}
{"_id":"q1a713b26","title":"","text":"non-GAAP, financial metrics, adjustments, stock-based compensation, restructuring charges, acquisition costs, amortization, one-time expenses, earnings, revenue, EBITDA, net income, operating income, financial analysis, investors, reporting standards."}
{"_id":"q1a73d6a6","title":"","text":"share balance, June 2018, June 2019, change, financial analysis"}
{"_id":"q1a740144","title":"","text":"community growth, user acquisition, engagement strategies, marketing campaigns, social media, partnerships, referral programs, customer retention, brand loyalty, user experience, analytics, feedback loops, demographic targeting, content marketing, influencer marketing, networking events, product development, market research, customer segmentation."}
{"_id":"q1a73fe88","title":"","text":"ROFE, F19, financial metrics, return on financial equity, fiscal year 2019, financial analysis, performance measurement"}
{"_id":"q1a72a77c","title":"","text":"trade receivables, 2018, 2019, financial analysis, accounts receivable, balance sheet, year-over-year change"}
{"_id":"q1a734a56","title":"","text":"net revenue, fiscal 2017, fiscal 2018"}
{"_id":"q1a7344f2","title":"","text":"projected benefit obligation, accumulated benefit obligation, fair value of plan assets, pension plans, financial reporting, actuarial assumptions, company name, fiscal year, 2023, 2022, 2021"}
{"_id":"q1a73eb1e","title":"","text":"Net unrealized holding gains (losses), 2018, financial reporting, investment portfolio, market valuation, accounting standards."}
{"_id":"q1a731266","title":"","text":"Other miscellaneous assets, 2018, 2019, change, financial analysis, asset valuation, balance sheet, company performance, fiscal year."}
{"_id":"q1a7124e2","title":"","text":"percentage change, balance, January 1, December 31, 2017"}
{"_id":"q1a71f2b4","title":"","text":"operating income, percentage change, 2018, 2019"}
{"_id":"q1a71a642","title":"","text":"net accounts receivable, 2019"}
{"_id":"q1a71ef80","title":"","text":"lease liability, 2018, 2019, financial reporting, accounting standards, IFRS 16, ASC 842, balance sheet, operating lease, finance lease"}
{"_id":"q1a7355a0","title":"","text":"revenues, percentage change, 2018, 2019"}
{"_id":"q1a73cbf2","title":"","text":"warranty liability, balance sheet, current liabilities, contingent liabilities, accounting standards, financial reporting"}
{"_id":"q1a7302d0","title":"","text":"total gross carrying value"}
{"_id":"q1a72a718","title":"","text":"unbilled trade receivables, 2018"}
{"_id":"q1a72a272","title":"","text":"Keywords: company, sales, products, services"}
{"_id":"q1a71bd76","title":"","text":"net periodic benefit cost, discount rate, percentage change, 2018, 2019"}
{"_id":"q1a73ed76","title":"","text":"American Tower Corporation, Basic net income, common stockholders, 2018"}
{"_id":"q1a7362c0","title":"","text":"total shares, percentage change, June 30, 2018, June 30, 2019"}
{"_id":"q1a726f64","title":"","text":"debt obligations, bonds, loans, interest payments, principal repayment, credit facilities, convertible debt, secured debt, unsecured debt, maturity dates, covenants, leverage ratio, debt-to-equity ratio, refinancing, default risk, interest rate risk, amortization schedule, financial liabilities, corporate bonds, term loans, revolving credit, subordinated debt, senior debt, debt instruments, fixed income securities."}
{"_id":"q1a7282a6","title":"","text":"amortization, purchased intangible assets, decrease, financial reporting, accounting standards, asset impairment, useful life, acquisition, goodwill, intangible asset valuation, depreciation, financial analysis, fiscal year, balance sheet, cash flow, expense recognition"}
{"_id":"q1a7171c2","title":"","text":"executive officers, average age, company, corporate governance, leadership, management team"}
{"_id":"q1a727b1c","title":"","text":"Constant currency revenue, 2018, 2019, financial performance, year-over-year growth, revenue analysis, currency fluctuations, financial metrics."}
{"_id":"q1a7401f8","title":"","text":"devices sold, percentage change, 2018, 2019"}
{"_id":"q1a712aaa","title":"","text":"level 1 FVPL, 2018 year end, 2019 year end"}
{"_id":"q1a738962","title":"","text":"% change, balance, beginning of the period, 2018, 2019"}
{"_id":"q1a732c10","title":"","text":"Noncurrent liabilities, debt issuance, long-term loans, bond issuance, lease obligations, interest rates, financial leverage, corporate financing, capital structure, amortization, maturity dates, refinancing, credit ratings, investment strategies, cash flow management."}
{"_id":"q1a716f74","title":"","text":"litigation expense, 2017, 2018, financial analysis, expense comparison"}
{"_id":"q1a72afec","title":"","text":"Accruals, other liabilities, percentage change, 2018, 2019"}
{"_id":"q1a7326c0","title":"","text":"total net sales, percentage change, 2018, 2019"}
{"_id":"q1a720510","title":"","text":"net change in cash, cash equivalents, percentage change, 2018, 2019"}
{"_id":"q1a73fbfe","title":"","text":"executive officer, FY19, company names, appointments, corporate governance"}
{"_id":"q1a74016c","title":"","text":"devices, sales, 2019"}
{"_id":"q1a71f908","title":"","text":"net carrying amount, unamortized debt issuance costs, 2018"}
{"_id":"q1a71ec4c","title":"","text":"Other intangible assets, Amortisation, 2018, 2019, financial analysis, accounting, depreciation, intangible assets, amortization expense, fiscal year, financial reporting."}
{"_id":"q1a7284b8","title":"","text":"inventories, raw materials, work-in-progress, finished goods, carrying cost, valuation, FIFO, LIFO, weighted average cost, obsolescence, shrinkage, turnover ratio, supply chain management, cost of goods sold, inventory write-down, inventory management systems"}
{"_id":"q1a72d332","title":"","text":"options outstanding, 31 March, years, financial analysis, derivatives, stock options, equity compensation"}
{"_id":"q1a72afc4","title":"","text":"Distributions payable, 2018, 2019, change, financial analysis, year-over-year comparison, accounting, liabilities, cash flow, financial reporting."}
{"_id":"q1a7390e2","title":"","text":"accumulated benefit obligation, United States, defined benefit pension plans, 2019"}
{"_id":"q1a728918","title":"","text":"media revenue, 2017, 2018, increase, decrease"}
{"_id":"q1a737d28","title":"","text":"Sanmina, revenues, 2018, 2019, financial performance, year-over-year change"}
{"_id":"q1a71e99a","title":"","text":"Property and equipment, net, United Kingdom, Year Ending March 31, 2018, Year Ending March 31, 2019, change"}
{"_id":"q1a71ffc0","title":"","text":"net profit, impairment, financial analysis, earnings, profitability, accounting, financial metrics"}
{"_id":"q1a73f690","title":"","text":"depreciation expense, property, plant and equipment, 2019"}
{"_id":"q1a71bfec","title":"","text":"revenue, customer B, percentage change, 2018, 2019"}
{"_id":"q1a725038","title":"","text":"equity incentive plans, common stock, shares, 2017, 2018, 2019"}
{"_id":"q1a72fede","title":"","text":"Other, larger, financial terms, companies, person names, dates"}
{"_id":"q1a739d9e","title":"","text":"purchase obligations, total contractual obligations, percentage, financial metrics, liabilities, accounting, obligations analysis"}
{"_id":"q1a72fe84","title":"","text":"Tax credits, 2019, IRS, Earned Income Tax Credit, Child Tax Credit, American Opportunity Tax Credit, Lifetime Learning Credit, tax policy, refundable credits, nonrefundable credits."}
{"_id":"q1a715d90","title":"","text":"goodwill, trademarks, intangible assets, investment, unconsolidated subsidiaries, total liabilities, 2018"}
{"_id":"q1a722ebe","title":"","text":"expenses, FY19, financial analysis, budget, cost management"}
{"_id":"q1a733962","title":"","text":"revenue, geographic segments, reportable segments, financial performance, company analysis"}
{"_id":"q1a724da4","title":"","text":"cash provision, 2017"}
{"_id":"q1a718978","title":"","text":"trade payables, 2019, financial analysis, liabilities, accounts payable"}
{"_id":"q1a71cef6","title":"","text":"Cash paid for interest, 2018, 2019, financial analysis, interest expense, cash flow, year-over-year comparison, financial metrics."}
{"_id":"q1a72c6bc","title":"","text":"U.S. Federal statutory rate, largest, year, 2017, corporate tax rate, Tax Cuts and Jobs Act, 21%, historical rates."}
{"_id":"q1a721884","title":"","text":"surcharge revenue, percentage change, 2018, 2019"}
{"_id":"q1a735a96","title":"","text":"Lifeway, share repurchase program, announcement, date"}
{"_id":"q1a727392","title":"","text":"long-lived assets, fair value, 2018, 2019, financial analysis, asset valuation"}
{"_id":"q1a738638","title":"","text":"depreciation expense, fiscal year 2019"}
{"_id":"q1a735546","title":"","text":"financial data, analysis, trends, ratios, benchmarks, forecasts, performance metrics, historical data, industry standards, economic indicators"}
{"_id":"q1a723b8e","title":"","text":"total income, 2017"}
{"_id":"q1a72fb8c","title":"","text":"total financial costs, percentage change, 2017, 2019"}
{"_id":"q1a72a7cc","title":"","text":"net trade receivables, percentage change, 2018, 2019"}
{"_id":"q1a72d5ee","title":"","text":"software revenue, hardware revenue, 2018, 2019"}
{"_id":"q1a733c82","title":"","text":"Tax benefit, stock compensation expense, exceed, $1,000 thousand, years"}
{"_id":"q1a7212e4","title":"","text":"accelerated depreciation, 2018, 2019, tax reform, IRS, MACRS, depreciation methods, financial reporting, asset valuation, tax liability"}
{"_id":"q1a71f6e2","title":"","text":"net cash inflow, operating activities, cash receipts, cash payments, operating income, depreciation, amortization, changes in working capital, accounts receivable, inventory, accounts payable, accrued liabilities, non-cash expenses, tax payments, interest payments"}
{"_id":"q1a72e14c","title":"","text":"South America, revenue, 2017, 2018, change, financial analysis, year-over-year comparison"}
{"_id":"q1a740694","title":"","text":"Supplier A, inventory purchases, percentage change, 2017, 2018"}
{"_id":"q1a7391d2","title":"","text":"foreign defined benefit pension plans, accumulated benefit obligation, percentage change, 2019, 2018"}
{"_id":"q1a715d36","title":"","text":"assets, inventory, fiscal 2018, fiscal 2019"}
{"_id":"q1a72b442","title":"","text":"percentage change, amount, 31 December"}
{"_id":"q1a724624","title":"","text":"net income, basic share, pro forma, September 30, 2018"}
{"_id":"q1a716bf0","title":"","text":"Effective tax rate, 2018, 2019, change, corporate tax, tax reform, IRS, financial analysis, fiscal year, tax liability, revenue, tax policy."}
{"_id":"q1a73a5a0","title":"","text":"average diluted EPS, shares outstanding, 2018, 2019"}
{"_id":"q1a72556a","title":"","text":"capitalized interest, 2019, financial analysis, interest expense, accounting standards, capital structure, investment, financial reporting"}
{"_id":"q1a73439e","title":"","text":"board compensation, decreased, 2018, 2019, financial performance, cost-cutting measures, shareholder feedback, executive pay, corporate governance, compensation committee, market trends"}
{"_id":"q1a733674","title":"","text":"purchase obligations, financial commitments, contracts, future payments, liabilities, accounting standards, cash flow, companies, financial reporting, obligations, agreements, fiscal year, balance sheet"}
{"_id":"q1a712e10","title":"","text":"NEOs, total salary, compensation, executive pay, financial reporting, corporate governance, SEC filings, annual proxy statement, performance metrics, salary structure, incentive compensation, stock options, bonuses, fiscal year, company performance, shareholder value."}
{"_id":"q1a7264b0","title":"","text":"income, foreign countries, 2019"}
{"_id":"q1a73dc0a","title":"","text":"profit before taxation, percentage change, 2019, 2018"}
{"_id":"q1a73b9fa","title":"","text":"restricted stock, fair value, vested, 2019, 2018, 2017"}
{"_id":"q1a73ef2e","title":"","text":"unrecognized compensation cost, 2020, financial reporting, stock options, equity compensation, accounting standards, ASC 718, companies, employee stock ownership, expense recognition"}
{"_id":"q1a7248cc","title":"","text":"volatility, December 31, 2019, financial markets, risk assessment, investment analysis"}
{"_id":"q1a726c4e","title":"","text":"Grocery & Snacks, impairment charges, fiscal 2019, financial reporting, asset valuation, company earnings, financial analysis."}
{"_id":"q1a72c2fc","title":"","text":"carrying value, fair value, Notes Payable, 2019"}
{"_id":"q1a72e1b0","title":"","text":"revenues, 2018, top companies, financial analysis, earnings, revenue figures, financial performance"}
{"_id":"q1a736e3c","title":"","text":"pension, benefit credits, 2018"}
{"_id":"q1a71828e","title":"","text":"BCE, capital intensity ratio, % change, financial analysis, telecommunications, investment, capital expenditure, revenue, fiscal year, quarterly report."}
{"_id":"q1a73fc80","title":"","text":"Mr Kapuria, salary, promotion, percentage increase"}
{"_id":"q1a73a79e","title":"","text":"Trade accounts receivable, net, current, financial year, balance sheet, accounts receivable, company analysis, fiscal year, financial reporting."}
{"_id":"q1a7368b0","title":"","text":"fair value, equity interest, LNTL, company, valuation"}
{"_id":"q1a72e354","title":"","text":"Convertible notes, fiscal year 2019"}
{"_id":"q1a73dee4","title":"","text":"Revenues, 2019, 2018, financial analysis, year-over-year growth, revenue comparison"}
{"_id":"q1a739790","title":"","text":"credit risk rating, 7, higher, company, financial assessment, risk evaluation"}
{"_id":"q1a733f84","title":"","text":"Inotera, acquisition, 2016, remaining interests, Micron Technology, 60%, $4 billion."}
{"_id":"q1a74063a","title":"","text":"Supplier C, total inventory purchases, 2019, percentage, financial analysis, procurement, supplier contribution, inventory management."}
{"_id":"q1a731f9a","title":"","text":"Customer Support Revenues, GAAP-based Customer Support Gross Profit, Fiscal Year 2019, Americas, percentage."}
{"_id":"q1a73b428","title":"","text":"outstanding shares, year, financial analysis, equity, stock market, company performance"}
{"_id":"q1a7293ae","title":"","text":"average value added, fresh vacuum-sealed, registrant processed chicken, percentage, net sales dollars, fiscal year 2018, fiscal year 2019"}
{"_id":"q1a7395f6","title":"","text":"accrued liabilities, percentage change, 2018, 2019"}
{"_id":"q1a71e972","title":"","text":"Property and equipment, net, United States, Year Ending March 31, 2018, Year Ending March 31, 2019, change, financial analysis."}
{"_id":"q1a72b140","title":"","text":"goodwill, allocation, cash-generating unit (CGU), impairment testing, acquisition, fair value, intangible assets, financial reporting, IFRS, accounting standards, valuation, business combination, financial analysis, corporate finance"}
{"_id":"q1a73866a","title":"","text":"leasehold improvements, 2019"}
{"_id":"q1a71fb88","title":"","text":"accrued revenue, 2018, financial reporting, revenue recognition, accounting standards"}
{"_id":"q1a73acee","title":"","text":"inventories, valuation, cost method, FIFO, LIFO, weighted average, GAAP, IFRS, balance sheet, financial reporting, company name, fiscal year, inventory turnover, market value, net realizable value"}
{"_id":"q1a73f1c2","title":"","text":"basis points, percentage, net sales, Selling and administrative expenses, 2019, 2018"}
{"_id":"q1a738386","title":"","text":"voyage revenues, 2018, 2019"}
{"_id":"q1a72830a","title":"","text":"cost of sales, 2019"}
{"_id":"q1a7295f2","title":"","text":"Keywords: financial data, revenue, expenses, profit margins, fiscal year, balance sheet, income statement, cash flow, assets, liabilities, equity, earnings report, quarterly results, market capitalization, dividend yield, stock price, investment, return on equity, financial ratios."}
{"_id":"q1a723698","title":"","text":"Net income, 2019, financial performance, earnings, profit, loss, revenue, expenses, fiscal year, financial results."}
{"_id":"q1a72291e","title":"","text":"R&D, fiscal year 2019, labour resources, research and development, financial analysis, company expenditures, innovation investment."}
{"_id":"q1a7229aa","title":"","text":"Fiscal increase, Payroll, Payroll-related benefits, 2019, 2018, 2017"}
{"_id":"q1a741b52","title":"","text":"Raw materials, supplies, financial analysis, inventory management, supply chain, fiscal year, 2023, 2022, company performance, cost of goods sold."}
{"_id":"q1a733700","title":"","text":"operating lease obligations, 2020, 2021, 2022, company, financial analysis"}
{"_id":"q1a721028","title":"","text":"goodwill, fiscal 2019, BOLTS Technologies, Inc."}
{"_id":"q1a711ede","title":"","text":"wireless capital expenditure, 2018, 2019, increase, decrease"}
{"_id":"q1a724d72","title":"","text":"Net cash provided by operating activities, 2017"}
{"_id":"q1a721262","title":"","text":"restructuring costs, 2018, 2019, financial analysis, cost reduction, corporate restructuring"}
{"_id":"q1a72c0c2","title":"","text":"cash flow, financing activities, year-to-year increase, capital raising, debt issuance, equity financing, dividends, share buybacks, interest payments, financial leverage, liquidity, investment, cash management, corporate finance, 2023"}
{"_id":"q1a71bace","title":"","text":"restructuring expenses, severance pay, facility closure costs, asset write-downs, legal fees, consulting fees, employee relocation costs, operational changes, financial reporting, corporate restructuring, merger and acquisition costs, impairment charges, strategic realignment, workforce reduction, financial liabilities, balance sheet adjustments, cash flow impact, fiscal year 2023, company reorganization."}
{"_id":"q1a73d160","title":"","text":"cash and cash equivalents, percentage change, 2018, 2019"}
{"_id":"q1a73b18a","title":"","text":"Research and Development expense, revenue percentage, 2019, 2018"}
{"_id":"q1a7277b6","title":"","text":"Sitting Fees, Total Managerial Remuneration, percentage, corporate governance, compensation, board of directors, financial analysis, remuneration committee, fiscal year, executive pay."}
{"_id":"q1a7321f2","title":"","text":"net income, 2018, 2019, increase, decrease"}
{"_id":"q1a731234","title":"","text":"long-term prepaid ground rent, 2018"}
{"_id":"q1a738be2","title":"","text":"income tax benefit, deferred tax assets, tax reform, corporate tax rate, net operating losses, tax credits, financial performance, earnings report, fiscal year, tax liabilities, accounting standards, tax strategy, tax planning, tax compliance, tax deductions"}
{"_id":"q1a72b19a","title":"","text":"carrying value, CGUs, components, assets, liabilities, goodwill, intangible assets, tangible assets, impairment, valuation date"}
{"_id":"q1a72394a","title":"","text":"subscription revenue, 2019"}
{"_id":"q1a7254ca","title":"","text":"capitalized interest, average rate, 2018, finance, interest calculation"}
{"_id":"q1a7379c2","title":"","text":"revenue, sales, service income, product sales, subscription fees, licensing fees, interest income, investment income, dividends, royalties, gross income, net income, operating revenue, non-operating revenue, top line, earnings, financial performance"}
{"_id":"q1a737cf6","title":"","text":"Flextronics Technology, less than 20.0%, year, financial performance, market share."}
{"_id":"q1a73bbd0","title":"","text":"Other non-current assets, 2018, financial reporting, intangible assets, deferred tax assets, long-term investments, property, plant and equipment, goodwill, companies, balance sheet."}
{"_id":"q1a741e36","title":"","text":"dilutive securities, anti-dilutive, fiscal year 2019, percentage, financial analysis, earnings per share, convertible debt, stock options, preferred stock, market capitalization"}
{"_id":"q1a72a2a4","title":"","text":"communication figures, increase, decrease, 2018, 2019"}
{"_id":"q1a714a12","title":"","text":"net property and equipment, percentage change, 2018, 2019"}
{"_id":"q1a714f08","title":"","text":"non-employee directors, cash compensation, average fee, corporate governance, board of directors, compensation committee, 2023, financial services, governance practices"}
{"_id":"q1a73cf12","title":"","text":"net loss, 2018, 2019, average, financial performance"}
{"_id":"q1a71fc14","title":"","text":"unearned revenue, accrued revenue, 2019"}
{"_id":"q1a71fff2","title":"","text":"net profit, impairment, financial reporting, earnings, company performance, adjusted earnings, financial analysis, accounting standards, investor relations, financial metrics"}
{"_id":"q1a731716","title":"","text":"contracts, percentage change, financial analysis, one year, fiscal year, revenue contracts, contract value, financial metrics"}
{"_id":"q1a733426","title":"","text":"employee benefits, average value, 2018, 2019"}
{"_id":"q1a732e68","title":"","text":"restricted share units, 2001 share incentive plan, equity compensation, stock options, employee benefits, corporate governance"}
{"_id":"q1a732ec2","title":"","text":"Amended and Restated 2010 Share Incentive Plan, total Number of Shares, Equity Compensation Plans, future issuance, proportion"}
{"_id":"q1a7239f4","title":"","text":"Total Revenue, 2017, Total Revenue, 2018, percentage change, financial analysis, revenue growth, fiscal year, year-over-year comparison"}
{"_id":"q1a7393d0","title":"","text":"United Kingdom, non-current assets, Europe, Middle East, Africa, 2019"}
{"_id":"q1a72af6a","title":"","text":"financial years, fiscal year, 2020, 2021, 2022, 2023, quarterly results, annual report"}
{"_id":"q1a73e3a8","title":"","text":"percentage change, total segment net revenues, 2018, 2019"}
{"_id":"q1a7243b8","title":"","text":"R&D centers, particularly in the context of financial incentives and tax credits, are often certified by government bodies or specific regulatory agencies depending on the country. In the United States, for example, the Internal Revenue Service (IRS) may be involved in certifying eligibility for R&D tax credits. In other countries, similar agencies or departments may exist, such as the National Science Foundation (NSF) or the Department of Energy (DOE). \n\nKeywords: R&D centers, certification, IRS, National Science Foundation, Department of Energy, tax credits, government agencies."}
{"_id":"q1a71d70c","title":"","text":"amortization, intangible assets, average, 2018, 2019"}
{"_id":"q1a72399a","title":"","text":"Subscription Revenue, 2018, 2019, change, financial analysis, revenue growth, year-over-year, company performance, financial metrics."}
{"_id":"q1a7161a0","title":"","text":"average basic earnings per share, fiscal years, 2017, 2018, 2019"}
{"_id":"q1a73deb2","title":"","text":"income tax benefit, net income, fiscal 2018"}
{"_id":"q1a7415da","title":"","text":"Brian Kinion, Christopher Lien, shares, beneficial ownership, stock, equity, securities, ownership percentage, financial disclosure, company filings."}
{"_id":"q1a731f18","title":"","text":"Cost of Customer Support, Revenues, Expenses, Labor Costs, Technology Investments, Training Expenses, Customer Service Software, Outsourcing, Call Center Operations, Support Staff Salaries, Operational Costs, Service Level Agreements, Customer Retention, Profit Margins."}
{"_id":"q1a715cc8","title":"","text":"liability, gross unrecognized tax benefits, fiscal 2019"}
{"_id":"q1a72c630","title":"","text":"U.S. Federal statutory rate, 2019, corporate tax rate, 21%, Tax Cuts and Jobs Act, IRS, revenue, taxation."}
{"_id":"q1a72ec6e","title":"","text":"professional fees, exceed, $1,000 thousand, years"}
{"_id":"q1a73736e","title":"","text":"currency translation reserve, foreign exchange rates, multinational companies, financial reporting, foreign subsidiaries, comprehensive income, equity, IFRS, GAAP, currency fluctuations, balance sheet, translation adjustments, foreign currency, investment, consolidation, exchange differences"}
{"_id":"q1a73b702","title":"","text":"amortization expense, December 31, 2019, 2018, financial reporting, accounting standards"}
{"_id":"q1a71a174","title":"","text":"amortization, purchased intangibles, CTS, operating results, financial impact, accounting standards, intangible assets, expense recognition, fiscal year, financial reporting"}
{"_id":"q1a71b4b6","title":"","text":"valuation allowance, 2019, company, decrease, financial reporting"}
{"_id":"q1a72a74a","title":"","text":"trade receivables, 2019"}
{"_id":"q1a72d8a0","title":"","text":"financing arrangements, debt financing, equity financing, credit facilities, loan agreements, bond issuance, venture capital, private equity, interest rates, repayment terms, collateral, underwriting, syndication, financial covenants, capital structure, liquidity, working capital, investment agreements, shareholder agreements, convertible notes, term loans, revolving credit, mezzanine financing, public offerings, private placements, financial institutions, lenders, investors, risk management, cash flow management."}
{"_id":"q1a71bd44","title":"","text":"compensation increase, 2019, salary growth, wage increase, economic trends, labor market, inflation rate, employee benefits, corporate earnings, workforce compensation"}
{"_id":"q1a7186b2","title":"","text":"goodwill, percentage change, 2018, 2019"}
{"_id":"q1a73a5c8","title":"","text":"Basic EPS, Shares Outstanding, 2018, 2019"}
{"_id":"q1a7388ae","title":"","text":"allowance for doubtful accounts, accounts receivable, financial forecasting, historical data, credit risk, aging schedule, percentage of sales method, company policy, bad debt expense, financial reporting, GAAP, IFRS, management judgment, economic conditions, customer creditworthiness, write-offs, reserve estimation, financial analysis, audit, receivables management"}
{"_id":"q1a71c92e","title":"","text":"rental revenue, refranchising strategy, 2019, financial performance, revenue growth, franchise agreements, real estate, income statement, company earnings"}
{"_id":"q1a73b1e4","title":"","text":"Research and development expenses, companies, financial analysis, 50,000 thousands, fiscal year, budget allocation, expenditure trends."}
{"_id":"q1a72d062","title":"","text":"interest expense, 2018, 2019"}
{"_id":"q1a73d82c","title":"","text":"audit fee, audit services, financial statements, external auditors, internal controls, compliance, risk assessment, audit engagement, professional fees, accounting standards, audit scope, audit duration, audit report, audit quality, firm reputation, industry benchmarks, client size, complexity of operations, regulatory requirements, audit partner, audit team, billing rates, additional services, retainer fees, fixed fees, hourly rates, contract terms, negotiation, payment terms, audit committee, financial year, audit planning, audit execution, audit completion, audit opinion."}
{"_id":"q1a7397c2","title":"","text":"gross receivables, credit ratings, 2019"}
{"_id":"q1a71e10c","title":"","text":"net cash provided by operating activities, net cash used in investing activities, 2019, cash flow ratio"}
{"_id":"q1a731f72","title":"","text":"GAAP, Customer Support, Gross Profit, annual, financial metrics"}
{"_id":"q1a711b6e","title":"","text":"total assets, June 30, 2019"}
{"_id":"q1a711f42","title":"","text":"capital expenditure, 2018, 2019, percentage increase, financial analysis"}
{"_id":"q1a713720","title":"","text":"operating lease obligations, lease payments, rental agreements, financial liabilities, ASC 842, IFRS 16, lessee, lessor, balance sheet, cash flow, lease term, renewal options, contingent rent, non-cancellable leases, operating expenses, depreciation, interest expense, financial reporting, compliance, accounting standards"}
{"_id":"q1a7130e0","title":"","text":"net income, August 2019"}
{"_id":"q1a729886","title":"","text":"goodwill impairment, percentage change, 2017, 2018"}
{"_id":"q1a71412a","title":"","text":"impairment charge, 2018, financial reporting, asset valuation, accounting standards"}
{"_id":"q1a733106","title":"","text":"volatility, derivatives, Black-Scholes model, implied volatility, historical volatility, risk management, financial instruments, options pricing, market fluctuations, trading strategies, financial analysis, quantitative finance, hedging, asset pricing, financial derivatives"}
{"_id":"q1a7413aa","title":"","text":"net property, plant and equipment, percentage change, 2018, 2019"}
{"_id":"q1a73ebc8","title":"","text":"Dividend, interest income, percentage change, 2018, 2017"}
{"_id":"q1a71c9e2","title":"","text":"franchise rental revenues, total franchise revenues, 2019, percentage, financial analysis"}
{"_id":"q1a740914","title":"","text":"current maturities, average, financial analysis, liabilities, short-term debt, balance sheet, accounting, cash flow, interest payments, financial ratios"}
{"_id":"q1a7254fc","title":"","text":"capitalized interest, average rate, interest expense, financing costs, project financing, accounting standards, time value of money, investment projects, loan agreements, financial reporting"}
{"_id":"q1a7276d0","title":"","text":"Aman Mehta, Sitting Fees, Board Meetings, Committee Meetings, Corporate Governance, Compensation, 2023"}
{"_id":"q1a73f71c","title":"","text":"Machinery and equipment, 2018, 2019, change, financial analysis, capital expenditure, depreciation, asset valuation, investment trends, economic indicators."}
{"_id":"q1a734588","title":"","text":"Accumulated benefit obligation, $3,000 thousand, years, financial analysis, pension plans, actuarial valuation."}
{"_id":"q1a71e3dc","title":"","text":"high price per share, low price per share, first quarter 2018, stock market, price difference"}
{"_id":"q1a72268a","title":"","text":"Special charges, recoveries, restructuring costs, impairment losses, asset write-downs, legal settlements, severance payments, goodwill impairment, operational restructuring, non-recurring expenses, financial adjustments, corporate restructuring, one-time charges, earnings impact, financial reporting, fiscal year adjustments."}
{"_id":"q1a72e796","title":"","text":"Amortization, intangibles, 2017, 2018, 2019, average, financial analysis, accounting standards, GAAP, IFRS, companies, financial reporting."}
{"_id":"q1a71ce9c","title":"","text":"Debt financed acquisition, communication sites, 2018, American Tower Corporation, $2.5 billion, acquisition, debt financing, telecommunications, infrastructure."}
{"_id":"q1a722720","title":"","text":"average annual total charges"}
{"_id":"q1a73edd0","title":"","text":"American Tower Corporation, Pro forma net income, common stockholders, 2018, 2019"}
{"_id":"q1a73aaaa","title":"","text":"nonvested stock units, share-based compensation expense, 2019, percentage, financial analysis"}
{"_id":"q1a738c0a","title":"","text":"minority interest, 2019, financial reporting, equity, valuation, consolidation, ownership stake"}
{"_id":"q1a716966","title":"","text":"Deferred compensation, 2018, 2019, average, financial analysis, employee benefits, tax implications, compensation packages, executive compensation, retirement plans."}
{"_id":"q1a71a8fe","title":"","text":"Net earnings from operations, 2018"}
{"_id":"q1a73703a","title":"","text":"Group, customers, revenue, market share, profitability, customer acquisition, retention, financial performance, growth strategy."}
{"_id":"q1a727dd8","title":"","text":"Products and Licensing revenue, 2019, 2018"}
{"_id":"q1a7339c6","title":"","text":"Aerospace\/Defense, AMER, revenue, financial performance, Q3 2023, defense contracts, aerospace industry, market analysis."}
{"_id":"q1a740432","title":"","text":"prepaid taxes, percentage change, 2018, 2019"}
{"_id":"q1a73a03c","title":"","text":"Other regions, revenue, percentage change, 2018, 2019"}
{"_id":"q1a73d854","title":"","text":"tax fees, tax preparation, tax planning, tax compliance, tax advisory, IRS, tax returns, deductions, credits, penalties, tax liabilities, accounting firms, CPA, tax software, tax audits, tax consultants, tax law, tax regulations, tax strategies, tax liabilities, tax jurisdictions"}
{"_id":"q1a718036","title":"","text":"average price per megabit, 2017, 2018"}
{"_id":"q1a72903e","title":"","text":"Property and equipment, net value, Property and equipment, gross value, 2019"}
{"_id":"q1a721a64","title":"","text":"Network Solutions, revenue, Traditional & Other Products, financial performance, fiscal year, earnings report, 2023."}
{"_id":"q1a73dbd8","title":"","text":"profit before taxation, 2019, 2018, change, financial performance"}
{"_id":"q1a71dc98","title":"","text":"Americas Revenue, Total Revenue, 2019, percentage"}
{"_id":"q1a71fd86","title":"","text":"total revenue, Q1 2020, financial performance, earnings report, quarterly results"}
{"_id":"q1a733c32","title":"","text":"Intrinsic value, SARS, 2017, financial analysis, stock options, equity compensation, valuation, market price, exercise price, employee stock options."}
{"_id":"q1a727b4e","title":"","text":"revenue growth, 2019, 2018"}
{"_id":"q1a724412","title":"","text":"R&D expenditure, FY 2018, FY 2019, consolidated total, change, financial analysis, company performance, budget allocation, investment trends"}
{"_id":"q1a7190d0","title":"","text":"Effect of prior year adjustments, 2017, 2019, financial reporting, accounting standards, adjustments, fiscal year, financial performance, audit, reconciliation."}
{"_id":"q1a716bc8","title":"","text":"Provision for income taxes, 2018, 2019, average, financial analysis, tax expense, corporate tax rate, fiscal year, income tax provision, tax liability, financial reporting."}
{"_id":"q1a7349fc","title":"","text":"Net revenues, fiscal 2017, fiscal 2018, variance, percent, financial analysis, year-over-year comparison"}
{"_id":"q1a729ab6","title":"","text":"Net income, attributable to parent company, December 31, 2019, December 31, 2018, average, financial performance, earnings, fiscal year."}
{"_id":"q1a72cbee","title":"","text":"Restricted stock, 2019, equity compensation, vesting schedule, tax implications, employee stock ownership, public companies, private companies, stock options, liquidity event, SEC regulations, shareholder rights."}
{"_id":"q1a727ae0","title":"","text":"Revenue, 2017, 2018, change, financial analysis, fiscal year, growth rate, earnings report"}
{"_id":"q1a73cc24","title":"","text":"warranty reserve, 2019, financial analysis, accounting, liability, balance sheet, accrual, expense, company financials, year-end, beginning balance, ending balance"}
{"_id":"q1a72e3e0","title":"","text":"Restricted Share Awards, RSAs, 2018, 2019, change, equity compensation, stock awards, company performance, vesting schedule."}
{"_id":"q1a723ea4","title":"","text":"Cash flow from investing activities, 2018, 2019, average, financial analysis, investment, capital expenditures, acquisitions, divestitures, cash outflows, cash inflows."}
{"_id":"q1a723152","title":"","text":"percentage difference, first quarter, fourth quarter, high, fiscal year 2019"}
{"_id":"q1a71d7f2","title":"","text":"amortization, intangible assets, fiscal 2019, fiscal 2018, financial reporting, accounting standards, acquisition, goodwill, depreciation, expense, financial analysis"}
{"_id":"q1a7415a8","title":"","text":"L. Gordon Crovitz, Donald P. Hutchison, shares, beneficial ownership, stock, equity, securities, ownership percentage, financial disclosure, company filings."}
{"_id":"q1a724fac","title":"","text":"convertible senior notes, 2018, 2019"}
{"_id":"q1a716114","title":"","text":"Keywords: financial data, revenue, expenses, profit, balance sheet, cash flow, assets, liabilities, equity, fiscal year, company performance, earnings report, financial ratios, market capitalization, dividend yield, stock price, investment analysis."}
{"_id":"q1a7288f0","title":"","text":"cable revenue, 2017, 2018, increase, decrease"}
{"_id":"q1a735032","title":"","text":"Weighted average grant date fair value, increase, decrease, 2018, 2019"}
{"_id":"q1a73ff6e","title":"","text":"average sales, square metre, F18, F19"}
{"_id":"q1a72f2c2","title":"","text":"Other liabilities, financial analysis, year comparison, balance sheet, liabilities, financial reporting, accounting standards."}
{"_id":"q1a728d46","title":"","text":"Acquisition, fiscal 2019, merger, acquisition, company purchase, financial transaction, investment, corporate buyout, asset acquisition, stock purchase."}
{"_id":"q1a72098e","title":"","text":"RSUs, expenses, recognition, time-based service conditions, equity compensation, fair value, vesting period, income statement, stock-based compensation, accounting standards, ASC 718, FASB, expense recognition, grant date, amortization, tax implications."}
{"_id":"q1a71447c","title":"","text":"government grants, other payables, 2018"}
{"_id":"q1a72801c","title":"","text":"noncontributory, defined benefit, pension plan, employees, beneficiaries, retirement, plan participants"}
{"_id":"q1a711812","title":"","text":"general and administrative expense, exceed, $2,000 million, years"}
{"_id":"q1a72faa6","title":"","text":"financial income, costs, recorded year"}
{"_id":"q1a740c20","title":"","text":"Effect of exchange rate changes, cash and cash equivalents, percentage change, 2017, 2019"}
{"_id":"q1a73e5a6","title":"","text":"currency effects, measurement results, hedging transactions, hedging relationships, comprehensive income"}
{"_id":"q1a71631c","title":"","text":"projected benefit obligation, accumulated benefit obligation, fair value of plan assets, pension plans, financial projections, company, years, obligations, assets"}
{"_id":"q1a740b3a","title":"","text":"Net cash provided by operating activities, financial data, fiscal years, cash flow, operating cash flow, financial analysis."}
{"_id":"q1a724fde","title":"","text":"equity incentive plans, common stock, shares, 2018, 2019"}
{"_id":"q1a737f94","title":"","text":"Total accrued expenses, other payables, percentage change, 2018, 2019"}
{"_id":"q1a71d7ca","title":"","text":"acquisition, intangible assets, company, merger, acquisition date, goodwill, intellectual property, trademarks, patents, brand value"}
{"_id":"q1a7232ec","title":"","text":"lower of cost, inventory valuation, market value, cost basis, accounting principles, GAAP, IFRS, write-down, impairment, financial reporting, asset valuation, cost method, net realizable value, historical cost, fair value, inventory write-off"}
{"_id":"q1a739178","title":"","text":"accumulated benefit obligation, foreign defined benefit pension plans, year, financial analysis, pension liabilities"}
{"_id":"q1a728b34","title":"","text":"Applications, revenue, 2019"}
{"_id":"q1a72bc58","title":"","text":"average gross profit, 2018, 2019, company"}
{"_id":"q1a733c5a","title":"","text":"Intrinsic value, SARS, 2017, 2018, change, stock options, equity compensation, valuation, financial analysis."}
{"_id":"q1a73934e","title":"","text":"non-current assets, America, 2019, property, plant, equipment, intangible assets, goodwill, investments, long-term receivables, deferred tax assets"}
{"_id":"q1a711272","title":"","text":"Topic 606, revenue recognition, fiscal 2019, adoption method, companies, financial reporting, ASC 606, retrospective method, cumulative effect method."}
{"_id":"q1a71e404","title":"","text":"2019, quarters, high share price, $85.00"}
{"_id":"q1a723350","title":"","text":"Wireless devices, accessories, 2018, 2019, increase, decrease"}
{"_id":"q1a7393f8","title":"","text":"non-current assets, Asia Pacific, percentage change, financial analysis, asset management"}
{"_id":"q1a72f222","title":"","text":"Other liabilities, 2019"}
{"_id":"q1a72aa06","title":"","text":"Loss from discontinued operations, 2017, 2018, financial analysis, year-over-year comparison, financial performance, company earnings, operational efficiency."}
{"_id":"q1a7149e0","title":"","text":"leasehold improvements, 2018, 2019, financial analysis, asset valuation"}
{"_id":"q1a73ac6c","title":"","text":"inventories, finished goods, 2018, 2019, change, financial analysis"}
{"_id":"q1a73c77e","title":"","text":"Bell Wireless, operating service revenues, total revenues, 2019, percentage"}
{"_id":"q1a711c04","title":"","text":"total assets, fiscal year 2018, fiscal year 2019, percentage change"}
{"_id":"q1a741378","title":"","text":"Buildings and Improvements, 2018, 2019, change, financial analysis, asset valuation, depreciation, capital expenditures, balance sheet, investment, real estate, company financials."}
{"_id":"q1a72ca0e","title":"","text":"Net cash flow, operating activities, financial analysis, cash flow statement, year comparison, financial performance."}
{"_id":"q1a720cb8","title":"","text":"valuation allowance, 2019, company valuation"}
{"_id":"q1a717384","title":"","text":"AMER, total assets, 2018"}
{"_id":"q1a732440","title":"","text":"Time charter equivalent revenues, Years Ended December 31, 2018, 2019, change, financial analysis, revenue comparison, shipping industry, maritime finance."}
{"_id":"q1a73a578","title":"","text":"diluted EPS, shares outstanding, 2019, 2018"}
{"_id":"q1a73bc5c","title":"","text":"oil derivative instrument, year, financial markets, commodity prices, derivatives trading, 2023, 2022, 2021, market analysis, investment strategies"}
{"_id":"q1a720ce0","title":"","text":"net deferred tax assets, 2019, financial reporting, tax liabilities, accounting standards"}
{"_id":"q1a720254","title":"","text":"non-current assets, property, plant and equipment, intangible assets, long-term investments, deferred tax assets, goodwill, fixed assets, investment property, financial assets, capitalized development costs"}
{"_id":"q1a7178a2","title":"","text":"related party items, Revenues, financial years, 2023, 2022, 2021, 2020, 2019"}
{"_id":"q1a735000","title":"","text":"Weighted average grant date fair value, percentage increase, 2018, 2019"}
{"_id":"q1a722e3c","title":"","text":"APDC, landholder duty, acquisition, 2019"}
{"_id":"q1a722bd0","title":"","text":"cost of net revenue, 150,000 thousands, year"}
{"_id":"q1a719896","title":"","text":"Restricted cash, 2017, financial reporting, liquidity, cash equivalents, balance sheet, accounting standards, SEC regulations."}
{"_id":"q1a713392","title":"","text":"ending balances, 2018, 2019, financial analysis, year-over-year comparison, balance sheet, financial performance, fiscal year, net income, equity, liabilities, assets"}
{"_id":"q1a7364fa","title":"","text":"amortized costs, corporate bonds, percentage, total amortized cost"}
{"_id":"q1a71a89a","title":"","text":"Basic net earnings per common share, earnings, common shares, net income, preferred dividends, weighted average shares outstanding, financial metrics, earnings per share (EPS), accounting, financial analysis."}
{"_id":"q1a719012","title":"","text":"foreign jurisdictions, provision for income taxes, tax regulations, international tax law, tax treaties, foreign tax credits, transfer pricing, OECD guidelines, tax havens, corporate tax rates, double taxation agreements, repatriation taxes, BEPS, tax compliance, multinational corporations, tax liabilities, fiscal policies, tax incentives, global tax reform."}
{"_id":"q1a737076","title":"","text":"external revenue, financial reporting, revenue recognition, GAAP, IFRS, revenue streams, sales, income, financial disclosures, quarterly earnings, annual reports, revenue sources, company performance, revenue growth, revenue forecasting, market analysis, revenue models, business segments, revenue breakdown, financial analysis"}
{"_id":"q1a716628","title":"","text":"Over 2 months overdue, past due but not impaired receivables, financial analysis, receivables management, credit risk, accounts receivable, financial year comparison."}
{"_id":"q1a72c3a6","title":"","text":"Cash and cash equivalents, accounts receivable, accounts payable, disclosure, financial reporting, liquidity, current assets, current liabilities, balance sheet, IFRS, GAAP, financial analysis, working capital, cash flow, credit risk, liquidity risk."}
{"_id":"q1a72be1a","title":"","text":"sales and marketing expenses, increase, year ended 2019, year ended 2018"}
{"_id":"q1a71bd12","title":"","text":"discount rate, financial analysis, interest rate, valuation, cash flow, present value, Federal Reserve, monetary policy, October 2023"}
{"_id":"q1a723094","title":"","text":"delisting, NASDAQ, common stock, compliance, market capitalization, financial reporting, regulatory requirements, trading volume, company name, date of delisting"}
{"_id":"q1a731bb2","title":"","text":"Restricted stock units, issuances, 2019, equity compensation, companies, stock-based compensation, vesting, employee incentives, market value, accounting treatment."}
{"_id":"q1a723be8","title":"","text":"domestic income, 2017, 2018, economic growth, GDP, income change, financial analysis"}
{"_id":"q1a72b172","title":"","text":"goodwill, Digital, 2019"}
{"_id":"q1a71c960","title":"","text":"royalties, 2019"}
{"_id":"q1a73a5fa","title":"","text":"exercisable shares, 2019, 2018, total number, financial analysis"}
{"_id":"q1a72cbbc","title":"","text":"income tax benefit, share-based compensation, 2019"}
{"_id":"q1a73bc8e","title":"","text":"mark-to-market, interest rate swaps, valuation, 2018, 2019"}
{"_id":"q1a7342ae","title":"","text":"operating expenses, 2019, cost of goods sold, labor costs, marketing expenses, research and development, administrative expenses, inflation, supply chain disruptions, regulatory compliance, technology investments, corporate restructuring, employee benefits, depreciation, amortization"}
{"_id":"q1a74093c","title":"","text":"long-term debt, current maturities, average, financial analysis, balance sheet, liabilities, interest rates, corporate finance, debt management"}
{"_id":"q1a73f744","title":"","text":"projects in process, 2018, 2019, financial analysis, change in projects, accounting, financial reporting"}
{"_id":"q1a71e602","title":"","text":"data centre services, revenue, colocation, cloud services, managed services, infrastructure as a service (IaaS), data storage, network services, IT services, market growth, industry trends, financial performance, company earnings, service level agreements (SLAs), operational costs, capital expenditures, customer contracts, revenue streams, fiscal year, quarterly earnings, profit margins."}
{"_id":"q1a7228ec","title":"","text":"R&D expenses, innovation, product development, technology, patents, research projects, labor costs, materials, companies, investment, budgeting, financial analysis, market research, intellectual property, funding, grants, collaboration, timelines, expenditures."}
{"_id":"q1a71598a","title":"","text":"stock-based compensation, expense, 2018, financial reporting, equity compensation, companies, accounting standards"}
{"_id":"q1a7178d4","title":"","text":"software services, 2019, cloud computing, SaaS, Microsoft, Salesforce, Oracle, IBM, automation, cybersecurity, digital transformation, AI, machine learning, fintech, outsourcing, Agile methodology, DevOps, IT consulting, application development, data analytics"}
{"_id":"q1a719be8","title":"","text":"I'm sorry, but I cannot provide an answer without the content of the note. Please provide the text or details for analysis."}
{"_id":"q1a7279e6","title":"","text":"constant currency revenue, 2019, financial performance, exchange rates, revenue growth, multinational companies"}
{"_id":"q1a72d8fa","title":"","text":"net loan receivables, percentage change, 2018, 2019"}
{"_id":"q1a72be42","title":"","text":"sales and marketing expenses, increase, year ended 2018, year ended 2017"}
{"_id":"q1a71f70a","title":"","text":"interest received, financial analysis, year comparison, revenue, interest income, financial performance"}
{"_id":"q1a72702c","title":"","text":"total operating lease obligations, total purchase obligations, financial analysis, liabilities, cash flow, accounting standards, ASC 842, IFRS 16, lease accounting, contractual commitments"}
{"_id":"q1a740892","title":"","text":"repurchase, capital stock, company, conditions, treasury stock, shareholder approval, liquidity, market conditions, legal compliance, financial health, dividend policy, stock buyback, SEC regulations, corporate governance, market price, earnings per share, capital structure, return on equity, shareholder value"}
{"_id":"q1a725cb8","title":"","text":"FinTech, Business Services, revenue, fourth quarter, 2018, 2019, costs, change"}
{"_id":"q1a73295e","title":"","text":"dividends, cash, 2019, total amount"}
{"_id":"q1a73cbca","title":"","text":"warranty obligation, repair, replacement, defective product, company, duration"}
{"_id":"q1a7233aa","title":"","text":"Total inventories, 2018, 2019, increase, decrease, financial analysis, year-over-year comparison"}
{"_id":"q1a723e18","title":"","text":"cash flow, investing activities, 2019, decrease"}
{"_id":"q1a73e2c2","title":"","text":"Blizzard, segment operating income, 2019"}
{"_id":"q1a72a056","title":"","text":"Television subscribers, Local residential telephone services, 2019, total number, telecommunications, subscriber count"}
{"_id":"q1a72db8e","title":"","text":"furniture and equipment, assets, 2019, percentage"}
{"_id":"q1a73b3ce","title":"","text":"percentage change, shares forfeited, 2018, 2019"}
{"_id":"q1a723b34","title":"","text":"Income before income taxes, financial years, fiscal year, revenue, profit, earnings, tax liability, net income, financial performance, quarterly earnings, annual report."}
{"_id":"q1a7176ea","title":"","text":"Zyla, Oxaydo, total revenue, percentage decrease, financial analysis, revenue loss, pharmaceutical industry, earnings report, fiscal year."}
{"_id":"q1a741ac6","title":"","text":"inventories, FIFO, LIFO, financial analysis, cost of goods sold, inventory valuation, accounting methods, financial reporting, asset valuation, tax implications"}
{"_id":"q1a7258bc","title":"","text":"IFRS, GAAP, FASB, IASB, ASC, AICPA, SEC, financial reporting standards, accounting principles, international standards, US GAAP, revenue recognition, lease accounting, financial instruments, consolidation, fair value measurement."}
{"_id":"q1a722496","title":"","text":"operating leases, total, due, 3 years, financial obligations, liabilities, cash flow, accounting standards, ASC 842, IFRS 16"}
{"_id":"q1a739ace","title":"","text":"Loan Receivables, Financed service contracts, total difference, financial analysis, balance sheet, asset management, receivables, contracts, financial metrics."}
{"_id":"q1a737698","title":"","text":"dividend, declared, 2019"}
{"_id":"q1a713bd0","title":"","text":"acquisition-related costs, percentage change, 2018, 2019"}
{"_id":"q1a726cda","title":"","text":"intangible assets, gross carrying amount, percentage change, 2018, 2019"}
{"_id":"q1a729f98","title":"","text":"Apple, Tesla, Microsoft, Amazon, Google, 2023, innovation, technology, software, hardware, customer experience, market share, product development, programming, user interface, artificial intelligence, cloud computing."}
{"_id":"q1a717b0e","title":"","text":"excavator, loan agreement, principal amount, November 2016"}
{"_id":"q1a73eaec","title":"","text":"Dividend, interest income, 2019"}
{"_id":"q1a73b734","title":"","text":"credit facility, 2019"}
{"_id":"q1a72b956","title":"","text":"Kenya Debt, Carrying Value, 2019, Denominated Currency"}
{"_id":"q1a72e32c","title":"","text":"Stock options, fiscal year 2017"}
{"_id":"q1a739f60","title":"","text":"North America, 2019, revenue"}
{"_id":"q1a71e6e8","title":"","text":"total revenue, total other income, FY19"}
{"_id":"q1a736e6e","title":"","text":"debt redemption costs, 2019, financial analysis, interest rates, corporate bonds, refinancing, capital structure, yield to maturity, credit risk, investment grade"}
{"_id":"q1a73483a","title":"","text":"average general administrative expenses, 2017, 2018, 2019, financial analysis, expense comparison"}
{"_id":"q1a71d964","title":"","text":"long-term remuneration, FY2019, expenses"}
{"_id":"q1a71a674","title":"","text":"Accounts receivable, $50,000 thousand, exceed, years"}
{"_id":"q1a7121d6","title":"","text":"earnings per share, diluted earnings per share, basic earnings per share, net income, loss per share, weighted average shares outstanding, earnings attributable to common shareholders, fiscal year, quarterly earnings, EPS growth, non-GAAP earnings per share"}
{"_id":"q1a713edc","title":"","text":"Net Loss, December 31, 2018, December 31, 2019"}
{"_id":"q1a7124ba","title":"","text":"balance change, 2017, 2018, January 1"}
{"_id":"q1a72ad30","title":"","text":"Rest of World, 2019, 2018, financial performance, revenue growth, international markets, year-over-year comparison."}
{"_id":"q1a73ef60","title":"","text":"performance-based stock awards, fair value, fiscal 2019, fiscal 2018, fiscal 2017"}
{"_id":"q1a71fb60","title":"","text":"unearned revenue, 2019"}
{"_id":"q1a734f74","title":"","text":"risk-free interest rate, 2019, financial markets, Treasury bonds, Federal Reserve, yield curve, investment analysis"}
{"_id":"q1a72d3b4","title":"","text":"Dividend shares, percentage change, 2019, 2018"}
{"_id":"q1a7284ea","title":"","text":"raw materials, percentage change, 2019, 2018"}
{"_id":"q1a73be82","title":"","text":"net deferred tax assets, realization, taxable income, tax planning strategies, future taxable income, valuation allowance, tax rates, accounting standards, IRS regulations, financial reporting, deferred tax liabilities, corporate tax, tax credits, tax loss carryforwards, tax jurisdictions"}
{"_id":"q1a716c22","title":"","text":"Provision for income taxes, negative, financial year, tax benefit, fiscal year, tax expense, income tax, financial reporting, accounting standards."}
{"_id":"q1a73ed44","title":"","text":"pro forma revenue, 2019"}
{"_id":"q1a712258","title":"","text":"Weighted average number of shares, percentage change, dilutive effect, share options, 2018, 2019"}
{"_id":"q1a735faa","title":"","text":"operating expenses, 2019, company"}
{"_id":"q1a729fd4","title":"","text":"BCE, Wireless, percentage change, retail subscribers, financial performance, Q3 2023, telecommunications, revenue growth, market share."}
{"_id":"q1a741094","title":"","text":"incentive compensation, Richard Leeds, Robert Leeds, Bruce Leeds, financial performance, executive compensation, 2023"}
{"_id":"q1a7388d6","title":"","text":"long-term accounts receivable, allowance for doubtful accounts, June 30, 2018"}
{"_id":"q1a717410","title":"","text":"total assets, $2,000,000 thousand, financial analysis, year-over-year comparison, asset valuation, financial metrics"}
{"_id":"q1a72c324","title":"","text":"Note payable, carrying value, percentage increase, percentage decrease, financial analysis, liability, accounting, amortization, interest expense."}
{"_id":"q1a737cce","title":"","text":"largest customer, 2019, 2018, 2017"}
{"_id":"q1a7154d0","title":"","text":"property and equipment, reduction, 2018, 2019, depreciation, asset disposal, impairment, capital expenditure, financial analysis, company performance"}
{"_id":"q1a7347e0","title":"","text":"general and administrative expenses, 2018, 2019, average, financial analysis"}
{"_id":"q1a71837e","title":"","text":"BCE, Bell Wireline, capital expenditures, 2019, percentage, financial analysis"}
{"_id":"q1a722144","title":"","text":"research and development expense, increase, companies, investment, innovation, technology, product development, financial analysis, budget allocation, fiscal year, market competition, strategic initiatives, economic conditions, labor costs, materials costs, intellectual property, patents, R&D tax credits, funding sources, venture capital, corporate strategy, 2023"}
{"_id":"q1a71656a","title":"","text":"past due receivables, impaired receivables, aging analysis, credit risk, allowance for doubtful accounts, financial reporting, accounts receivable, collection efforts, customer creditworthiness, payment terms, delinquent accounts, write-offs, financial institutions, risk assessment, cash flow management"}
{"_id":"q1a724b4c","title":"","text":"deferred income, financial analysis, year comparison, revenue recognition, accounting standards, financial reporting"}
{"_id":"q1a713e28","title":"","text":"restricted stock awards, diluted earnings per share, fiscal year 2019"}
{"_id":"q1a73df8e","title":"","text":"Gross Profit, 2019, 2018, 2017"}
{"_id":"q1a72b5aa","title":"","text":"Cash, obligation, 2017, financial transaction, settlement, liquidity, cash flow, accounting, financial reporting."}
{"_id":"q1a72af9c","title":"","text":"servicing liabilities, exceed, $3,000 thousand, years"}
{"_id":"q1a726a28","title":"","text":"total revenue, increase, financial performance, revenue growth, sales, market expansion, product launch, pricing strategy, fiscal year, Q1 2023, Q2 2023, company earnings, profit margins, customer acquisition, economic factors, industry trends"}
{"_id":"q1a7393a8","title":"","text":"Asia Pacific, non-current assets, financial year, 2023, 2022, 2021, financial analysis, asset valuation"}
{"_id":"q1a72cc16","title":"","text":"unrecognized compensation cost, non-vested RSAs, PSAs, 2019"}
{"_id":"q1a713108","title":"","text":"gross profit, May 2019"}
{"_id":"q1a72070e","title":"","text":"share-based payments, Share Incentive Plan, SIP, accounting years, financial reporting"}
{"_id":"q1a714be8","title":"","text":"Europe, revenue, 2018, 2019"}
{"_id":"q1a71b10a","title":"","text":"Selling and Marketing expenses, increase, advertising campaigns, promotional activities, market expansion, customer acquisition, digital marketing, brand awareness, competitive landscape, fiscal year 2023, company growth strategy."}
{"_id":"q1a7163e4","title":"","text":"Equity Securities, plan assets, 2018, 2019, percentage change"}
{"_id":"q1a73d64c","title":"","text":"shares issued, greatest, date, financial analysis, stock market, equity, issuance, capital markets"}
{"_id":"q1a726a82","title":"","text":"revenue, subscription, returns, percentage, 2018, total revenue"}
{"_id":"q1a723ef4","title":"","text":"Net change in cash and cash equivalents, discontinued operations, 2018, 2019, increase, decrease"}
{"_id":"q1a72e0f2","title":"","text":"Canada, revenue, 2017"}
{"_id":"q1a725010","title":"","text":"convertible senior notes, average, 2017, 2018, 2019"}
{"_id":"q1a71d504","title":"","text":"minimum pension liability, 2017, 2018, balance change"}
{"_id":"q1a7325da","title":"","text":"United States, sales, countries, international markets, exports, revenue, global sales, trade relations, foreign markets, multinational companies."}
{"_id":"q1a723382","title":"","text":"Other finished goods and merchandise, 2018, 2019, increase, decrease, financial analysis, inventory, year-over-year comparison."}
{"_id":"q1a7351c2","title":"","text":"Proceeds from issuance of shares, 2017, equity financing, capital raise, stock issuance, IPO, secondary offering, share capital, public offering, private placement."}
{"_id":"q1a7336d8","title":"","text":"investment commitments, company, capital allocation, financial obligations, future investments, cash flow, risk assessment, portfolio management"}
{"_id":"q1a719c4c","title":"","text":"financing cash flows, debt issuance, equity issuance, loan repayments, dividend payments, share buybacks, capital leases, interest payments, cash inflows, cash outflows"}
{"_id":"q1a725290","title":"","text":"share-based compensation, expense, associated costs, 2018"}
{"_id":"q1a7140ee","title":"","text":"share of net earnings, affiliates, financial reporting, equity method, investment income, consolidated financial statements, earnings per share, ownership interest, financial performance, accounting standards"}
{"_id":"q1a7186da","title":"","text":"Net recognized amounts, identifiable assets, liabilities, percentage change, 2018, 2019."}
{"_id":"q1a73030c","title":"","text":"gross carrying value, other intangible assets, total gross carrying value, percentage"}
{"_id":"q1a741148","title":"","text":"Barry Litwin, Thomas Clark, 2019 Plan, net sales, percentage allocation"}
{"_id":"q1a722dd8","title":"","text":"significant expense items, The Group, financial performance, year, operating expenses, cost of goods sold, administrative expenses, research and development, marketing expenses, depreciation, interest expenses, employee compensation, utility costs, travel expenses, insurance costs, 2023"}
{"_id":"q1a711eac","title":"","text":"capital expenditure, cable industry, 2019, economic downturn, cost-cutting measures, technology investments, competition, mergers and acquisitions, regulatory changes, consumer demand"}
{"_id":"q1a73c698","title":"","text":"product revenues, 2019, market demand, pricing strategy, competition, sales volume, economic conditions, consumer behavior, product innovation, company performance"}
{"_id":"q1a72db02","title":"","text":"depreciation expense, fiscal 2017"}
{"_id":"q1a721a28","title":"","text":"Access & Aggregation, Network Solutions, revenue, financial performance, fiscal year, earnings report, market analysis"}
{"_id":"q1a73b342","title":"","text":"outstanding shares, 2019, financial period"}
{"_id":"q1a7251fa","title":"","text":"financial terms, companies, person names, dates"}
{"_id":"q1a71fe1c","title":"","text":"VMware, Inc., Net income, weighted-average share, common stockholders, diluted, Classes A, Classes B, Q2 2020, Q3 2020."}
{"_id":"q1a739ce0","title":"","text":"company policy, governance, compliance, risk management, operational efficiency, stakeholder engagement, financial performance, strategic objectives, corporate responsibility, internal controls"}
{"_id":"q1a717686","title":"","text":"Zyla, Oxaydo, licensing revenue, 2018, 2019, decrease"}
{"_id":"q1a73ff14","title":"","text":"Sales, F19, F18, nominal difference"}
{"_id":"q1a713752","title":"","text":"capital purchase obligations, financial liabilities, investment commitments, future cash outflows, balance sheet, capital expenditures, financing agreements, contractual obligations, company liabilities, investment strategy"}
{"_id":"q1a726c80","title":"","text":"accumulated amortization, fiscal year 2018, fiscal year 2019"}
{"_id":"q1a73730a","title":"","text":"financial position, liquidity, assets, liabilities, equity, cash flow, revenue, expenses, profitability, balance sheet, income statement, financial ratios, solvency, working capital, investment, capital structure, fiscal year, earnings report, financial analysis"}
{"_id":"q1a71e0b2","title":"","text":"Inotera Acquisition, intercompany balances, cash, financial transaction, acquisition date, semiconductor industry, Micron Technology, 2017."}
{"_id":"q1a732990","title":"","text":"dividends, shareholders, companies, profit distribution, cash dividends, stock dividends, dividend yield, dividend policy, quarterly dividends, annual dividends, reinvestment, dividend payout ratio, blue-chip stocks, income investors, ex-dividend date, record date, dividend growth, 2023"}
{"_id":"q1a726532","title":"","text":"total income, 2017, 2018, financial analysis, income statement, revenue growth, fiscal year, year-over-year comparison"}
{"_id":"q1a719044","title":"","text":"China, Mexico, combined provision for income taxes, 2019"}
{"_id":"q1a7196e8","title":"","text":"Golar Partners, impairment, investment, percentage change, financial analysis, Q3 2023, earnings report."}
{"_id":"q1a7383b8","title":"","text":"voyage expenses, 2018, 2019"}
{"_id":"q1a726ffa","title":"","text":"total debt obligations, purchase obligations, liabilities, financial commitments, cash flow, balance sheet, contractual obligations, interest payments, principal repayment, financial analysis"}
{"_id":"q1a71dbda","title":"","text":"total revenue, 2019, financial performance, revenue growth, earnings report"}
{"_id":"q1a7272ac","title":"","text":"financial levels, company hierarchy, organizational structure"}
{"_id":"q1a736964","title":"","text":"Other assets, 2018, 2019, change, financial analysis, balance sheet, asset management"}
{"_id":"q1a723bb6","title":"","text":"Foreign income, exceed, $5,000 thousand, years"}
{"_id":"q1a72f04c","title":"","text":"net income, 2018, 2019, financial performance, year-over-year comparison"}
{"_id":"q1a7193d2","title":"","text":"PSAs, average, 2017, 2018, 2019"}
{"_id":"q1a712dde","title":"","text":"Gregory S. Clark, base salary, financial compensation, executive pay, company earnings, salary disclosure, 2023"}
{"_id":"q1a719f44","title":"","text":"dividend, ordinary share, largest, year, financial analysis"}
{"_id":"q1a736bd0","title":"","text":"operating fiscal gains, fiscal 2020, fiscal 2021, company forecasts, timing of recognition, hedged items"}
{"_id":"q1a72c982","title":"","text":"Net cash flow from operating activities, 2019"}
{"_id":"q1a73bf36","title":"","text":"net operating loss carry forward, percentage change, 2018, 2019"}
{"_id":"q1a73fc58","title":"","text":"average, FY19, NEO, annual salary"}
{"_id":"q1a732bde","title":"","text":"prepaid expenses, accounting, financial management, cash flow, asset management, accrual accounting, expense recognition, financial reporting, company operations, budgeting, fiscal year, financial analysis"}
{"_id":"q1a7260f0","title":"","text":"key management compensation, 2019, total amount"}
{"_id":"q1a73670c","title":"","text":"revenue, 2018, 2019, financial analysis, year-over-year growth, earnings report"}
{"_id":"q1a7339ee","title":"","text":"geographical segments, external revenue, $1,000,000 thousand, financial analysis, revenue reporting"}
{"_id":"q1a7133ec","title":"","text":"percentage change, ending balance, 2017, 2018"}
{"_id":"q1a712a50","title":"","text":"level 1 FVPL, 31 December 2019"}
{"_id":"q1a71f44e","title":"","text":"Medical segment loss from operations, fiscal 2018, fiscal 2017, financial performance, year-over-year comparison."}
{"_id":"q1a73c9e0","title":"","text":"average annual total compensation, Board of Directors, fiscal year, June 30, 2017, 2018, 2019"}
{"_id":"q1a7180c2","title":"","text":"on-net customer connections, percentage change, 2017, 2018"}
{"_id":"q1a724b1a","title":"","text":"deferred income, unearned revenue, subscription revenue, gift cards, advance payments, long-term contracts, service agreements, revenue recognition, accounting standards, ASC 606, IFRS 15"}
{"_id":"q1a7314dc","title":"","text":"net revenues, December 31, 2019, December 31, 2018, average percentage"}
{"_id":"q1a724656","title":"","text":"intangible assets, weighted-average useful life, acquisition, amortization, financial reporting, asset valuation, goodwill, impairment, accounting standards, financial analysis"}
{"_id":"q1a728e04","title":"","text":"Gold, percentage change, prices, 2019, 2018"}
{"_id":"q1a728d14","title":"","text":"Cost of sales, gross margin, financial metrics, revenue, operating expenses, profit margins, inventory valuation, pricing strategy, economic conditions, industry standards."}
{"_id":"q1a727d1a","title":"","text":"Products and Licensing revenue, December 31, 2018, December 31, 2019, change, financial analysis, revenue growth, year-over-year comparison."}
{"_id":"q1a73acbc","title":"","text":"total inventories, percentage change, 2018, 2019"}
{"_id":"q1a73055a","title":"","text":"depreciation expense, 2017"}
{"_id":"q1a72d864","title":"","text":"channel partner financing, fiscal 2019, volume"}
{"_id":"q1a73e8da","title":"","text":"other expense, income, 2017"}
{"_id":"q1a7288be","title":"","text":"wireless revenue, increase, decrease, 2017, 2018"}
{"_id":"q1a71ad72","title":"","text":"equity raising, Group, 2018, capital markets, fundraising, investment, financial transactions"}
{"_id":"q1a7301c2","title":"","text":"gross carrying value, computer software, financial reporting, intangible assets, amortization, accounting standards, balance sheet, fiscal year, financial analysis"}
{"_id":"q1a71b862","title":"","text":"cash reserves, liquidity, emergency fund, investment opportunities, operational expenses, debt repayment, acquisitions, dividends, financial stability, risk management, short-term obligations, capital expenditures, market downturns, strategic initiatives, company growth"}
{"_id":"q1a71e666","title":"","text":"total revenue, FY19, financial year 2019"}
{"_id":"q1a72f290","title":"","text":"Total Restructuring Reserves, components, financial analysis, liabilities, provisions, company restructuring, accounting standards, financial reporting, balance sheet, cash flow impact, expense recognition, management estimates, fiscal year, financial disclosures."}
{"_id":"q1a73aa78","title":"","text":"share-based compensation, expense, 2018, 2019, financial analysis, total compensation, equity compensation, company performance, stock options, restricted stock units"}
{"_id":"q1a71f41c","title":"","text":"net sales, 2018"}
{"_id":"q1a73a2a8","title":"","text":"reimbursements, annual physical examinations, travel, Mr. Post"}
{"_id":"q1a737f62","title":"","text":"accrued expenses, payables, liabilities, interest payable, wages payable, taxes payable, utilities payable, rent payable, accounts payable, financial reporting, balance sheet, cash flow, accounting period, expense recognition, matching principle"}
{"_id":"q1a72647e","title":"","text":"United States, income, 2019"}
{"_id":"q1a712712","title":"","text":"remuneration, compensation, salary, bonuses, stock options, incentive plans, performance metrics, employee benefits, executive pay, pay equity, corporate governance, shareholder approval, regulatory compliance, financial performance, 2023 compensation trends, incentive structures, pay-for-performance, total rewards strategy"}
{"_id":"q1a72d2ce","title":"","text":"DABP, options, exercised, 2019, weighted average market value, ordinary share"}
{"_id":"q1a733728","title":"","text":"purchase obligations, total contractual obligations, percentage, 2020"}
{"_id":"q1a740e00","title":"","text":"pension settlement charge, 2019, financial reporting, pension liabilities, accounting standards"}
{"_id":"q1a73af6e","title":"","text":"provisions, deferred tax assets, percentage, financial analysis, accounting standards"}
{"_id":"q1a723666","title":"","text":"non-GAAP measures, EBITDA, adjusted earnings, free cash flow, net income, revenue growth, operating income, pro forma results, normalized earnings, financial performance, company valuation, investor analysis, earnings before interest and taxes, adjusted net income, financial metrics, performance indicators"}
{"_id":"q1a73268e","title":"","text":"international sales, percentage change, 2017, 2018"}
{"_id":"q1a73641e","title":"","text":"marketable securities, December 31, 2019, company value"}
{"_id":"q1a733fb6","title":"","text":"Inotera, Micron, DRAM, December 2016, sales, transactions, semiconductor industry, financial performance, revenue, acquisition, partnership, supply agreement."}
{"_id":"q1a72597a","title":"","text":"tax, group share, associates' profits, 2018, % change"}
{"_id":"q1a730bae","title":"","text":"percentage change, net owned property, equipment, September 2018, September 2019"}
{"_id":"q1a732e9a","title":"","text":"stock options, Weighted-Average Exercise Price, Outstanding Options, Warrants, Rights"}
{"_id":"q1a721000","title":"","text":"core beginning balance, June 30, 2019"}
{"_id":"q1a72240a","title":"","text":"long-term debt, payment, financial obligations, liabilities, balance sheet, maturity, interest rates, corporate bonds, debt instruments, amortization"}
{"_id":"q1a711c36","title":"","text":"Restructuring costs, other reserves, fiscal year 2019, fiscal year 2018, financial analysis, accounting, balance sheet, provisions, liabilities, company performance, financial reporting."}
{"_id":"q1a73d3ea","title":"","text":"USA, customers, increase, decrease, 2018, 2019"}
