{"_id":"q1a73c1d4","text":"'Identify the year when interest income exceeded 7,000 thousand.'"}
{"_id":"q1a72ef98","text":"'What was the Net Income or Loss for the year 2019?'"}
{"_id":"q1a716380","text":"'What percentage of Plan Assets were allocated to Other assets in 2019?'"}
{"_id":"q1a73f97e","text":"'What was the service revenue generated from the Americas region in 2019?'"}
{"_id":"q1a731ee6","text":"'What is the customer support renewal rate for the quarter ending June 30, 2019?'"}
{"_id":"q1a729624","text":"Calculate the change in the current portion of Loans due from subsidiaries between 2018 and 2019."}
{"_id":"q1a732468","text":"Calculate the difference in Voyage expenses between the years ended December 31, 2018, and 2019."}
{"_id":"q1a73f24e","text":"Calculate the change in depreciation and amortization from 2018 to 2019."}
{"_id":"q1a714760","text":"Calculate the percentage change in total pretax income from 2018 to 2019."}
{"_id":"q1a72d620","text":"'What were the maintenance revenues for 2018 and 2019?'"}
{"_id":"q1a716fa6","text":"Calculate the percentage change in adjusted EBITDA from 2018 to 2019."}
{"_id":"q1a729854","text":"Identify the additional costs related to the closure of the Overland Park office, excluding restructuring charges."}
{"_id":"q1a738476","text":"Calculate the percentage change in vessel operating expenses from 2018 to 2019."}
{"_id":"q1a7212bc","text":"Calculate the average restructuring costs for the years 2018 and 2019."}
{"_id":"q1a73ceea","text":"Calculate the average net loss for the years 2017 and 2018."}
{"_id":"q1a736734","text":"Calculate the percentage change in the non-controlling interest share of loss from 2018 to 2019."}
{"_id":"q1a71a980","text":"Calculate the percentage change in net earnings from operations between 2018 and 2019."}
{"_id":"q1a719cba","text":"What are the different categories of liabilities in accounting?"}
{"_id":"q1a71659c","text":"What is the typical number of days for trade receivables terms?"}
{"_id":"q1a738908","text":"Calculate the change in the balance for the year 2019."}
{"_id":"q1a734da8","text":"Calculate the percentage change in deferred value from 2018 to 2019."}
{"_id":"q1a71b77c","text":"Calculate the increase in net cash provided by operating activities between 2018 and 2019."}
{"_id":"q1a71ef26","text":"What are the federal net operating loss (NOL) carryforwards for the most recent tax year?"}
{"_id":"q1a72004c","text":"'Count the number of years with a positive net profit, excluding impairment losses.'"}
{"_id":"q1a724868","text":"Identify the four assumptions listed in the provided table."}
{"_id":"q1a713b80","text":"Calculate the change in stock-based compensation from 2018 to 2019."}
{"_id":"q1a721ae6","text":"Calculate the percentage of total revenue from Network Solutions relative to the overall total revenue from all sources."}
{"_id":"q1a728dd2","text":"Calculate the change in average gold prices from 2018 to 2019."}
{"_id":"q1a72559c","text":"Calculate the percentage change in capitalized interest for the year 2019."}
{"_id":"q1a73aa1e","text":"'What is the number of shares of common stock available for future issuance under the Amended and Restated 2004 Stock Incentive Plan as of September 29, 2019?'"}
{"_id":"q1a72a7a4","text":"'Count the number of years when Trade receivables, net were greater than $150 million.'"}
{"_id":"q1a719ee0","text":"What is the US dollar value for 2019 when adjusted for inflation?"}
{"_id":"q1a73e95c","text":"'Count the number of years when adjusted EBITDA was greater than $4,000 million.'"}
{"_id":"q1a72d922","text":"'Determine the number of years in which net financed service contracts exceeded $2,000 million.'"}
{"_id":"q1a722c02","text":"'What were the costs of net revenue for 2019 and 2018?'"}
{"_id":"q1a73887c","text":"'What is the invoicing schedule for customers with multi-year agreements?'"}
{"_id":"q1a711e3e","text":"List the costs included in capital expenditure (CapEx)."}
{"_id":"q1a73028a","text":"Calculate the weighted average estimated life of client relationships in years."}
{"_id":"q1a734010","text":"Calculate the difference in revenue between 2018 and 2017."}
{"_id":"q1a71a1a6","text":"Identify the locations that contributed to the increase in sales in 2019."}
{"_id":"q1a7333cc","text":"Retrieve the inventory figures for the years 2019 and 2018, and present them side by side for comparison."}
{"_id":"q1a714508","text":"'Calculate the change in the amount of Accruals over the specified period.'"}
{"_id":"q1a72decc","text":"Calculate the percentage of Notes Payable and Long-Term Debt relative to Total Contractual Obligations."}
{"_id":"q1a7182c0","text":"Identify the factors that contributed to the decrease in capital expenditures at Bell Media in 2019."}
{"_id":"q1a72ff38","text":"Calculate the percentage change in the 'Other' category from 2018 to 2019."}
{"_id":"q1a730852","text":"Calculate the year-on-year percentage change in VAS revenues for 2019."}
{"_id":"q1a73a7f8","text":"Calculate the percentage change in noncurrent trade accounts receivable, net, from 2018 to 2019."}
{"_id":"q1a72db5c","text":"Calculate the difference between the largest and smallest depreciation expenses."}
{"_id":"q1a74019e","text":"Calculate the average number of devices sold annually from 2017 to 2019."}
{"_id":"q1a72617c","text":"Calculate the change in total compensation from 2018 to 2019."}
{"_id":"q1a734524","text":"'What was the projected benefit obligation amount for 2018?'"}
{"_id":"q1a71d1d0","text":"What are the details and characteristics of the company's senior notes?"}
{"_id":"q1a718324","text":"Identify the segment with the highest percentage change in the capital intensity ratio."}
{"_id":"q1a7200a6","text":"Calculate the percentage change in net profit (excluding impairment) from 2018 to 2019."}
{"_id":"q1a7229dc","text":"Calculate the total change in research and development expenses between 2017 and 2019."}
{"_id":"q1a71f98a","text":"Calculate the percentage change in net carrying value from 2018 to 2019."}
{"_id":"q1a731946","text":"Retrieve the revenue figures for the Board and Systems business in 2019."}
{"_id":"q1a73eb78","text":"'Identify the year with the smallest dividend and interest income.'"}
{"_id":"q1a721c44","text":"Identify the various sources that can provide additional liquidity."}
{"_id":"q1a73aeb0","text":"Rewritten Query: 'What are the conditions for offsetting deferred tax assets and liabilities in accounting?'"}
{"_id":"q1a71c9ba","text":"Calculate the average total franchise costs for the years 2018 and 2019."}
{"_id":"q1a72a088","text":"Calculate the percentage of wireless subscribers relative to the total number of subscribers for the year 2019."}
{"_id":"q1a7375b2","text":"Identify the stock exchange where the common stock with the symbol \"MEI\" is traded."}
{"_id":"q1a723120","text":"Calculate the stock fluctuation by finding the difference between the highest and lowest stock prices in the first quarter of fiscal year 2019."}
{"_id":"q1a73d318","text":"Identify the primary customer segments for the company."}
{"_id":"q1a714e54","text":"Please provide a detailed description of the data in the table for analysis and interpretation."}
{"_id":"q1a71861c","text":"'Provide the goodwill values for the years 2018 and 2019.'"}
{"_id":"q1a72ecaa","text":"Calculate the difference in accrued taxes from 2018 to 2019."}
{"_id":"q1a734f42","text":"Identify the model used for estimating the fair value of Stock Settled Appreciation Rights (SSARs)."}
{"_id":"q1a73bf5e","text":"Calculate the change in Reserves and Accruals from 2018 to 2019."}
{"_id":"q1a739574","text":"Retrieve the total accrued liabilities for the years 2018 and 2019."}
{"_id":"q1a722e0a","text":"'What is the total rent and ancillary payments made by NEXTDC to APDC?'"}
{"_id":"q1a731450","text":"'What was the sequential and year-over-year growth of operating income in September 2019?'"}
{"_id":"q1a72c6e4","text":"Calculate the change in Valuation allowance from 2018 to 2019. What was the difference?"}
{"_id":"q1a726d02","text":"Calculate the proportion of non-amortizing intangible assets to the total gross carrying amount of intangible assets for the year 2018."}
{"_id":"q1a73af14","text":"Define the acronym TWDV and provide its meaning."}
{"_id":"q1a7226ee","text":"Calculate the total charges for the fiscal year 2019."}
{"_id":"q1a7144ae","text":"List the components classified as non-current assets."}
{"_id":"q1a72937c","text":"Calculate the subtotal of value added as a percentage of net sales for fiscal year 2019."}
{"_id":"q1a71dc3e","text":"'What was the change in EMEA revenue over the last reporting period?'"}
{"_id":"q1a72b41a","text":"'Calculate the change in the amount as of 31 December.'"}
{"_id":"q1a73a7c6","text":"Calculate the change in noncurrent trade accounts receivable, net, from 2018 to 2019."}
{"_id":"q1a72522c","text":"Identify the year when charges were included in discontinued operations."}
{"_id":"q1a733fde","text":"What methods were used to raise cash for the Inotera Acquisition, excluding the sale of Micron common stock?"}
{"_id":"q1a7190f8","text":"Calculate the percentage change in Provision for income tax expense (benefit) from 2017 to 2018."}
{"_id":"q1a713e82","text":"Calculate the change in Net Loss from December 31, 2018, to December 31, 2019."}
{"_id":"q1a715958","text":"Determine the amount of unrecognized stock-based compensation expense for unvested employee stock options in 2019."}
{"_id":"q1a72c356","text":"Calculate the change in total debt carrying value, specifying whether it is an increase or decrease."}
{"_id":"q1a734d80","text":"Calculate the change in deferred value from 2018 to 2019. What is the difference?"}
{"_id":"q1a73c224","text":"'Retrieve the interest income data for the year 2019.'"}
{"_id":"q1a73215c","text":"What are the methods for calculating basic and diluted earnings per share (EPS)?"}
{"_id":"q1a7246b0","text":"Calculate the percentage change in income from operations between 2017 and 2018."}
{"_id":"q1a7201f0","text":"'What were the adjusted values for the year 2018?'"}
{"_id":"q1a72105a","text":"Calculate the percentage of total goodwill acquired in fiscal 2019 that is attributed to the purchase of Agiletics, Inc."}
{"_id":"q1a721c6c","text":"Retrieve the net cash from operating activities for the year 2019."}
{"_id":"q1a72b582","text":"'Retrieve the total number of shares of common stock granted in 2018.'"}
{"_id":"q1a730faa","text":"Clarify the income tax benefit in 2019 and its specific context or purpose."}
{"_id":"q1a714f3a","text":"Identify the non-employee director with the highest compensation in 2023."}
{"_id":"q1a71313a","text":"Calculate the change in gross profit from May 2019 to August 2019."}
{"_id":"q1a733a48","text":"Calculate the percentage of total Industrial\/Commercial revenue that comes from AMER."}
{"_id":"q1a724ae8","text":"Calculate the total deferred income for the year 2019."}
{"_id":"q1a714684","text":"'What was the domestic pretax income for the year 2019?'"}
{"_id":"q1a72f31c","text":"Calculate the percentage change in Other liabilities from 2018 to 2019."}
{"_id":"q1a72ceaa","text":"Calculate the total sum of the top three prepaid expenses for the year 2018."}
{"_id":"q1a73a712","text":"'Identify the financial statement where Trade Accounts Receivable, net, current is reported.'"}
{"_id":"q1a723756","text":"Calculate the change in Income Tax Expense (or Benefit) from 2018 to 2019. What is the increase or decrease?"}
{"_id":"q1a73b400","text":"Calculate the percentage change in the number of outstanding shares from the end of 2018 to the end of 2019."}
{"_id":"q1a715d04","text":"Rewritten Query: 'Explain how the disallowance of a shorter deductibility period impacts the annual effective tax rate and accelerates cash payments to the tax authority.'"}
{"_id":"q1a731004","text":"Calculate the average income tax benefit for the years 2018 and 2019."}
{"_id":"q1a7418fa","text":"'Calculate the change in total retail subscribers over the specified period.'"}
{"_id":"q1a721e4c","text":"Retrieve the Gross Accounts Receivables for the years 2019 and 2018."}
{"_id":"q1a72079a","text":"Calculate the change in PSP payments for the Group from 2018 to 2019."}
{"_id":"q1a739fc4","text":"List the years for which the table includes revenue data by geographic region."}
{"_id":"q1a712b04","text":"Calculate the change in level 2 OFA from the end of 2018 to the end of 2019."}
{"_id":"q1a73b3a6","text":"'Provide the total number of shares forfeited in 2019.'"}
{"_id":"q1a731482","text":"'What was the sequential and year-over-year growth of operating income in December 2018?'"}
{"_id":"q1a736e96","text":"Calculate the change in interest income between 2018 and 2019."}
{"_id":"q1a726aaa","text":"Calculate the percentage of revenue from professional services relative to the total revenue in 2018. What is that percentage?"}
{"_id":"q1a73d372","text":"Calculate the percentage of customers from Taiwan in 2019."}
{"_id":"q1a7189aa","text":"Calculate the change in trade payables from 2018 to 2019. What is the difference?"}
{"_id":"q1a71690c","text":"'Identify the year when intangible assets had a negative value.'"}
{"_id":"q1a72e3ae","text":"Identify the year with the highest total of Restricted Share Awards (RSAs) issued."}
{"_id":"q1a7133c4","text":"Calculate the average revenue deferral for the years 2017, 2018, and 2019."}
{"_id":"q1a711452","text":"Calculate the percentage adjustment to the balance of reported prepaid expenses and other current assets."}
{"_id":"q1a716146","text":"Calculate the average cash dividends declared per share for the fiscal years 2017, 2018, and 2019."}
{"_id":"q1a72506a","text":"Calculate the average number of potential common shares excluded from diluted net loss per share for the years 2017, 2018, and 2019."}
{"_id":"q1a72a218","text":"'What was the company's ranking in 2019 according to the Taiwan Stock Exchange and Taipei Exchange?'"}
{"_id":"q1a728396","text":"Calculate the percentage change in the total amortization of purchased intangible assets from 2018 to 2019."}
{"_id":"q1a726154","text":"'Compare the share-based payments for each year to identify which year had the larger amount.'"}
{"_id":"q1a72e386","text":"Calculate the average value of Restricted Share Awards (RSAs) for the fiscal years 2017, 2018, and 2019."}
{"_id":"q1a73698c","text":"Calculate the percentage change in Other non-current assets from 2018 to 2019."}
{"_id":"q1a723918","text":"What factors contributed to the $76.3 million increase in subscription revenue from 2017 to 2018?"}
{"_id":"q1a71634e","text":"'What was the target allocation percentage for Equity Securities in 2020?'"}
{"_id":"q1a73221a","text":"Calculate the average net income attributable to noncontrolling interest for the years 2017, 2018, and 2019."}
{"_id":"q1a73bf0e","text":"'List the components of deferred tax assets and their respective counts.'"}
{"_id":"q1a72c37e","text":"'Calculate the increase in the company's debt value resulting from a 1% decrease in the interest rate in 2019.'"}
{"_id":"q1a73a9c4","text":"Identify the groups of people typically granted Nonvested Restricted Stock Units (RSUs)."}
{"_id":"q1a740612","text":"Calculate the percentage of total inventory purchases accounted for by Supplier A in 2019."}
{"_id":"q1a713194","text":"Calculate the percentage change in net revenue from November 2018 to February 2019."}
{"_id":"q1a720024","text":"Identify the components included in the reconciliation to net profit or loss for the year, specifically when calculating net profit or loss excluding impairment."}
{"_id":"q1a72ac68","text":"'What were the total sales figures for the year 2019?'"}
{"_id":"q1a717ffa","text":"'What were the respective APRU values from off-net for the years 2017 and 2018?'"}
{"_id":"q1a717dfc","text":"Calculate the change in shareholder distributions (dividends) from 2018 to 2019."}
{"_id":"q1a7146de","text":"Rewritten Query: 'Explain the data and significance of the table provided.'"}
{"_id":"q1a730956","text":"Calculate the year-on-year change in revenue for the Online Advertising Business."}
{"_id":"q1a73bc34","text":"Identify the country where the FSRU (Floating Storage and Regasification Unit) terminal is located."}
{"_id":"q1a713af4","text":"'What was the Gross Profit from Continuing Operations reported in 2019?'"}
{"_id":"q1a74165c","text":"Calculate the average number of shares owned by Brian Kinion and Christopher Lien."}
{"_id":"q1a71ae3a","text":"Calculate the average contract value for future equity issues."}
{"_id":"q1a73c724","text":"Identify the type of total operating revenues with the highest dollar change."}
{"_id":"q1a727054","text":"Calculate the income tax obligations as a percentage of total contractual obligations."}
{"_id":"q1a72cc98","text":"Calculate the average performance shares for the years 2017, 2018, and 2019."}
{"_id":"q1a74066c","text":"Calculate the percentage change in inventory purchases from Supplier B between 2017 and 2018."}
{"_id":"q1a72b35c","text":"Rewritten Query: 'What categories or programs include government grants?'"}
{"_id":"q1a71fdea","text":"'What was the basic net income per weighted-average share for VMware, Inc. common stockholders (Classes A and B) in Q2 2020?'"}
{"_id":"q1a73d39a","text":"Calculate the change in the number of customers from Taiwan between 2018 and 2019."}
{"_id":"q1a71965c","text":"Identify the factors that contributed to the decrease in net earnings share for Golar Partners."}
{"_id":"q1a72027c","text":"'Compare the total financial assets for each year to identify which year had a larger amount.'"}
{"_id":"q1a72772a","text":"'What are the sitting fees for O P Bhatt when attending board or committee meetings?'"}
{"_id":"q1a72d8c8","text":"'What were the net lease receivables for the year 2019?'"}
{"_id":"q1a73088e","text":"'Explain the year-on-year revenue change for FinTech and Business Services, including the reasons behind the increase or decrease.'"}
{"_id":"q1a7280b2","text":"Calculate the difference in long-term debt obligations between the 'less than 1 year' and '1-3 years' categories."}
{"_id":"q1a73a776","text":"Identify the different types of accounts included in the Company's trade accounts receivable."}
{"_id":"q1a71c014","text":"Calculate the percentage of customer A's accounts receivable relative to their revenue in 2019. What is the formula and the resulting value?"}
{"_id":"q1a73b75c","text":"'Determine the number of years when the weighted-average interest rate was greater than 3%.'"}
{"_id":"q1a738e9e","text":"'List the years for which data is provided in the table.'"}
{"_id":"q1a7329b8","text":"Calculate the nominal difference in total cash dividends paid between 2018 and 2019."}
{"_id":"q1a7269c4","text":"'Retrieve the total revenue figures for the years 2017 and 2018, specifying each year's amount.'"}
{"_id":"q1a72ced2","text":"Calculate the percentage change in the amount of prepaid services from 2018 to 2019."}
{"_id":"q1a71bb32","text":"'What are the company's expectations regarding additional restructuring expenses in future periods?'"}
{"_id":"q1a735ec4","text":"Identify the factors that led to the decrease in total revenue from 2018 to 2019."}
{"_id":"q1a716678","text":"Calculate the percentage change in past due but not impaired receivables that are over 2 months overdue from 2018 to 2019."}
{"_id":"q1a712e6a","text":"Calculate the average individual payout amount for fiscal year 2019 (FY19)."}
{"_id":"q1a71f76e","text":"Calculate the percentage change in free cash flow for the specified period."}
{"_id":"q1a734560","text":"'What was the Accumulated Benefit Obligation (ABO) for the year 2019?'"}
{"_id":"q1a7196b6","text":"'Calculate the change in ownership interest in Golar Partners from 2018 to 2019.'"}
{"_id":"q1a73a014","text":"Calculate the change in revenue from South America between 2017 and 2018."}
{"_id":"q1a721316","text":"Calculate the percentage change in total costs from 2018 to 2019."}
{"_id":"q1a7412f6","text":"'What was the total value of buildings and improvements in 2019?'"}
{"_id":"q1a7383ea","text":"'What were the vessel operating expenses for 2018 and 2019?'"}
{"_id":"q1a71d932","text":"What components are included in wages and salaries?"}
{"_id":"q1a72acfe","text":"'Identify the year with the highest recorded amount for the Rest of World.'"}
{"_id":"q1a73c17a","text":"Calculate the change in interest expense from 2018 to 2019."}
{"_id":"q1a718ca2","text":"Calculate the percentage change in net income between 2018 and 2019."}
{"_id":"q1a725948","text":"Identify the associate that contributed the highest amount to Singtel's group share of associates' post-tax profits in 2019."}
{"_id":"q1a741350","text":"'Determine the number of years when the value of Machinery and Equipment was greater than $200,000 thousand.'"}
{"_id":"q1a719f6c","text":"Calculate the change in Dividend Paid per Ordinary Share in euros from 2015 to 2016."}
{"_id":"q1a724f7a","text":"'What were the respective amounts of convertible senior notes issued in 2017 and 2018?'"}
{"_id":"q1a724976","text":"'Compare the expected volatility of the years 2018 and 2019 to identify which year had lower volatility at year-end.'"}
{"_id":"q1a73e574","text":"Rewritten Query: 'Explain the assignment of other financial income and expenses from financial instruments.'"}
{"_id":"q1a7159bc","text":"What is the expected duration for recognizing unrecognized stock-based compensation expenses for unvested RSUs?"}
{"_id":"q1a72412e","text":"'What was the contribution of 28nm and smaller technologies to the semiconductor market in 2019?'"}
{"_id":"q1a71ab4c","text":"List the different types of provisions included in post-employment benefits plans."}
{"_id":"q1a735ef6","text":"'Provide the total revenue figures for the year 2019.'"}
{"_id":"q1a73339a","text":"List the employee benefits for the years 2019 and 2018, specifying the differences between the two years."}
{"_id":"q1a738f7a","text":"Calculate the total percentage change in the provision for income taxes from 2017 to 2019."}
{"_id":"q1a7349d4","text":"'Calculate the increase in revenue for the specified period.'"}
{"_id":"q1a72fe3e","text":"'What was the valuation allowance for deferred tax assets in 2019?'"}
{"_id":"q1a720768","text":"'Compare the PSP payments for the Group across different years to identify the year with the largest amount.'"}
{"_id":"q1a735ac8","text":"'Calculate the total number of shares purchased in fiscal years 2018 and 2019 separately.'"}
{"_id":"q1a72128a","text":"Calculate the increase in costs for closed restaurants and other related expenses from 2018 to 2019."}
{"_id":"q1a7241e2","text":"Calculate the percentage that 90 nanometers represents of the total in 2019."}
{"_id":"q1a73efba","text":"'Identify the years when the risk-free rate of return exceeded 2.0%.'"}
{"_id":"q1a7342e0","text":"'Retrieve the total operating expenses for fiscal years 2018 and 2019, and compare the amounts for each year.'"}
{"_id":"q1a73d67e","text":"Calculate the percentage change in shares balance between 30 June 2018 and 30 June 2019."}
{"_id":"q1a723c10","text":"Calculate the percentage change in total income from 2018 to 2019."}
{"_id":"q1a71555c","text":"Calculate the percentage change in total property and equipment from 2018 to 2019."}
{"_id":"q1a718cd4","text":"Calculate the percentage change in convertible notes from 2018 to 2019."}
{"_id":"q1a72d35a","text":"'Compare the size of dividend shares awarded in different years to identify the year with the largest amount.'"}
{"_id":"q1a7410f8","text":"Retrieve the non-equity incentive target amounts for Robert Dooley and Eric Lerner."}
{"_id":"q1a731630","text":"Rewritten Query: 'Explain the recognition of deferred income for contracts with a duration longer than one year.'"}
{"_id":"q1a72856c","text":"What is the formula for calculating market value?"}
{"_id":"q1a71d73e","text":"Calculate the total amortization for cloud services and license support agreements, along with related relationships, for the year 2018."}
{"_id":"q1a71e63e","text":"Retrieve the total other income figures for the years 2019 and 2018, and present them separately."}
{"_id":"q1a735b4a","text":"Calculate the percentage change in the average price paid per share from fiscal year 2018 to 2019."}
{"_id":"q1a727da6","text":"'Retrieve the Technology Development revenue figures for 2019 and 2018.'"}
{"_id":"q1a71d9be","text":"'Compare the personnel expenses for each year to identify which year had the larger amount.'"}
{"_id":"q1a72b1cc","text":"'Compare the sizes of Webzone across different years to identify the year when it was largest.'"}
{"_id":"q1a72cdf6","text":"What information is provided in Note 4?"}
{"_id":"q1a726442","text":"What was the valuation allowance for the company's deferred tax asset related to U.S. foreign tax credits in 2018?"}
{"_id":"q1a71e080","text":"'What was the net cash provided by operating activities for the year 2017?'"}
{"_id":"q1a723e72","text":"Calculate the change in Cash Flow from Operating Activities between 2018 and 2019."}
{"_id":"q1a7171f4","text":"'Identify the oldest executive officer currently in the company.'"}
{"_id":"q1a72f0a6","text":"Calculate the percentage change in basic Earnings (loss) per share from 2018 to 2019."}
{"_id":"q1a718090","text":"Calculate the percentage change in off-net APRU from 2017 to 2018."}
{"_id":"q1a731694","text":"What are the various contract lengths for which the Group recognizes revenue upon fulfilling remaining performance obligations?"}
{"_id":"q1a721082","text":"Calculate the average ending carrying amount of goodwill for the payment segment in 2018 and 2019."}
{"_id":"q1a7215b4","text":"Calculate the percentage change in software license revenue from 2018 to 2019."}
{"_id":"q1a7312ca","text":"Calculate the percentage change in Notes Receivable and Other Non-Current Assets from 2018 to 2019."}
{"_id":"q1a72de4a","text":"What are the components of non-cancelable purchase order obligations?"}
{"_id":"q1a72de18","text":"What components make up future interest on notes payable and long-term debt?"}
{"_id":"q1a73033e","text":"Calculate the difference in gross carrying value between Trade Names and Non-compete agreements."}
{"_id":"q1a718cfc","text":"'Identify the year with the highest diluted average shares outstanding.'"}
{"_id":"q1a717fc8","text":"Retrieve the respective Average Revenue Per User (ARPU) for on-net services in 2017 and 2018."}
{"_id":"q1a73a366","text":"Calculate the total amount of all other compensation received by the directors listed in the table."}
{"_id":"q1a73aee2","text":"Identify the two primary metrics represented in this table."}
{"_id":"q1a71cec4","text":"'Retrieve the total cash paid for interest in the year 2017.'"}
{"_id":"q1a73c6f2","text":"Calculate the percentage change in External service revenues from 2018 to 2019."}
{"_id":"q1a722464","text":"Calculate the percentage of total claims payable relative to total contractual obligations."}
{"_id":"q1a720fce","text":"'Identify the financial year represented in the provided table.'"}
{"_id":"q1a72f7a4","text":"Calculate the percentage increase in revenue for the EMEA and Americas regions from 2018 to 2019."}
{"_id":"q1a732c38","text":"Calculate the change in Noncurrent assets from 2018 to 2019, specifying whether it is an increase or decrease."}
{"_id":"q1a7226bc","text":"List the fiscal years represented in the table."}
{"_id":"q1a712dac","text":"Did the Compensation Committee reduce any FY19 EAIP payouts?"}
{"_id":"q1a720d6c","text":"Calculate the percentage change in research and development credits, net of uncertain tax positions, from 2018 to 2019."}
{"_id":"q1a7305e6","text":"Calculate the difference in amortization expense from 2017 to 2018."}
{"_id":"q1a71f962","text":"Calculate the change in net carrying value from 2018 to 2019."}
{"_id":"q1a715502","text":"'List the categories of items in property and equipment for the years 2018 and 2019, and count the total number of categories for each year.'"}
{"_id":"q1a73a2da","text":"'What is the end date for the terms of the non-returning directors?'"}
{"_id":"q1a71765e","text":"Identify the two types of revenue recognized from contracts with customers."}
{"_id":"q1a738c3c","text":"Calculate the change in the federal statutory tax provision (benefit) from 2018 to 2019."}
{"_id":"q1a72c090","text":"Identify the factors that led to the increase in net cash used in investing activities."}
{"_id":"q1a716ee8","text":"'Retrieve the net income figures for the year 2019.'"}
{"_id":"q1a734ab0","text":"Calculate the average operating income for the fiscal years 2017 and 2018."}
{"_id":"q1a7370f8","text":"Calculate the change in revenue in Ireland from 2018 to 2019."}
{"_id":"q1a73e8a8","text":"'Retrieve the net income figures for the year 2015.'"}
{"_id":"q1a73f500","text":"Calculate the average annual ending balance of unrecognized tax benefits."}
{"_id":"q1a73841c","text":"Calculate the average voyage revenue for the years 2018 and 2019."}
{"_id":"q1a723e4a","text":"Calculate the percentage change in cash and cash equivalents from the beginning of 2018 to the beginning of 2019."}
{"_id":"q1a71f4d0","text":"Calculate the average Gross Profit for the fiscal years ending April 28, 2018, and April 29, 2017."}
{"_id":"q1a7236ca","text":"Define EBITDA and explain its significance in financial analysis."}
{"_id":"q1a731036","text":"Identify the year when the income tax benefit was less than -10,000 thousand dollars."}
{"_id":"q1a723972","text":"'What was the Total Revenue for the year 2019?'"}
{"_id":"q1a716b32","text":"What was the income tax benefit amount for individuals in 2018?"}
{"_id":"q1a72d0ee","text":"Identify the year with the lowest recorded interest income."}
{"_id":"q1a735b7c","text":"Identify the fiscal year with the highest total shares purchased."}
{"_id":"q1a71e918","text":"'What was the capitalized amount for the Company’s U.S. build-to-suit facility as of March 31, 2018?'"}
{"_id":"q1a711416","text":"Retrieve the balances of inventories and other accrued liabilities (in millions) without the adoption of Topic 606."}
{"_id":"q1a719f9e","text":"Calculate the percentage change in Dividend Paid per Ordinary Share in euros from 2015 to 2016."}
{"_id":"q1a71ec1a","text":"Calculate the change in Disposals from 2018 to 2019."}
{"_id":"q1a726a00","text":"Calculate the revenue increase from subscriptions, returns, and professional services between 2017 and 2018."}
{"_id":"q1a72216c","text":"Calculate the average research and development expenses for the years 2017 and 2018."}
{"_id":"q1a72277a","text":"Calculate the difference in Acquisition-related costs between fiscal year 2019 and fiscal year 2018."}
{"_id":"q1a72d6ac","text":"Calculate the percentage of maintenance-related revenue compared to total software-related revenues for the year 2019."}
{"_id":"q1a73f4d8","text":"Calculate the Beginning balance of unrecognized tax benefits as a percentage of the Ending balance for 2019."}
{"_id":"q1a7193fa","text":"Calculate the percentage increase in PSAs granted from 2017 to 2019."}
{"_id":"q1a729ade","text":"Calculate the average percentage of net revenues for the years 2018 and 2019."}
{"_id":"q1a733cb4","text":"Calculate the percentage change in the fair value of restricted stock units that vested from 2018 to 2019."}
{"_id":"q1a71b56a","text":"Calculate the change in compensation from 2018 to 2019."}
{"_id":"q1a71986e","text":"'What were the cash and cash equivalents for the year 2019?'"}
{"_id":"q1a7230c6","text":"'What date did the company regain compliance with OTCQB regulations?'"}
{"_id":"q1a720452","text":"List the investing activities that generate cash inflows."}
{"_id":"q1a7386c4","text":"Calculate the percentage of leasehold improvements in 2019 relative to the total property equipment, excluding depreciation, amortization, and fixed assets not in service."}
{"_id":"q1a73ca30","text":"'What percentage of the total compensation for the Board of Directors in the fiscal year ending June 30, 2017, was made up of cash remuneration?'"}
{"_id":"q1a71549e","text":"Please provide the details or summary of Note 5."}
{"_id":"q1a726c12","text":"List the components that make up non-amortizing intangible assets."}
{"_id":"q1a71de32","text":"List the components that are included in the calculation of total inventories."}
{"_id":"q1a740e82","text":"Calculate the average interest cost for the years 2017, 2018, and 2019."}
{"_id":"q1a73eb46","text":"'List the years when dividend and interest income was calculated.'"}
{"_id":"q1a73b158","text":"'What was the total cost of internally-developed software in 2019?'"}
{"_id":"q1a736766","text":"'Identify the year with the highest loss among the available data.'"}
{"_id":"q1a7364a0","text":"Calculate the net value of unrealized gains and losses for the company's municipal bonds."}
{"_id":"q1a739a9c","text":"'What is the count of gross receivables that exceed $4,000 million?'"}
{"_id":"q1a715534","text":"Calculate the percentage of \"Equipment and software\" in relation to the total property and equipment for the year 2019, excluding depreciation."}
{"_id":"q1a71a926","text":"Identify the year with the smallest percentage difference between basic and diluted net earnings per share."}
{"_id":"q1a72494e","text":"Calculate the average risk-free interest rate for the years 2018 and 2019."}
{"_id":"q1a71e8e6","text":"'What was the capitalized amount for the Company’s U.S. build-to-suit facility as of March 31, 2019?'"}
{"_id":"q1a72f2ea","text":"Calculate the change in Other liabilities from 2018 to 2019."}
{"_id":"q1a71d16c","text":"What is the date when Roper entered into a five-year unsecured credit facility worth $2.5 billion?"}
{"_id":"q1a71e6c0","text":"Calculate the percentage change in total revenue from 2018 to 2019."}
{"_id":"q1a733188","text":"Calculate the change in the risk-free interest rate from 2018 to 2019."}
{"_id":"q1a72a970","text":"What does the loss from discounted operations indicate in financial terms?"}
{"_id":"q1a720c7c","text":"'What was the company's valuation allowance for the year 2018?'"}
{"_id":"q1a711844","text":"Calculate the percentage change in total expenses from 2017 to 2018."}
{"_id":"q1a712a82","text":"What is the value of Level 1 FVOCI as of December 31, 2019?"}
{"_id":"q1a72c11c","text":"Calculate the percentage change in cash from investing activities."}
{"_id":"q1a741ba2","text":"Calculate the percentage change in raw materials and supplies from 2018 to 2019."}
{"_id":"q1a736298","text":"Calculate the average annual number of shares of restricted stock outstanding for the years ending June 30, 2018, and June 30, 2019."}
{"_id":"q1a73c1fc","text":"'Retrieve the interest expense for the year 2019.'"}
{"_id":"q1a7214e2","text":"'What was the amount of long-term deferred revenue in 2018?'"}
{"_id":"q1a741120","text":"Calculate the total non-equity incentive target amounts for all 5 Named Executive Officers (NEOs) in 2019."}
{"_id":"q1a71242e","text":"What are the provisions for uncertain tax positions and how do they apply in tax accounting?"}
{"_id":"q1a7241ba","text":"Calculate the average value of 40 nanometers."}
{"_id":"q1a72f772","text":"Calculate the total revenue from hardware, cloud, and license businesses for the year 2018."}
{"_id":"q1a740bc6","text":"Calculate the change in net cash provided by (used in) operating activities from 2018 to 2019."}
{"_id":"q1a735f50","text":"Calculate the proportion of net income to gross margin for the company in 2017."}
{"_id":"q1a72bc30","text":"'What was the decrease in depreciation for the year 2019?'"}
{"_id":"q1a711bdc","text":"Calculate the average annual total assets for both fiscal years."}
{"_id":"q1a7217d0","text":"What is the structure of the surcharge mechanism?"}
{"_id":"q1a71b59c","text":"Calculate the percentage change in Gross deferred income tax assets from 2018 to 2019."}
{"_id":"q1a732f1c","text":"Calculate the total value of outstanding options and warrants under the Amended and Restated 2010 Share Incentive Plan."}
{"_id":"q1a7217f8","text":"'List the years for which gross margin data is available.'"}
{"_id":"q1a72446c","text":"Calculate the percentage change in consolidated Innovation Center expenditure from FY 2018 to FY 2019."}
{"_id":"q1a73fa0a","text":"Determine the number of years in which service revenue from APJC was greater than $1,500 million."}
{"_id":"q1a7298e0","text":"Calculate the percentage of the 2017 restructuring charges relative to the total of 2017 goodwill impairment and restructuring charges."}
{"_id":"q1a712794","text":"Calculate the ratio of the actual group operating profit to the target group operating profit for the year 2019."}
{"_id":"q1a71ada4","text":"List the new stapled securities issued in 2018 and 2019."}
{"_id":"q1a71c8e8","text":"Calculate the increase in franchise rental revenues for the year 2019."}
{"_id":"q1a733138","text":"'Calculate the total number of warrants issued by the company.'"}
{"_id":"q1a71ab7e","text":"'Compare the employer's commitments for post-employment benefits plans across different years to identify which year had larger provisions.'"}
{"_id":"q1a722950","text":"Identify the years that are included in the comparison table."}
{"_id":"q1a73bcb6","text":"Calculate the percentage change in other non-current assets from 2018 to 2019."}
{"_id":"q1a72c144","text":"Calculate the average cash flow from financing activities for the specified period."}
{"_id":"q1a7176b8","text":"Calculate the decrease in total licensing revenue from 2018 to 2019. What was the amount of the decrease?"}
{"_id":"q1a730fdc","text":"'What were the percentages of pre-tax loss for 2019 and 2018?'"}
{"_id":"q1a73240e","text":"What do TCE revenues indicate or signify?"}
{"_id":"q1a733458","text":"Identify the year with the highest total deferred tax asset amount."}
{"_id":"q1a728058","text":"'Calculate the total contractual obligations with payments due within the next year.'"}
{"_id":"q1a740112","text":"What is the definition of 'Devices sold' in sales metrics?"}
{"_id":"q1a71b4e8","text":"'What was the amount of net operating loss carryforwards in 2019?'"}
{"_id":"q1a7189fa","text":"'Calculate the change in GST and employment taxes payable from 2018 to 2019.'"}
{"_id":"q1a7412ce","text":"List the years for which the table includes data on the company's Property, Plant, and Equipment."}
{"_id":"q1a734786","text":"Calculate the percentage of total revenues that general and administrative expenses represent for each of the last three financial year ends, listed in chronological order."}
{"_id":"q1a73e98e","text":"Calculate the percentage change in interest expense from 2015 to 2016."}
{"_id":"q1a736478","text":"'What are the unrealized gains for the company's municipal bonds and corporate bonds?'"}
{"_id":"q1a73b126","text":"'Calculate the increase in Research and Development expenses for the year 2019.'"}
{"_id":"q1a718658","text":"'Provide the net recognized amounts of identifiable assets acquired and liabilities assumed for the years 2018 and 2019.'"}
{"_id":"q1a728512","text":"Calculate the proportion of finished goods value to total inventories for the year 2019."}
{"_id":"q1a73141e","text":"'What is the sequential and year-over-year growth of operating income for the fourth quarter?'"}
{"_id":"q1a713b58","text":"Calculate the change in Gross Profit from Continuing Operations between 2018 and 2019."}
{"_id":"q1a7375e4","text":"Calculate the change in the First Quarter high price from the fiscal year ending April 28, 2018, to the fiscal year ending April 27, 2019."}
{"_id":"q1a72be74","text":"Calculate the percentage change in sales and marketing expenses from 2018 to 2019."}
{"_id":"q1a718c66","text":"What items are excluded from the calculation of diluted shares outstanding?"}
{"_id":"q1a733480","text":"Calculate the difference in inventory value between 2018 and 2019."}
{"_id":"q1a73beb4","text":"Calculate the net change in the total valuation allowance for the year ending December 31, 2019."}
{"_id":"q1a73931c","text":"What items are excluded from the definition of non-current assets?"}
{"_id":"q1a71f282","text":"Calculate the operating income difference between APAC and AMER for the year 2019."}
{"_id":"q1a721e9c","text":"Retrieve the Allowance for Returns and Doubtful Accounts for the years 2019 and 2018, and compare the values for both years."}
{"_id":"q1a72b9b0","text":"Calculate the sum of the three highest carrying values in USD for the year 2018."}
{"_id":"q1a73951a","text":"'Calculate the accrued interest for the years 2018 and 2019 separately.'"}
{"_id":"q1a7121a4","text":"What details are included in note 3?"}
{"_id":"q1a71870c","text":"Calculate the percentage change in equipment notes payable from 2018 to 2019."}
{"_id":"q1a714c74","text":"Calculate the average revenue from Europe for the years 2018 and 2019."}
{"_id":"q1a719c24","text":"'Identify the year associated with the data presented in the table.'"}
{"_id":"q1a7159e4","text":"Retrieve the total stock-based compensation expense and the unrecognized stock-based compensation expense for the year 2019."}
{"_id":"q1a713eaa","text":"Calculate the change in the weighted average common shares, basic, from December 31, 2018, to December 31, 2019."}
{"_id":"q1a72bef6","text":"Calculate the average sales and marketing expenses for the years 2018 and 2019."}
{"_id":"q1a72ce28","text":"Identify the financial statement section that includes impairment charges for prepaid licenses and production tooling."}
{"_id":"q1a73ff3c","text":"Calculate the percentage of depreciation and amortization relative to EBITDA for the fiscal year 2019 (F19)."}
{"_id":"q1a722b44","text":"Identify the factors that caused the decrease in gross profit percentage for the year ending December 31, 2019."}
{"_id":"q1a71683a","text":"What do deferred income taxes indicate about a company's financial position?"}
{"_id":"q1a71a8cc","text":"'List the years for which earnings per share (EPS) data is available.'"}
{"_id":"q1a712488","text":"Calculate the balance change from January 1, 2018, to January 1, 2019."}
{"_id":"q1a71968e","text":"'Compare the share of net (losses)\/earnings in other affiliates for each year to identify which year had a higher value.'"}
{"_id":"q1a720952","text":"What was the total compensation expense for performance-based, service-based, and market-based RSUs for the year ending December 31, 2019?"}
{"_id":"q1a725efc","text":"Calculate the average current portion of deferred revenue for the years 2018 and 2019."}
{"_id":"q1a7253b2","text":"Calculate the average total charges over the past three years."}
{"_id":"q1a7126ae","text":"'What exclusions are noted in the figures presented in the table?'"}
{"_id":"q1a7395a6","text":"Calculate the total accrued liabilities for the years 2018 and 2019."}
{"_id":"q1a731eb4","text":"'List the end dates for each fiscal year in various countries or organizations.'"}
{"_id":"q1a73b9d2","text":"'Compare the total amounts of restricted stock and restricted stock unit awards granted in each year to identify which year had a larger total.'"}
{"_id":"q1a7198fa","text":"Calculate the change in restricted cash from 2018 to 2019."}
{"_id":"q1a72f7d6","text":"'What factors contributed to the increase in total operating expenses from fiscal 2018 to fiscal 2019?'"}
{"_id":"q1a71d46e","text":"'List the years for which the table shows changes in the components of accumulated other comprehensive income (AOCI).'"}
{"_id":"q1a71f6b0","text":"'What was the total amount of tax paid in 2019?'"}
{"_id":"q1a71a69c","text":"Calculate the change in the provision for doubtful receivables from 2018 to 2019."}
{"_id":"q1a73a38e","text":"Calculate the average total compensation for non-returning directors."}
{"_id":"q1a7195f8","text":"'List the years in which equity in net earnings of affiliates was recorded.'"}
{"_id":"q1a71b13c","text":"Identify the factors contributing to the increase in General and Administrative expenses."}
{"_id":"q1a729dc2","text":"Calculate the ratio of total revenue in 2018 to total revenue in 2017."}
{"_id":"q1a71fb2e","text":"'What factors contributed to the increase in accrued revenue from 2018 to 2019?'"}
{"_id":"q1a717e24","text":"Calculate the average total employee expenditure for the years 2018 and 2019."}
{"_id":"q1a721f00","text":"What is the total amount received by the company from the note receivable related to the sale of a product line in 2005?"}
{"_id":"q1a7418a0","text":"Calculate the percentage change in retail satellite TV net customer losses between 2018 and 2019."}
{"_id":"q1a718680","text":"'What are the equipment notes payable amounts for the years 2018 and 2019?'"}
{"_id":"q1a721f5a","text":"Calculate the percentage change in Gross accounts receivables from 2018 to 2019."}
{"_id":"q1a716416","text":"Calculate the difference in target allocations between Debt Securities and Other Assets for the year 2020."}
{"_id":"q1a71c988","text":"Calculate the difference in total franchise revenues between 2018 and 2019."}
{"_id":"q1a72958e","text":"'Provide the repayment schedule details for the loan, including payment amounts and due dates.'"}
{"_id":"q1a715728","text":"What do sales-related reserves indicate in financial terms?"}
{"_id":"q1a71f73c","text":"'Calculate the change in free cash flow over the specified period.'"}
{"_id":"q1a71efb2","text":"'Identify the year when the AMT credit was less than $10,000.'"}
{"_id":"q1a72b226","text":"Calculate the percentage change in Webzone's value from 2018 to 2019."}
{"_id":"q1a716934","text":"Calculate the change in Other non-current deferred tax assets from 2018 to 2019."}
{"_id":"q1a73d5c0","text":"'Retrieve the total balance of ordinary shares as of 30 June 2018.'"}
{"_id":"q1a72a2fe","text":"Calculate the change in the 'Others' category from 2017 to 2018, specifying whether it is an increase or decrease."}
{"_id":"q1a721550","text":"'What are the incremental costs that can be capitalized when obtaining a contract?'"}
{"_id":"q1a73406a","text":"Calculate the percentage of Micron's total shareholders' equity relative to its total equity in 2019."}
{"_id":"q1a73edf8","text":"Calculate the percentage change in Pro forma revenues from 2018 to 2019."}
{"_id":"q1a720074","text":"Calculate the change in net profit or loss for the year 2019 compared to 2018, excluding impairment."}
{"_id":"q1a729822","text":"Retrieve the restructuring charges for the years 2018 and 2017, and provide the amounts for each year."}
{"_id":"q1a724386","text":"Please provide a detailed description of the data in the table for analysis and interpretation."}
{"_id":"q1a721cf8","text":"Calculate the percentage change in cash and short-term marketable securities from 2018 to 2019."}
{"_id":"q1a7351f4","text":"Calculate the change in Proceeds from the issuance of shares from 2017 to 2018."}
{"_id":"q1a71e134","text":"Calculate the percentage change in net increase of cash, cash equivalents, and restricted cash from 2018 to 2019."}
{"_id":"q1a73d624","text":"List the dates on which shares were issued."}
{"_id":"q1a7316bc","text":"'Identify the year in which the revenue recognized from remaining performance obligations in contracts was greater.'"}
{"_id":"q1a72a6e6","text":"Retrieve the billed trade receivables data for the year 2019."}
{"_id":"q1a734cf4","text":"'What factors can cause fluctuations in tax rates?'"}
{"_id":"q1a7295ca","text":"Retrieve the non-current portion of loans due from subsidiaries for the years 2018 and 2019."}
{"_id":"q1a73cf44","text":"Calculate the percentage change in net loss from 2018 to 2019."}
{"_id":"q1a72650a","text":"Calculate the percentage change in income from foreign countries between 2018 and 2019."}
{"_id":"q1a73f1f4","text":"Identify the factors contributing to the increase in depreciation and amortization expenses."}
{"_id":"q1a7157be","text":"'Count the number of years when accrued expenses and other liabilities were greater than $200 million.'"}
{"_id":"q1a72e520","text":"Calculate the increase in amortization of intangible assets from 2018 to 2019."}
{"_id":"q1a727ce8","text":"Identify the two reportable segments of operations for the company."}
{"_id":"q1a739150","text":"Identify the regions where information on accumulated benefit obligation is available."}
{"_id":"q1a734d4e","text":"'Compare the total deferred tax assets for each year to identify the year with the largest amount.'"}
{"_id":"q1a711baa","text":"List the fiscal years represented in the table."}
{"_id":"q1a728b5c","text":"'What was the total revenue generated from Security services in 2018?'"}
{"_id":"q1a714440","text":"'What was the total amount of government grants included in payments received on account for the year 2018?'"}
{"_id":"q1a71d554","text":"Calculate the percentage change in the total balance from 2017 to 2018."}
{"_id":"q1a73690a","text":"Retrieve the total amount of Other assets for the year 2018."}
{"_id":"q1a713784","text":"'Calculate the total amount of Other purchase obligations and commitments.'"}
{"_id":"q1a71a958","text":"Calculate the change in net earnings from operations between 2018 and 2019."}
{"_id":"q1a73a334","text":"Identify the non-returning director with the lowest total compensation."}
{"_id":"q1a71546c","text":"'List the years covered in the note on net property and equipment.'"}
{"_id":"q1a72a4b6","text":"Identify the assets with non-material adjusted carrying values."}
{"_id":"q1a73cc7e","text":"Calculate the difference in warranty reserve from the beginning to the end of 2017."}
{"_id":"q1a7141b6","text":"Calculate the percentage change in the share of net earnings from other affiliates between 2017 and 2018."}
{"_id":"q1a728364","text":"'Calculate the change in amortization of purchased intangible assets from 2017 to 2018.'"}
{"_id":"q1a714738","text":"Calculate the change in domestic pretax income from 2017 to 2018."}
{"_id":"q1a72c0ea","text":"Calculate the change in cash from operating activities between 2018 and 2019. What was the increase or decrease?"}
{"_id":"q1a73e628","text":"Calculate the change in Other Financial Income from 2017\/2018 to 2018\/2019."}
{"_id":"q1a73433a","text":"Calculate the proportion of investor relations and consultants to total operating expenses for the year 2019."}
{"_id":"q1a737a4e","text":"Calculate the average total operating expenses for the years 2017 and 2018."}
{"_id":"q1a731504","text":"Calculate the change in Operating Income from December 31, 2018, to December 31, 2019, indicating whether it is an increase or decrease."}
{"_id":"q1a73ce90","text":"'What were the net losses for the years 2018 and 2019?'"}
{"_id":"q1a71cb72","text":"What is the cost of living indexation rate and what factors does it apply to?"}
{"_id":"q1a73e34e","text":"Calculate the percentage change in Activision's segment operating income from 2018 to 2019."}
{"_id":"q1a72775c","text":"Calculate the total commission percentage based on the Ceiling specified in Section 198 of the Companies Act."}
{"_id":"q1a7223d8","text":"Calculate the total amount due for operating leases."}
{"_id":"q1a729a20","text":"What was the net income for the fourth quarter of 2019?"}
{"_id":"q1a73709e","text":"Identify the geographic areas listed in the table that contribute to the total revenue."}
{"_id":"q1a728080","text":"What factors influence contributions made after fiscal year 2019?"}
{"_id":"q1a72b9d8","text":"'Compare the Carrying Values (USD) of the South African, Colombian, and Brazilian Credit Facilities in 2019 to identify which has the highest value.'"}
{"_id":"q1a734312","text":"Calculate the percentage change in salaries, wages, and benefits expense from 2018 to 2019."}
{"_id":"q1a711484","text":"Calculate the percentage change in the balance of inventories after adjustments have been made."}
{"_id":"q1a715d5e","text":"Calculate the percentage change in deferred tax assets for accrued expenses and federal credits from 2018 to 2019."}
{"_id":"q1a72a02e","text":"Calculate the difference in the number of BCE retail subscribers for Wireless and High-speed Internet in 2018."}
{"_id":"q1a7308c0","text":"'What factors contributed to the year-on-year change in revenues for the Online Advertising Business?'"}
{"_id":"q1a72b3e8","text":"'Compare the amounts on January 1st of each year to identify which year had a larger amount.'"}
{"_id":"q1a7330d4","text":"Explain how to calculate the dividend yield of a company."}
{"_id":"q1a73b7b6","text":"Calculate the percentage change in Standby letters of credit from 2018 to 2019."}
{"_id":"q1a71da18","text":"Calculate the percentage change in personnel expenses from 2017\/2018 to 2018\/2019."}
{"_id":"q1a73ca08","text":"Calculate the difference in cash remuneration for the Board of Directors between the fiscal years ending June 30, 2018, and June 30, 2019."}
{"_id":"q1a73c9ae","text":"Retrieve the share-based payments for the Board of Directors for the fiscal years ending June 30, 2017, 2018, and 2019."}
{"_id":"q1a73ac94","text":"Calculate the change in work-in-progress inventories from 2018 to 2019."}
{"_id":"q1a7206dc","text":"Explain the Share Incentive Plan (SIP) and its key features."}
{"_id":"q1a720484","text":"Calculate the net change in cash and cash equivalents for the year 2019."}
{"_id":"q1a73ba22","text":"Calculate the percentage change in non-vested shares from 2018 to 2019."}
{"_id":"q1a730b04","text":"'What were the land values of the company in 2018 and 2019?'"}
{"_id":"q1a737616","text":"Calculate the change in the high price for the second quarter from the fiscal year ended April 28, 2018, to the fiscal year ended April 27, 2019."}
{"_id":"q1a739d44","text":"What are the time periods for the company's obligations?"}
{"_id":"q1a740b6c","text":"'What was the net cash flow from investing activities in 2018?'"}
{"_id":"q1a73d0ac","text":"'What were the cash and cash equivalents for the year 2018?'"}
{"_id":"q1a73e2f4","text":"Retrieve the segment operating income for Blizzard Entertainment in 2018."}
{"_id":"q1a729d04","text":"Please provide a detailed description of the data in the table for analysis and interpretation."}
{"_id":"q1a71a6c4","text":"Calculate the percentage change in net accounts receivables from 2018 to 2019."}
{"_id":"q1a741634","text":"Calculate the average number of shares owned by L. Gordon Crovitz and Donald P. Hutchison."}
{"_id":"q1a72219e","text":"'Identify the year when research and development expenses were below 40,000 thousand dollars.'"}
{"_id":"q1a7297f0","text":"Retrieve the goodwill impairment charges for the years 2017 and 2018, specifying the amounts for each year."}
{"_id":"q1a71dcc0","text":"Calculate the change in Asia Pacific revenue from 2018 to 2019, specifying whether it was an increase or decrease."}
{"_id":"q1a73d0de","text":"'What was the total liquidity amount for the year 2018?'"}
{"_id":"q1a71e440","text":"Calculate the percentage change in the high price per share for the second quarter from 2018 to 2019."}
{"_id":"q1a7272de","text":"What was the total fair value of money market funds on June 30, 2019?"}
{"_id":"q1a73cc4c","text":"Calculate the percentage change in the warranty reserve provisions from 2018 to 2019."}
{"_id":"q1a72bca8","text":"Retrieve the total cost of revenues for the company in both 2018 and 2019 for comparison."}
{"_id":"q1a73e934","text":"'Count the number of years when net income was greater than $1,000 million.'"}
{"_id":"q1a7246d8","text":"Calculate the difference in net income per share between basic and diluted shares for the year 2018."}
{"_id":"q1a717d3e","text":"Explain the meaning of shareholder distributions, specifically dividends, as shown in the provided table."}
{"_id":"q1a719f12","text":"'List the years for which Annual Dividends Paid and Proposed data is available.'"}
{"_id":"q1a737120","text":"Calculate the percentage change in revenue for Ireland from 2018 to 2019."}
{"_id":"q1a728544","text":"Calculate the average value of raw materials and finished goods for the year 2018."}
{"_id":"q1a7239cc","text":"Calculate the change in Professional Services revenue from 2018 to 2019."}
{"_id":"q1a728896","text":"Identify the factors that contributed to the increase in media revenue in 2018."}
{"_id":"q1a73db1a","text":"List the IFRS standards adopted by the Group."}
{"_id":"q1a72cc70","text":"Calculate the change in performance shares from 2018 to 2019, specifying whether it was an increase or decrease."}
{"_id":"q1a717da2","text":"Identify the components listed in the table that analyze the relative importance of spending on pay."}
{"_id":"q1a7163a8","text":"Identify the years in which the percentage of plan assets allocated to Debt Securities was greater than 80% for the years 2018 and 2019."}
{"_id":"q1a7316ee","text":"'Calculate the change in contract amounts over the past year.'"}
{"_id":"q1a730c08","text":"Calculate the difference in the company's net owned property and equipment between 2018 and 2019."}
{"_id":"q1a720f9c","text":"What data is presented in the table, and what insights can be drawn from it?"}
{"_id":"q1a71a444","text":"'Count the number of years when net sales were greater than $200,000 thousand.'"}
{"_id":"q1a718c3e","text":"Explain the calculation method for diluted net income per share."}
{"_id":"q1a72ad62","text":"Calculate the percentage change in the Rest of World GDP from 2018 to 2019."}
{"_id":"q1a71dc66","text":"Calculate the average total revenue for the specified period or dataset."}
{"_id":"q1a721f28","text":"Calculate the change in net receivables from 2018 to 2019."}
{"_id":"q1a71834c","text":"Retrieve the capital expenditures for Bell Media for the years 2018 and 2019."}
{"_id":"q1a71abce","text":"Calculate the percentage change in Provisions for post-employment benefits plans (employer’s commitments) from FY2018 to FY2019."}
{"_id":"q1a739f92","text":"'Provide the total revenue figures for the year 2017.'"}
{"_id":"q1a730b36","text":"'What was the value of the company's warehouse equipment in 2018 and 2019 for comparison?'"}
{"_id":"q1a71bce0","text":"What is the basis for the expected long-term return on plan assets assumption used in calculating net periodic benefit cost?"}
{"_id":"q1a72243c","text":"What specific data does the table present?"}
{"_id":"q1a7230f8","text":"'What was the closing price of [specific stock or index] in March 2020?'"}
{"_id":"q1a71e940","text":"What was the capital amount for the Company’s U.K. build-to-suit facility as of March 31, 2018?"}
{"_id":"q1a721ece","text":"'What were the net receivables for the years 2019 and 2018?'"}
{"_id":"q1a71a3e0","text":"Calculate the change in segment operating income from 2017 to 2018."}
{"_id":"q1a734038","text":"'Find the gross profit margin of the company for the year 2015.'"}
{"_id":"q1a715192","text":"What is the formula for calculating Basic Earnings Per Share (EPS)?"}
{"_id":"q1a728d78","text":"List the raw materials commonly used in product manufacturing."}
{"_id":"q1a7345e2","text":"Calculate the percentage change in the fair value of plan assets from 2018 to 2019."}
{"_id":"q1a74160c","text":"'Find the number of shares owned by Daina Middleton and Wister Walcott, respectively.'"}
{"_id":"q1a73af3c","text":"Identify the factors that contributed to the creation of Deferred Tax Assets in 2018."}
{"_id":"q1a7319a0","text":"Identify the product sales segment with the smallest percentage change between 2018 and 2019."}
{"_id":"q1a731298","text":"Calculate the percentage of long-term prepaid ground rent relative to notes receivable and other non-current assets for the year 2018."}
{"_id":"q1a7248f4","text":"Calculate the average expected volatility for the years 2018 and 2019."}
{"_id":"q1a7165ce","text":"What is the process for writing off uncollectable debts?"}
{"_id":"q1a713e50","text":"What was the amount of restricted stock awards excluded from the diluted earnings per share calculation for the fiscal year 2018?"}
{"_id":"q1a736ec8","text":"Calculate the change in Other components of net periodic benefit cost from 2018 to 2019."}
{"_id":"q1a737a76","text":"Calculate the difference in average total operating expenses between the years 2017-2018 and 2018-2019."}
{"_id":"q1a713306","text":"Define deferred revenues and explain its significance in accounting."}
{"_id":"q1a714922","text":"'What was the valuation of the leased equipment under the finance lease agreements on December 31, 2019?'"}
{"_id":"q1a72bc80","text":"Calculate the average cost of revenues for the company in 2018 and 2019."}
{"_id":"q1a73954c","text":"'What were the accrued expenses for 2018 and 2019?'"}
{"_id":"q1a71a3a4","text":"Calculate the change in net sales from 2017 to 2018."}
{"_id":"q1a732c60","text":"Calculate the average long-term debt across major companies or sectors."}
{"_id":"q1a714c1a","text":"Retrieve the revenue figures for North America for the years 2018 and 2019."}
{"_id":"q1a7202d6","text":"Calculate the percentage change in the 'Other' category from FY2018 to FY2019."}
{"_id":"q1a72833c","text":"Calculate the change in cost of sales from 2017 to 2018."}
{"_id":"q1a72525e","text":"Calculate the total charges for the year 2019."}
{"_id":"q1a736bf8","text":"Calculate the percentage change in net derivative gains (losses) allocated to Grocery & Snacks from fiscal year 2017 to 2018."}
{"_id":"q1a72900c","text":"Calculate the change in the value of Land and improvements between 2018 and 2019."}
{"_id":"q1a725ce0","text":"Calculate the change in Online Advertising revenue costs between Q4 2018 and Q4 2019."}
{"_id":"q1a734fd8","text":"Calculate the average year-on-year change in the weighted average grant date fair value from 2017 to 2019."}
{"_id":"q1a739380","text":"Identify the location of the operating segments for non-current assets in the provided table."}
{"_id":"q1a73b96e","text":"Explain the calculation of fair value for awards that include both service and market conditions."}
{"_id":"q1a72d300","text":"What components are included in the annual charge?"}
{"_id":"q1a71cbfe","text":"Rewritten Query: 'Compare the life expectancy at age 65 for different years based on post-employment benefit obligations to identify which year had a longer life expectancy.'"}
{"_id":"q1a71d4d2","text":"'What was the Minimum Pension Liability balance for the year 2018?'"}
{"_id":"q1a736b9e","text":"Calculate the total net derivative gains from economic hedges recognized in general corporate expenses that have not been allocated to reporting segments."}
{"_id":"q1a7243e0","text":"List the locations of R&D centers operating in India."}
{"_id":"q1a7410c6","text":"Retrieve the non-equity incentive target amounts for Barry Litwin and Thomas Clark."}
{"_id":"q1a715264","text":"Retrieve the weighted average common shares outstanding (basic) for the years 2019, 2018, and 2017."}
{"_id":"q1a736216","text":"'What is the total number of shares for June 30, 2018, and June 30, 2019?'"}
{"_id":"q1a7123e8","text":"Identify the periods during which state income tax returns can be audited or examined."}
{"_id":"q1a71d202","text":"Calculate the percentage change in total long-term debt from 2018 to 2019."}
{"_id":"q1a718c0c","text":"Explain the calculation method for basic net income per share."}
{"_id":"q1a73733c","text":"What factors contributed to the increase in currency translation losses?"}
{"_id":"q1a71273a","text":"'What is the number of remuneration key performance indicators used in the Annual Incentive Plan as a measure of remuneration?'"}
{"_id":"q1a73ac08","text":"'What were the work in progress inventories for the year 2018?'"}
{"_id":"q1a72dddc","text":"Identify the periods covered in the table for total contractual obligations as of August 31, 2019."}
{"_id":"q1a71578c","text":"List the years for which the table provides data on the company's accrued liabilities."}
{"_id":"q1a728f80","text":"Rewritten Query: 'Explain the data and significance of the table provided.'"}
{"_id":"q1a732eea","text":"Calculate the proportion of shares from the 2001 share incentive plan to the total number of shares to be issued upon the exercise of outstanding options, warrants, and rights."}
{"_id":"q1a717dca","text":"'Compare the total employee expenditure for each year to identify which year had a larger amount.'"}
{"_id":"q1a72bbfe","text":"'Provide the cost of revenues for the years 2019 and 2018, respectively.'"}
{"_id":"q1a73a30c","text":"What types of payments are included in \"All Other Compensation\"?"}
{"_id":"q1a713810","text":"Calculate the percentage of total contractual obligations that are due in more than 5 years."}
{"_id":"q1a740eaa","text":"Calculate the average net actuarial loss for the years 2017, 2018, and 2019."}
{"_id":"q1a71cbd6","text":"Identify the areas where an annual increase in healthcare costs is projected."}
{"_id":"q1a725380","text":"Calculate the restructuring charges for 2019 as a percentage of the total charges for that year."}
{"_id":"q1a7368e2","text":"Retrieve the deferred tax assets for the year 2019."}
{"_id":"q1a7311d0","text":"'What was the total amount of note receivables in 2019?'"}
{"_id":"q1a73cec2","text":"Retrieve the basic weighted average common shares outstanding for the years 2018 and 2019."}
{"_id":"q1a7364d2","text":"Calculate the percentage of the amortized costs of municipal bonds relative to the total amortized costs. What is this value?"}
{"_id":"q1a71d52c","text":"'Determine the number of years when the balance of Unrealized Holding Gains Available-for-sale Securities was greater than $1 million.'"}
{"_id":"q1a737c9c","text":"'What were the sales figures for foreign and domestic distributors in 2019?'"}
{"_id":"q1a73c74c","text":"Retrieve the Total Bell Wireless revenues for the years 2018 and 2019."}
{"_id":"q1a7373e6","text":"Calculate the total assets for 2019 using the formula: Total Assets = Total Liabilities + Total Equity. What are the values of total liabilities and total equity for that year?"}
{"_id":"q1a71792e","text":"'Calculate the change in software services revenue from 2017 to 2018.'"}
{"_id":"q1a723b5c","text":"'What was the domestic income before income taxes for the year 2019?'"}
{"_id":"q1a7259a2","text":"Evaluate the change in group share of associates' profits from 2018 to 2019, comparing the significance of pre-tax versus post-tax results."}
{"_id":"q1a715db8","text":"Calculate the total net deferred taxes for assets and liabilities for the years 2018 and 2019."}
{"_id":"q1a72fb0a","text":"Retrieve the interest expense on bonds and the realized loss on CCSs (Credit Default Swaps) for the year 2019."}
{"_id":"q1a72b97e","text":"Calculate the change in the carrying value of the South African Credit Facility in USD from 2018 to 2019."}
{"_id":"q1a73060e","text":"Calculate the percentage change in impairment losses from 2017 to 2018."}
{"_id":"q1a7408e2","text":"Calculate the change in total debt, specifying whether it has increased or decreased."}
{"_id":"q1a7321c0","text":"'What are the excluded potential common shares for the year 2018?'"}
{"_id":"q1a71add6","text":"'What was the issued and paid-up capital for the year 2019?'"}
{"_id":"q1a7137de","text":"Calculate the total Term Loan Facility as a percentage of total contractual obligations."}
{"_id":"q1a731b8a","text":"'What was the total amount of stock repurchases in 2018?'"}
{"_id":"q1a722752","text":"Calculate the difference in total charges between fiscal year 2019 and fiscal year 2018."}
{"_id":"q1a73ce5e","text":"'What were the net losses for 2017 and 2018?'"}
{"_id":"q1a7209c0","text":"Rewritten Query: 'Explain the expense recognition process for RSUs that have performance criteria.'"}
{"_id":"q1a7152b4","text":"Calculate the basic net loss per share for the year 2019."}
{"_id":"q1a72d0c6","text":"'Explain the reasons for the change in other income between 2018 and 2019.'"}
{"_id":"q1a736450","text":"'What are the fair values of the company's municipal bonds and corporate bonds?'"}
{"_id":"q1a72d94a","text":"Calculate the percentage change in the net total from 2018 to 2019."}
{"_id":"q1a721c12","text":"Identify the factors that contributed to the increase in cash flows for the year ending December 31, 2019."}
{"_id":"q1a71b7ae","text":"Identify the year with the lowest net operating cash performance."}
{"_id":"q1a7151c4","text":"Calculate the average net loss for the years ended December 31, 2018, and 2019."}
{"_id":"q1a73cb98","text":"Identify three key factors that influence warranty obligations."}
{"_id":"q1a73e376","text":"Calculate the segment operating income for Activision and Blizzard in 2017, and find the difference between the two."}
{"_id":"q1a71de00","text":"What are the methods for stating or reporting inventories in financial statements?"}
{"_id":"q1a71bd9e","text":"Calculate the percentage change in the net periodic benefit cost rate of compensation increase from 2017 to 2018."}
{"_id":"q1a73249a","text":"Calculate the change in shipping revenues from the year ended December 31, 2018, to the year ended December 31, 2019."}
{"_id":"q1a71e04e","text":"Calculate the decrease in receivables from operating activities resulting from the lower net sales in 2019."}
{"_id":"q1a741db4","text":"What is the formula for calculating diluted earnings per share (EPS)?"}
{"_id":"q1a72e660","text":"Calculate the proportion of acquisition-related costs to the total cost for the year 2019."}
{"_id":"q1a714e86","text":"What is the process for a non-employee director to receive a restricted stock unit award or option grant?"}
{"_id":"q1a7267a8","text":"Calculate the average total bookings for the years 2018 and 2019."}
{"_id":"q1a712e38","text":"Calculate the average salary of NEOs (Named Executive Officers)."}
{"_id":"q1a73f4a6","text":"Calculate the difference in the ending balance of unrecognized tax benefits between 2019 and 2017."}
{"_id":"q1a725f2e","text":"Calculate the percentage change in payroll and benefits from 2018 to 2019."}
{"_id":"q1a734754","text":"'List the general and administrative expenses for the last three financial years in chronological order.'"}
{"_id":"q1a71ebf2","text":"Calculate the change in the value of Item reclassified from freehold investment property between 2018 and 2019."}
{"_id":"q1a71a41c","text":"'What were the net sales figures for the year 2017?'"}
{"_id":"q1a726802","text":"Calculate the difference in average total bookings between the years 2017-2018 and 2018-2019."}
{"_id":"q1a71ef58","text":"'Provide the lease liability figures for the years 2018 and 2019.'"}
{"_id":"q1a73b78e","text":"Calculate the change in Balance outstanding from 2018 to 2019."}
{"_id":"q1a73b1bc","text":"Calculate the average Research and Development expense for the years 2018 and 2019."}
{"_id":"q1a716178","text":"Calculate the change in operating income from fiscal year 2018 to fiscal year 2019."}
{"_id":"q1a71b51a","text":"What was the amount of net operating loss carryforwards reported in 2018?"}
{"_id":"q1a73f9d8","text":"Calculate the change in service revenue for EMEA from 2017 to 2018."}
{"_id":"q1a737396","text":"Calculate the percentage change in total equity from 2018 to 2019."}
{"_id":"q1a729a84","text":"'What was the net income for the third quarter of 2019?'"}
{"_id":"q1a7240fc","text":"'What year did the company introduce 65-nanometer technology?'"}
{"_id":"q1a721528","text":"Identify the different types of revenue listed in the provided table."}
{"_id":"q1a72be9c","text":"'Compare the sales and marketing expenses for the years 2018 and 2019 to identify which year had a higher amount.'"}
{"_id":"q1a726a50","text":"Calculate the total revenue earned in 2017 and 2018 combined."}
{"_id":"q1a73515e","text":"List the years for which the table provides data on purchase rights issued under the Employee Stock Purchase Plan (ESPP)."}
{"_id":"q1a71baa6","text":"Calculate the total restructuring expenses for the years 2018 and 2019."}
{"_id":"q1a7224be","text":"Calculate the total amount of purchasing obligations that are due."}
{"_id":"q1a716f42","text":"'Count the number of years when total adjustments were greater than $50 million.'"}
{"_id":"q1a72f07e","text":"Calculate the change in the weighted average number of basic shares from 2017 to 2018."}
{"_id":"q1a7165f6","text":"Calculate the percentage change in total past due but not impaired receivables from 2018 to 2019."}
{"_id":"q1a734a2e","text":"Calculate the percentage variance in operating income from fiscal year 2017 to fiscal year 2018."}
{"_id":"q1a73911e","text":"'List the years for which data on accumulated benefit obligation is available.'"}
{"_id":"q1a7198c8","text":"Calculate the difference in Cash and Cash Equivalents between 2017 and 2018."}
{"_id":"q1a72778e","text":"Identify the independent director with the highest commission amount."}
{"_id":"q1a7219f6","text":"What was the previous name or designation for Subscriber Solutions & Experience as reported by the company?"}
{"_id":"q1a72c9b4","text":"'What is the Unlevered Free Cash Flow for the year 2019?'"}
{"_id":"q1a741b20","text":"'List the years when inventory calculations were conducted.'"}
{"_id":"q1a71b16e","text":"Identify the factors that contributed to the increase in finance costs."}
{"_id":"q1a737a1c","text":"Calculate the average total operating expenses for the years 2018 and 2019."}
{"_id":"q1a725c36","text":"Calculate the percentage increase in FinTech and Business Services revenue from Q4 2018 to Q4 2019."}
{"_id":"q1a73fa3c","text":"Calculate the percentage change in total service revenue from 2017 to 2018."}
{"_id":"q1a71575a","text":"'What were the total income taxes payable in 2019?'"}
{"_id":"q1a72fb64","text":"Calculate the difference in lease charges between 2018 and 2019."}
{"_id":"q1a7232ba","text":"What are the methods used to measure inventories, specifically for wireless devices and merchandise for resale?"}
{"_id":"q1a72317a","text":"Calculate the average stock price for the first quarter of 2020."}
{"_id":"q1a73d12e","text":"Calculate the total liquidity change from 2018 to 2019. What was the difference?"}
{"_id":"q1a721ab4","text":"Calculate the total revenue difference between Subscriber Solutions & Experience and Traditional & Other Products."}
{"_id":"q1a738714","text":"Calculate the change in fixed assets not yet in service between 2018 and 2019."}
{"_id":"q1a733a20","text":"Calculate the percentage of total external revenue relative to segment revenue."}
{"_id":"q1a73a514","text":"Analyze the impact of dilutive securities on earnings per share (EPS) for the years 2019 and 2018."}
{"_id":"q1a726712","text":"List the total bookings for each financial year in chronological order."}
{"_id":"q1a732e2c","text":"Determine the number of shares that will be issued when all outstanding options are exercised by the company."}
{"_id":"q1a73d3c2","text":"Calculate the average number of customers from Singapore."}
{"_id":"q1a719378","text":"List the RSAs (Research and Development Agreements) that were granted in 2019."}
{"_id":"q1a73fc26","text":"Calculate the total annual salary of NEOs (Named Executive Officers) for fiscal year 2019 (FY19)."}
{"_id":"q1a7117ae","text":"'What were the sales and marketing expenses for the year 2017?'"}
{"_id":"q1a721852","text":"Calculate the change in surcharge revenue between 2018 and 2019."}
{"_id":"q1a71721c","text":"Calculate the average age of the Vice Presidents in the company."}
{"_id":"q1a73f21c","text":"Calculate the change in personnel costs, including teammate benefits, from 2018 to 2019."}
{"_id":"q1a715a3e","text":"Calculate the percentage change in RSUs from 2018 to 2019."}
{"_id":"q1a73fee2","text":"Identify the key factors that contributed to sales growth in the second half of the year."}
{"_id":"q1a72ecdc","text":"Calculate the percentage change in total accrued expenses from 2018 to 2019."}
{"_id":"q1a729408","text":"Calculate the average percentage contribution of minimally prepared chicken to net sales dollars from fiscal years 2017 to 2019."}
{"_id":"q1a7220e0","text":"Calculate the increase in research and development spending for the year 2018."}
{"_id":"q1a73eba0","text":"Calculate the change in Dividend and Interest Income from 2017 to 2018."}
{"_id":"q1a7126e0","text":"'What was the maximum group operating profit reported in 2019?'"}
{"_id":"q1a72eb60","text":"Calculate the accrued interest for the year 2018."}
{"_id":"q1a719346","text":"'What is the total amount of authorized common stock available for issuance under the plan?'"}
{"_id":"q1a71ab1a","text":"Rewritten Query: 'What factors determine the benefits of the different plans?'"}
{"_id":"q1a73763e","text":"Identify the quarter of 2019 when the high price exceeded $40.00."}
{"_id":"q1a71b8da","text":"What were the reasons for the net cash used for financing activities being $2.95 billion in 2019?"}
{"_id":"q1a7395ce","text":"Calculate the average total accrued liabilities for the years 2018 and 2019."}
{"_id":"q1a739af6","text":"Calculate the percentage of lease receivables relative to the total gross receivables. What is the total for lease receivables as a percentage of all gross receivables?"}
{"_id":"q1a737990","text":"Identify the financial years represented in the table."}
{"_id":"q1a739fec","text":"'Determine the number of years in which total revenue was greater than $500 million.'"}
{"_id":"q1a71de64","text":"'List the years in which inventory data was calculated or reported.'"}
{"_id":"q1a728bb6","text":"Determine the number of years in which revenue from Other products was greater than $1,000 million."}
{"_id":"q1a71ae08","text":"Calculate the change in Issued and Paid-Up Capital from 2018 to 2019, specifying whether it was an increase or decrease."}
{"_id":"q1a729b06","text":"Calculate the change in net income attributable to the parent company from December 31, 2018, to December 31, 2019."}
{"_id":"q1a738c64","text":"Calculate the average value of Permanent differences for the years 2018 and 2019."}
{"_id":"q1a741e68","text":"Calculate the average annual basic earnings per share (EPS) attributable to OpenText."}
{"_id":"q1a71aba6","text":"Calculate the change in Provisions for post-employment benefits plans (employer’s commitments) from FY2018 to FY2019."}
{"_id":"q1a7114b6","text":"Calculate the ratio of total current assets to total current liabilities based on the reported balances."}
{"_id":"q1a738c96","text":"Calculate the percentage change in the Foreign rate differential between 2018 and 2019."}
{"_id":"q1a71f3ea","text":"Retrieve the gross profit figures for the Medical segment in fiscal years 2018 and 2017."}
{"_id":"q1a71c046","text":"Calculate the revenue difference between customer A and customer B for the year 2019."}
{"_id":"q1a73ed9e","text":"Calculate the change in diluted net income attributable to American Tower Corporation common stockholders from 2018 to 2019."}
{"_id":"q1a713df6","text":"'What were the incremental shares for December 31, 2019, and December 31, 2018?'"}
{"_id":"q1a74040a","text":"Calculate the change in prepaid taxes between 2018 and 2019."}
{"_id":"q1a72aefc","text":"What are the main components of tax-related liabilities?"}
{"_id":"q1a716eb6","text":"Rewritten Query: 'What expenses are excluded from the calculation of Adjusted EBITDA by the company, and why are they excluded?'"}
{"_id":"q1a7293d6","text":"Calculate the percentage change in the contribution from minimally prepared chicken between fiscal years 2018 and 2019 relative to net sales dollars."}
{"_id":"q1a724ba6","text":"Calculate the percentage change in current deferred income."}
{"_id":"q1a721cc6","text":"Calculate the percentage change in net cash from operating activities between 2017 and 2018."}
{"_id":"q1a715a0c","text":"Calculate the change in the amount of stock options from 2018 to 2019."}
{"_id":"q1a7361e4","text":"Please provide a detailed description of the data in the table for analysis and interpretation."}
{"_id":"q1a740856","text":"List the financial covenants required by the credit agreement."}
{"_id":"q1a72d648","text":"Calculate the average revenue for software-as-a-service (SaaS) in 2018 and 2019."}
{"_id":"q1a7117e0","text":"'Calculate the change in research and development expenses from 2017 to 2018.'"}
{"_id":"q1a73e90c","text":"'Retrieve the interest expense data for the year 2019.'"}
{"_id":"q1a7264e2","text":"Calculate the change in income from foreign countries between 2018 and 2019."}
{"_id":"q1a725ed4","text":"Calculate the total operating accruals for the years 2018 and 2019."}
{"_id":"q1a733160","text":"Calculate the percentage change in exercise price from 2018 to 2019."}
{"_id":"q1a720a1a","text":"Calculate the change in the Weighted-Average Grant Date Fair Value of Nonvested RSUs from December 31, 2018, to December 31, 2019."}
{"_id":"q1a729322","text":"Explain the role and responsibilities of a Registrant."}
{"_id":"q1a71f67e","text":"'Retrieve the free cash flow data for the year 2019.'"}
{"_id":"q1a71fdb8","text":"Retrieve the net income attributable to VMware, Inc. for the third quarter of 2020."}
{"_id":"q1a72c9e6","text":"Identify the components used to calculate unlevered free cash flow from net cash flow from operating activities."}
{"_id":"q1a724e26","text":"Calculate the average financing activities for the years 2018 and 2019."}
{"_id":"q1a720740","text":"List the components that contribute to the total share-based payment charge."}
{"_id":"q1a72efd4","text":"'List the years for which data is provided in the table.'"}
{"_id":"q1a741e0e","text":"Calculate the difference in Basic earnings per share attributable to OpenText for fiscal years 2019 and 2018."}
{"_id":"q1a7121fe","text":"'Identify the year with the highest weighted average number of shares.'"}
{"_id":"q1a72ec28","text":"'What were the total running costs accrued in 2018?'"}
{"_id":"q1a73bee6","text":"'What were the pre-tax losses for the year 2018?'"}
{"_id":"q1a737670","text":"'What were the high prices for the first and second quarters of 2019?'"}
{"_id":"q1a740bee","text":"Calculate the change in cash and cash equivalents from 2017 to 2018, specifying whether it was an increase or decrease."}
{"_id":"q1a714c4c","text":"Calculate the average revenue from the Asia Pacific region for the years 2018 and 2019."}
{"_id":"q1a73db7e","text":"What components are included in the calculation of operating profit?"}
{"_id":"q1a72b65e","text":"Calculate the percentage change in the fair value of common stock vested from 2018 to 2019."}
{"_id":"q1a71f25a","text":"Determine the number of years in which the operating income from EMEA was greater than $3 million."}
{"_id":"q1a717168","text":"Find the source for the remaining information on Loral's executive officers as of March 12, 2020, specifically under Item 10."}
{"_id":"q1a73b216","text":"Calculate the percentage change in revenue from 2018 to 2019."}
{"_id":"q1a722112","text":"'Provide the research and development spending figures for the years 2017 and 2018.'"}
{"_id":"q1a73af96","text":"Identify the primary factor that significantly contributed to the increase in deferred tax assets."}
{"_id":"q1a71ba4c","text":"'What were the average restructuring expenses for the years 2018 and 2019?'"}
{"_id":"q1a73c6ca","text":"Identify the factors that influenced the change in Bell Wireless operating revenues in 2019."}
{"_id":"q1a72964c","text":"Calculate the percentage change in the current portion of loans due from subsidiaries between 2018 and 2019."}
{"_id":"q1a71bf92","text":"Identify the customers that contributed more than 10% of total revenues for the Company in the fiscal years ending September 30, 2018, and 2019."}
{"_id":"q1a736e14","text":"'What were the total pension and benefit charges for the year 2019?'"}
{"_id":"q1a735258","text":"Calculate the percentage change in the Proceeds from issuance of shares from 2018 to 2019."}
{"_id":"q1a713ac2","text":"'What was the total amount of stock-based compensation reported in 2019?'"}
{"_id":"q1a715200","text":"Calculate the weighted average common shares outstanding (basic) for the years ended December 31, 2019, and 2018, and find the average of these two values."}
{"_id":"q1a719314","text":"'What is the approved increase in the number of shares as per the shareholders' amendment?'"}
{"_id":"q1a723314","text":"What components are included in the Cost of equipment sales and merchandise for resale?"}
{"_id":"q1a73c1a2","text":"Calculate the change in interest income from 2018 to 2019."}
{"_id":"q1a73f424","text":"What is the primary source or category of the unrecognized tax benefit?"}
{"_id":"q1a7173b6","text":"'What were the total assets of the APAC region in 2019?'"}
{"_id":"q1a731c0c","text":"'Count the number of years when the balance at the end of the period was greater than 30,000,000.'"}
{"_id":"q1a7207c2","text":"Calculate the percentage change in PSP payments for the Group from 2018 to 2019."}
{"_id":"q1a72e75a","text":"What are the components of acquisition-related costs?"}
{"_id":"q1a716f1a","text":"'Provide the total amounts for amortization and depreciation expenses for the year 2018.'"}
{"_id":"q1a71983c","text":"What items are included in Cash and Cash Equivalents?"}
{"_id":"q1a71a1ce","text":"'Count the number of items with a percentage change of less than 50%.'"}
{"_id":"q1a740b9e","text":"'What was the amount of net cash used in financing activities for the year 2019?'"}
{"_id":"q1a727d4c","text":"Calculate the average Products and Licensing revenue for the years 2018 and 2019 as of December 31."}
{"_id":"q1a719634","text":"Explain the significance of the share of net earnings in other affiliates."}
{"_id":"q1a74168e","text":"Calculate the average number of shares owned by Daina Middleton and Wister Walcott."}
{"_id":"q1a71d22a","text":"Calculate the ratio of senior notes due in 2020 and 2021 to the total debt for the year 2019."}
{"_id":"q1a71712c","text":"'List the ages of the executive officers.'"}
{"_id":"q1a726776","text":"List the financial years in chronological order as shown in the table."}
{"_id":"q1a714ee0","text":"Calculate the ratio of total compensation for Darcy Antonellis to that of David C. Habiger."}
{"_id":"q1a729066","text":"Calculate the percentage difference in net values of Property and Equipment from 2018 to 2019, expressed as a percentage of Accumulated Depreciation and Amortization."}
{"_id":"q1a72dad0","text":"'List the estimated useful lives of various assets.'"}
{"_id":"q1a72a524","text":"'Identify the year with the highest value for Property and Equipment, Net.'"}
{"_id":"q1a713338","text":"What is the expected useful life duration for deferred software and subscription-based service performance obligations?"}
{"_id":"q1a71f930","text":"Calculate the percentage change in the net carrying amount before unamortized debt issuance costs from 2018 to 2019."}
{"_id":"q1a73f9b0","text":"'What was the total service revenue generated from the EMEA region in 2018?'"}
{"_id":"q1a71b542","text":"'Calculate the change in tax credits from 2018 to 2019.'"}
{"_id":"q1a714986","text":"'What was the total land area measured in 2018?'"}
{"_id":"q1a714706","text":"Calculate the change in foreign pretax income from 2018 to 2019."}
{"_id":"q1a72810c","text":"Calculate the difference between total benefit obligations and total capital lease obligations."}
{"_id":"q1a71f200","text":"Retrieve the operating income for the APAC region in 2019."}
{"_id":"q1a712460","text":"'What classification does the company use for interest and penalties related to uncertain tax positions?'"}
{"_id":"q1a725916","text":"Identify the associate whose results are included in the \"Other associates\" line item."}
{"_id":"q1a73e5ce","text":"List the components included in Other financial income and Other financial expenses."}
{"_id":"q1a71eb98","text":"Identify the agreement made by the group on June 28, 2019."}
{"_id":"q1a73b6c6","text":"Explain the process the company used to convert a portion of its revolving credit facility's variable interest rate into a fixed interest rate."}
{"_id":"q1a71b812","text":"Identify the key components that contributed to net cash used for investing activities."}
{"_id":"q1a729d90","text":"Calculate the percentage change in adjusted revenue from 2016 to 2017."}
{"_id":"q1a73556e","text":"'What was the total revenue for the year ending December 31, 2019?'"}
{"_id":"q1a73f014","text":"Calculate the change in the weighted average grant date stock price from 2017 to 2018."}
{"_id":"q1a718068","text":"Calculate the percentage change in on-net APRU from 2017 to 2018."}
{"_id":"q1a722c2a","text":"'Provide the gross profit figures for 2019 and 2018, and compare the two years.'"}
{"_id":"q1a726fa0","text":"What is the total amount of purchase obligations?"}
{"_id":"q1a71b7e0","text":"Calculate the difference in the net increase or decrease in cash and cash equivalents between 2017 and 2018."}
{"_id":"q1a73d106","text":"Calculate the change in availability under the revolving credit facility from 2018 to 2019."}
{"_id":"q1a73ed12","text":"What items or factors are excluded from the pro forma results?"}
{"_id":"q1a72ac9a","text":"'What were the total sales to foreign countries in 2018?'"}
{"_id":"q1a739768","text":"Rewritten Query: 'Explain the methods used by the company to assess the adequacy of their allowance for credit loss.'"}
{"_id":"q1a7221c6","text":"Calculate the percentage change in revenue."}
{"_id":"q1a725538","text":"Calculate the total amount of capitalized interest for the year 2018."}
{"_id":"q1a725c5e","text":"Calculate the percentage change in Online Advertising revenue from Q4 2018 to Q4 2019."}
{"_id":"q1a72a4f2","text":"Identify the types of impairment losses reported in the Consolidated Statements of Operations for the Americas region."}
{"_id":"q1a7130a4","text":"Retrieve the acquisition and integration charges associated with the company's collaboration with JJMD for Q4 of Fiscal Year 2019."}
{"_id":"q1a727702","text":"'What are the sitting fees for V Thyagarajan when attending board or committee meetings?'"}
{"_id":"q1a71f4f8","text":"Calculate the average Loss from Operations for the fiscal years ending April 28, 2018, and April 29, 2017."}
{"_id":"q1a731c34","text":"Calculate the percentage change in Restricted Stock Unit issuances from 2018 to 2019."}
{"_id":"q1a71a142","text":"Calculate the percentage increase in CTS sales for the year 2019."}
{"_id":"q1a732634","text":"Identify the locations of the Company's property, plant, and equipment."}
{"_id":"q1a72aa60","text":"Calculate the average income tax impact on discontinued operations from 2017 to 2019."}
{"_id":"q1a73f19a","text":"'Calculate the increase in Selling and Administrative Expenses from 2018 to 2019.'"}
{"_id":"q1a72feac","text":"Identify the years when Teradyne reported components of its deferred tax assets and liabilities."}
{"_id":"q1a71aae8","text":"What is the recognition process for provisions related to post-employment benefits plans?"}
{"_id":"q1a7236fc","text":"Calculate the change in net income (or loss) from 2018 to 2019. What is the difference?"}
{"_id":"q1a73fba4","text":"Original Query: 'What does NEO stand for?'\n\nRewritten Query: 'Define the acronym NEO and its full meaning.'"}
{"_id":"q1a712adc","text":"Calculate the change in level 1 FVOCI from the end of 2018 to the end of 2019."}
{"_id":"q1a730f64","text":"'What were the income tax benefits for 2019 and 2018? Please provide the respective amounts for each year.'"}
{"_id":"q1a72b38e","text":"What are the purposes of government grants?"}
{"_id":"q1a7329ea","text":"Calculate the average cents per share for the interim periods of 2018 and 2019."}
{"_id":"q1a7113c6","text":"What was the cumulative-effect adjustment to the opening balance of retained earnings for fiscal year 2019?"}
{"_id":"q1a71bdd0","text":"Calculate the percentage change in the projected benefit obligation discount rate from 2018 to 2019."}
{"_id":"q1a725ea2","text":"'Provide the payroll and benefits figures for the years 2018 and 2019.'"}
{"_id":"q1a7261ae","text":"Calculate the percentage change in total compensation from 2018 to 2019."}
{"_id":"q1a71a61a","text":"'What was the amount allocated for doubtful receivables in 2018?'"}
{"_id":"q1a72179e","text":"'What was the gross profit amount for the year 2019?'"}
{"_id":"q1a7319d2","text":"Calculate the percentage of Altium Nexus sales relative to total product sales in 2018."}
{"_id":"q1a73f76c","text":"Calculate the percentage change in total net property, plant, and equipment from 2018 to 2019."}
{"_id":"q1a717438","text":"Calculate the change in total assets for APAC from 2018 to 2019."}
{"_id":"q1a7182f2","text":"Calculate the change in capital expenditures for Bell Wireless."}
{"_id":"q1a73fbd6","text":"Identify the NEOs (Named Executive Officers) in this company."}
{"_id":"q1a72e11a","text":"'What was the total revenue generated from the Asia and Pacific Rim regions in 2018?'"}
{"_id":"q1a729d36","text":"Identify the largest cost of revenue item included in Adjusted Revenue."}
{"_id":"q1a733c00","text":"'What was the tax benefit associated with stock compensation expenses in 2019?'"}
{"_id":"q1a736c2a","text":"Calculate the total net derivative losses allocated to Foodservice for the fiscal years 2018 and 2019."}
{"_id":"q1a71719a","text":"'List the ages of the current Vice Presidents of the company.'"}
{"_id":"q1a730370","text":"Calculate the difference in the weighted average estimated life in years between computer software and client relationships."}
{"_id":"q1a717adc","text":"Please provide a detailed description of the data in the table for analysis and interpretation."}
{"_id":"q1a73a744","text":"'Identify the financial statement section where Trade accounts receivable, net, noncurrent is reported.'"}
{"_id":"q1a719d14","text":"Identify the type of non-cash change that has the most significant impact on liability categories."}
{"_id":"q1a74037e","text":"Retrieve the total amount of prepaid taxes for the year 2019."}
{"_id":"q1a71bfba","text":"Calculate the total accounts receivable and long-term receivable from Customer B as of September 30, 2019."}
{"_id":"q1a71336a","text":"Retrieve the beginning balance for the account as of December 31, 2019."}
{"_id":"q1a73aa46","text":"Calculate the average stock options granted from 2017 to 2019."}
{"_id":"q1a71580e","text":"Calculate the percentage change in total accrued liabilities from 2018 to 2019."}
{"_id":"q1a714bb6","text":"Retrieve the revenue figures for the Asia Pacific region for the years 2018 and 2019."}
{"_id":"q1a72d094","text":"Explain the factors that caused the change in interest expense between 2017 and 2018."}
{"_id":"q1a7323aa","text":"Calculate the decrease in shipping revenues for the year ending December 31, 2019, compared to 2018."}
{"_id":"q1a72ea5c","text":"'List the years for which the table includes data on Accrued expenses and other liabilities.'"}
{"_id":"q1a7178fc","text":"List the data and analytic services available in 2017."}
{"_id":"q1a7193a0","text":"Calculate the change in the number of RSAs granted from 2018 to 2019, specifying whether it was an increase or decrease."}
{"_id":"q1a73b9a0","text":"Identify the types of activities related to restricted stock and restricted stock unit (RSU) awards."}
{"_id":"q1a73efec","text":"Calculate the change in Expected volatility between 2017 and 2018."}
{"_id":"q1a71fbe2","text":"Calculate the average accrued revenue for the years 2018 and 2019."}
{"_id":"q1a73623e","text":"'What is the balance amount as of June 30, 2017?'"}
{"_id":"q1a72a2d6","text":"Calculate the average consumer spending over the past three years."}
{"_id":"q1a71fe80","text":"Calculate the change in total revenue from Q3 2020 to Q4 2020."}
{"_id":"q1a71fe44","text":"'Count the number of quarters in 2020 where VMware, Inc.'s net income exceeded $1,000 million.'"}
{"_id":"q1a71ae6c","text":"'Identify the year when Total contributed equity was below 100,000 thousands.'"}
{"_id":"q1a72a47a","text":"What are the measurement methods for specific assets under various conditions?"}
{"_id":"q1a72f830","text":"'What are the financial year-end dates for 2019 and 2018?'"}
{"_id":"q1a73260c","text":"Retrieve the net book value of property, plant, and equipment as of September 30, 2019."}
{"_id":"q1a72d382","text":"'Calculate the change in dividend shares awarded from 2018 to 2019.'"}
{"_id":"q1a72a57e","text":"Calculate the percentage change in Property and Equipment, net from 2017 to 2018."}
{"_id":"q1a72ca68","text":"Calculate the percentage change in adjusted operating profit from 2018 to 2019."}
{"_id":"q1a72cc48","text":"Calculate the average restricted stock value for the years 2017 to 2019."}
{"_id":"q1a724b74","text":"'Calculate the change in current deferred income over the specified period.'"}
{"_id":"q1a719922","text":"Calculate the percentage change in total cash, cash equivalents, and restricted cash from 2018 to 2019."}
{"_id":"q1a729a52","text":"'What was the net income for the fourth quarter of 2019, and how does it compare to previous quarters?'"}
{"_id":"q1a71fbba","text":"Calculate the percentage change in accrued revenue for the year 2019."}
{"_id":"q1a72dbb6","text":"'What was the change in cost of computer hardware from 2018 to 2019?'"}
{"_id":"q1a734d26","text":"Identify the components associated with deferred income tax liabilities."}
{"_id":"q1a741aee","text":"Analyze the impact of reducing LIFO-valued inventories on financial statements and tax liabilities."}
{"_id":"q1a71d996","text":"Identify the components of personnel expenses listed in the table."}
{"_id":"q1a73578a","text":"Calculate the operating income for 2015 and 2016, then find the difference between the two years."}
{"_id":"q1a714954","text":"List the years for which the table provides data on the company's property and equipment."}
{"_id":"q1a711f10","text":"Calculate the average cable expenditure for the most recent year available."}
{"_id":"q1a73f456","text":"'Calculate the decrease in the company's income tax provision if it is recognized as of December 31, 2019.'"}
{"_id":"q1a7209e8","text":"Calculate the change in the number of non-vested RSU shares from December 31, 2018, to December 31, 2019."}
{"_id":"q1a71b1c8","text":"'What was the profit margin for Q4 2018?'"}
{"_id":"q1a71e3aa","text":"'What was the lowest price per share recorded in Q3 2018?'"}
{"_id":"q1a72859e","text":"What methods does the company use to lower its inventory cost basis?"}
{"_id":"q1a73ac3a","text":"'What were the inventories of parts and raw materials in 2019?' \n\nRewritten Query: 'Provide the inventory levels of parts and raw materials for the year 2019.'"}
{"_id":"q1a72aa2e","text":"Calculate the average gain on sale for Netsmart from 2017 to 2019."}
{"_id":"q1a7260be","text":"What components are included in Key Management?"}
{"_id":"q1a718946","text":"'What is the payment schedule for other payables and accruals?'"}
{"_id":"q1a73d8ae","text":"Calculate the change in Audit Fees in NT$ from 2018 to 2019, specifying whether it is an increase or decrease."}
{"_id":"q1a740e28","text":"'What was the pre-tax curtailment gain amount for the year 2018?'"}
{"_id":"q1a737fc6","text":"Calculate the change in Personnel-related items between 2018 and 2019."}
{"_id":"q1a714c9c","text":"Calculate the average revenue from North America for the years 2018 and 2019."}
{"_id":"q1a740dce","text":"'Retrieve the service cost data for the year 2019.'"}
{"_id":"q1a728fb2","text":"What are the effects of adopting ASU 2016-02 on financial reporting?"}
{"_id":"q1a731be4","text":"Calculate the change in the Balance at the beginning of the year from 2018 to 2019."}
{"_id":"q1a71dc0c","text":"What was the change in revenue for the Americas region?"}
{"_id":"q1a741ddc","text":"When are common share equivalents excluded from the calculation of diluted earnings per share?"}
{"_id":"q1a72ff06","text":"'Calculate the change in the \"Other\" category from 2018 to 2019.'"}
{"_id":"q1a71cf46","text":"Calculate the percentage change in purchases of property and equipment under finance leases, perpetual easements, and capital leases from 2018 to 2019."}
{"_id":"q1a725e7a","text":"Retrieve the current portion of deferred revenue for the years 2018 and 2019."}
{"_id":"q1a719eae","text":"Translate the US dollar values for the years 2015 to 2018 into a specific currency."}
{"_id":"q1a71bb00","text":"What were the total estimated restructuring costs for the 2019 restructuring plan, and what amount was still outstanding as of May 31, 2019?"}
{"_id":"q1a72182a","text":"'Compare the gross margins of the two years to identify which year had a larger gross margin.'"}
{"_id":"q1a7298ae","text":"Calculate the total goodwill impairment and restructuring charges for the years 2017 and 2018."}
{"_id":"q1a72467e","text":"Calculate the percentage change in net sales between 2017 and 2018."}
{"_id":"q1a733bd8","text":"'Identify the tax benefit associated with stock compensation expense as reported in the Consolidated Statements of Operations.'"}
{"_id":"q1a7140b2","text":"'List the years in which equity in net earnings of affiliates was recorded.'"}
{"_id":"q1a739d6c","text":"List the components of total contractual obligations that exceed 100,000."}
{"_id":"q1a72ca40","text":"Calculate the change in adjusted operating profit from 2018 to 2019."}
{"_id":"q1a711b3c","text":"Please provide a detailed description of the data in the table for analysis and interpretation."}
{"_id":"q1a72db34","text":"Identify the types of computer software costs that can be immediately expensed for accounting purposes."}
{"_id":"q1a72d120","text":"Calculate the percentage change in interest expense between 2018 and 2019."}
{"_id":"q1a72d148","text":"Calculate the change in 'other, net' from 2018 to 2019."}
{"_id":"q1a714eae","text":"Retrieve the total compensation figures for Richard S. Hill and Christopher A. Seams for the most recent fiscal year."}
{"_id":"q1a73436c","text":"Calculate the ratio of integration incentives expense for 2019 compared to 2018."}
{"_id":"q1a73d340","text":"What percentage of total operating revenues in 2019 do the top ten customers account for?"}
{"_id":"q1a7336a6","text":"Clarify the meaning of a company's liability for uncertain tax positions and its implications."}
{"_id":"q1a72d5bc","text":"'What were the software-as-a-service revenues for 2018 and 2019?'"}
{"_id":"q1a726122","text":"Identify the different types of key management compensation listed in the table."}
{"_id":"q1a716b64","text":"What was the income tax benefit amount for individuals in 2019?"}
{"_id":"q1a71debe","text":"Calculate the change in finished goods inventory from 2018 to 2019."}
{"_id":"q1a72e0b6","text":"'What factors were used to determine revenues by geographic area?'"}
{"_id":"q1a71eef4","text":"'Provide the valuation allowance amounts for the years 2019 and 2018.'"}
{"_id":"q1a719076","text":"'Calculate the change in foreign operations tax exposure reserves for the year 2019.'"}
{"_id":"q1a73f28a","text":"Calculate the average personnel costs, including teammate benefits, for the years 2018 and 2019."}
{"_id":"q1a7280da","text":"Calculate the percentage of total operating lease obligations relative to total contractual obligations."}
{"_id":"q1a7144d6","text":"'Compare the amount of Accruals by year to identify which year had a larger total.'"}
{"_id":"q1a71a4a8","text":"Calculate the percentage change in segment operating income (loss) from 2017 to 2018."}
{"_id":"q1a71b1fa","text":"Calculate the percentage of the cost of revenue relative to the total revenue for the fourth quarter of 2019."}
{"_id":"q1a7319fa","text":"Calculate the percentage of \"Other\" product sales in relation to total product sales for the year 2019."}
{"_id":"q1a72a9de","text":"Determine the Gain on Sale of Netsmart for the year 2018."}
{"_id":"q1a72f808","text":"What explanation did Oracle provide for the constant currency decline in its hardware revenues from fiscal 2018 to fiscal 2019?"}
{"_id":"q1a71ce6a","text":"Clarify the details of the Acquisition of Commercialization Rights, including its purpose and key aspects."}
{"_id":"q1a735190","text":"'Retrieve the number of shares issued under the Employee Stock Purchase Plan (ESPP) in 2019.'"}
{"_id":"q1a736c52","text":"Calculate the ratio of net derivative gains in segment operating profit for fiscal year 2017 to the expected operating result gains for fiscal year 2020."}
{"_id":"q1a73b93c","text":"Identify the type of granted shares that are not included in the table."}
{"_id":"q1a7267d0","text":"Calculate the average total bookings for the years 2017 and 2018."}
{"_id":"q1a72b8f2","text":"'What is the maturity date for the South African Credit Facility?'"}
{"_id":"q1a717b40","text":"'What was the long-term loans payable position for the year 2018?'"}
{"_id":"q1a71177c","text":"'What was the research and development expense for 2019?'"}
{"_id":"q1a71def0","text":"Calculate the percentage change in finished goods from 2018 to 2019."}
{"_id":"q1a739dc6","text":"Identify the component with the highest financial obligation for the company over the next 1 to 5 years."}
{"_id":"q1a724d40","text":"Retrieve the cash flow from operating activities for fiscal year 2019."}
{"_id":"q1a727360","text":"Calculate the average total fair value of long-lived assets held for sale for the years 2018 and 2019."}
{"_id":"q1a7160ec","text":"Retrieve the operating income figures for the fiscal years 2019 and 2018, and present them side by side for comparison."}
{"_id":"q1a72ce50","text":"'Find detailed information on restructuring expenses and their implications.'"}
{"_id":"q1a732c92","text":"Calculate the percentage change in Noncurrent liabilities (excluding debt) from 2018 to 2019."}
{"_id":"q1a7175dc","text":"List the two license agreements for the products currently on the market."}
{"_id":"q1a741d82","text":"Explain the calculation method for Basic Earnings Per Share (EPS)."}
{"_id":"q1a715232","text":"'Identify the year when the net loss was less than -10,000.'"}
{"_id":"q1a71eb66","text":"Identify the agreement made by the group on December 21, 2018."}
{"_id":"q1a72443a","text":"Calculate the difference in consolidated Capital Expenditure on R&D and innovation between FY 2018 and FY 2019."}
{"_id":"q1a73db4c","text":"'What are the restated values for the 2018 column, and what changes were made?'"}
{"_id":"q1a72bbcc","text":"'What is the decrease in the cost of revenues?'"}
{"_id":"q1a7204de","text":"Calculate the percentage change in cash flows from financing activities between 2018 and 2019."}
{"_id":"q1a71a228","text":"Calculate the average annual operating income for the years 2018 and 2019."}
{"_id":"q1a740356","text":"'Identify the financial statements or reports where prepayments are recorded or included.'"}
{"_id":"q1a7418d2","text":"What factors contributed to the change in retail IPTV net subscriber activations in 2019?"}
{"_id":"q1a722982","text":"Calculate the change in expenses for facilities between fiscal years 2017 and 2019."}
{"_id":"q1a73375a","text":"Calculate the company's 2023-2024 purchase obligations as a percentage of its total payments due for the same period."}
{"_id":"q1a731068","text":"Calculate the percentage change in pre-tax loss from 2018 to 2019."}
{"_id":"q1a722e96","text":"Identify the largest expense category for the fiscal year 2018 (FY18)."}
{"_id":"q1a73a9f6","text":"'What is the total number of outstanding RSUs as of September 2019?'"}
{"_id":"q1a7305b4","text":"'Count the number of years when depreciation expense was greater than $2,000 thousand.'"}
{"_id":"q1a7202ae","text":"Calculate the change in the 'Other' category from FY2018 to FY2019."}
{"_id":"q1a720222","text":"What are the components of non-current assets as defined by segment reporting?"}
{"_id":"q1a7403d8","text":"'Compare the size of prepaid maintenance and other services across different years to identify the year with the largest value.'"}
{"_id":"q1a71cf1e","text":"'Determine the number of years in which cash paid for income taxes exceeded $150 million.'"}
{"_id":"q1a71bf56","text":"Retrieve the value of accounts receivable from Customer A for the year 2019."}
{"_id":"q1a723de6","text":"Calculate the increase in cash flow from operating activities for the year 2019."}
{"_id":"q1a72f01a","text":"Retrieve the weighted average number of basic shares for the year 2018."}
{"_id":"q1a73120c","text":"What are the reasons for the decrease in long-term prepaid ground rent?"}
{"_id":"q1a7245f2","text":"What are the estimated legal, professional, and additional costs involved?"}
{"_id":"q1a726ca8","text":"Calculate the ratio of amortization expense to accumulated amortization for the fiscal year 2019."}
{"_id":"q1a71e698","text":"Calculate the percentage change in interest income from 2018 to 2019."}
{"_id":"q1a73051e","text":"List the years displayed in the table."}
{"_id":"q1a7330ac","text":"Rewritten Query: 'Explain the method used by the company to calculate the risk-free interest rate.'"}
{"_id":"q1a73f6ea","text":"'List the years for which the table includes data on Property, Plant, and Equipment.'"}
{"_id":"q1a734cc2","text":"What factors contribute to the stabilization of tax rates in the medium term?"}
{"_id":"q1a72fb32","text":"Identify the year with the highest recorded interest income."}
{"_id":"q1a725c04","text":"Calculate the percentage increase in VAS revenues from Q4 2018 to Q4 2019."}
{"_id":"q1a730b7c","text":"'List the vehicle values of the company for the years 2018 and 2019.'"}
{"_id":"q1a7314b4","text":"Calculate the average operating income for the years 2018 and 2019."}
{"_id":"q1a730bd6","text":"Calculate the percentage change in the company's land value from September 2018 to September 2019."}
{"_id":"q1a712230","text":"Calculate the change in the weighted average number of shares outstanding, including the dilutive effect of share options, from 2018 to 2019."}
{"_id":"q1a728b02","text":"List the years for which the table provides data on the company's groups of similar products and services."}
{"_id":"q1a738ed0","text":"What was the federal income tax rate in 2019?"}
{"_id":"q1a73e31c","text":"What do intersegment revenues indicate in financial reporting?"}
{"_id":"q1a72c662","text":"'What was the federal statutory tax expense for the year 2018?'"}
{"_id":"q1a71e0da","text":"Calculate the total net cash provided by operating activities for the years 2017, 2018, and 2019."}
{"_id":"q1a738930","text":"Calculate the average balance at the end of each year from 2017 to 2019 and provide the overall average for that 3-year period."}
{"_id":"q1a7149b8","text":"'Determine the number of years when the value of furniture, fixtures, and other equipment exceeded $10 million.'"}
{"_id":"q1a72de72","text":"'Count the number of contractual obligations with total payments due exceeding $500,000.'"}
{"_id":"q1a724188","text":"Calculate the change in the number of 28 nanometer chips produced from 2018 to 2019, specifying whether it is an increase or decrease."}
{"_id":"q1a72e174","text":"Calculate the revenue from Canada in 2019 as a percentage of the total revenue for that year."}
{"_id":"q1a71e378","text":"'What was the highest price per share recorded in the first quarter of 2019?'"}
{"_id":"q1a713162","text":"Calculate the change in basic earnings per share for Jabil Inc. from May 2019 to August 2019."}
{"_id":"q1a740e50","text":"Calculate the change in service cost from 2018 to 2019, specifying whether it was an increase or decrease."}
{"_id":"q1a734a88","text":"Calculate the average net revenue for fiscal years 2017 and 2018."}
{"_id":"q1a73df0c","text":"Calculate the change in Gross Profit from 2018 to 2019."}
{"_id":"q1a7373be","text":"Calculate the average share capital for the specified two years."}
{"_id":"q1a731662","text":"Clarify the meaning of the data presented in the table."}
{"_id":"q1a71ebca","text":"Summarize the outcomes of the agreement signed on June 28, 2019."}
{"_id":"q1a72b924","text":"'What was the carrying value in USD of the Columbian Credit Facility for the year 2019?'"}
{"_id":"q1a728daa","text":"'Compare the average silver prices across different years to identify which year had higher prices.'"}
{"_id":"q1a71f1ce","text":"Calculate the increase in operating income for AMER from 2018 to 2019."}
{"_id":"q1a74117a","text":"Calculate the percentage of Robert Dooley's target amount relative to Barry Litwin's target amount under the 2019 plan."}
{"_id":"q1a73c148","text":"Identify the factors that contributed to the increase in income tax expense in 2019."}
{"_id":"q1a73df66","text":"'Calculate the net loss for the year 2016.'"}
{"_id":"q1a72372e","text":"Calculate the change in net interest expense (interest expense minus interest income) from 2018 to 2019."}
{"_id":"q1a717bf4","text":"'Compare the equipment notes payable for each year to identify the year with the highest amount.'"}
{"_id":"q1a732bac","text":"Identify the factors that contributed to the increase in noncurrent assets."}
{"_id":"q1a731b58","text":"'List the years for which the table provides data on the roll forward of common shares outstanding.'"}
{"_id":"q1a72c716","text":"Calculate the percentage change in Valuation allowance from 2018 to 2019."}
{"_id":"q1a71d19e","text":"List the public offerings that were completed on August 26, 2019."}
{"_id":"q1a741328","text":"'What was the total value of machinery and equipment in 2018?'"}
{"_id":"q1a7173e8","text":"'What were the total assets for the year 2018?'"}
{"_id":"q1a721582","text":"Calculate the percentage change in revenue from 2018 to 2019."}
{"_id":"q1a720d3a","text":"Calculate the total net deferred taxes for the years 2018 and 2019."}
{"_id":"q1a738444","text":"Calculate the voyage expenses as a percentage of the voyage revenue for 2019. What is the resulting value?"}
{"_id":"q1a725c86","text":"Calculate the change in VAS revenue costs between Q4 2018 and Q4 2019."}
{"_id":"q1a741b7a","text":"Calculate the change in raw materials and supplies from 2018 to 2019."}
{"_id":"q1a726744","text":"Provide the total number of customers at the end of each listed period, arranged in chronological order."}
{"_id":"q1a72f25e","text":"'List the years for which total restructuring reserves were calculated.'"}
{"_id":"q1a72489a","text":"List the assumptions of the Black-Scholes option valuation model."}
{"_id":"q1a73f956","text":"What factors contributed to the increase in service revenue?"}
{"_id":"q1a72bece","text":"'Compare the sales and marketing expenses for the years 2017 and 2018 to identify which year had a higher amount.'"}
{"_id":"q1a73d908","text":"Calculate the percentage change in tax fees from 2018 to 2019."}
{"_id":"q1a71a476","text":"Calculate the percentage change in segment operating income (loss) relative to net sales from 2017 to 2018."}
{"_id":"q1a733994","text":"Calculate the total revenue generated from the Healthcare\/Life Sciences segment."}
{"_id":"q1a735b22","text":"Calculate the difference in the total number of shares purchased between fiscal years 2018 and 2019."}
{"_id":"q1a71d25c","text":"Calculate the average total debt for the years 2018 and 2019."}
{"_id":"q1a71b1a0","text":"'What was the profit margin for Q4 2019?'"}
{"_id":"q1a72a54c","text":"Calculate the change in net Property and Equipment from 2017 to 2018."}
{"_id":"q1a7160b0","text":"Retrieve the net sales figures for the fiscal years 2019 and 2018, and present them respectively."}
{"_id":"q1a728864","text":"Identify the factors that contributed to the increase in cable revenue in 2018."}
{"_id":"q1a71686c","text":"Retrieve the gross federal net operating loss for the year 2019."}
{"_id":"q1a716894","text":"Retrieve the Federal and foreign net operating losses and credits for the years 2018 and 2019, and compare the values for both years."}
{"_id":"q1a721a8c","text":"Calculate the difference in total revenue between Network Solutions and Services & Support."}
{"_id":"q1a728fe4","text":"Retrieve the accumulated depreciation and amortization figures for the year 2019."}
{"_id":"q1a732a12","text":"Calculate the percentage of the prior year special dividends in relation to the total dividends paid in 2019."}
{"_id":"q1a738ba6","text":"Calculate the income tax benefit for the year 2019."}
{"_id":"q1a724dcc","text":"Calculate the change in operating activities from 2018 to 2019, specifying whether it was an increase or a decrease."}
{"_id":"q1a7408ba","text":"'What were the financial covenants of the company in 2019?'"}
{"_id":"q1a72d670","text":"Calculate the average maintenance revenue for the years 2018 and 2019."}
{"_id":"q1a7189d2","text":"Calculate the change in accrued expenses between 2018 and 2019."}
{"_id":"q1a727a4a","text":"'What was the total revenue for the year 2017?'"}
{"_id":"q1a73e650","text":"Calculate the percentage change in Other financial income from 2017\/2018 to 2018\/2019."}
{"_id":"q1a724dfe","text":"Calculate the average investment activities for the years 2018 and 2019."}
{"_id":"q1a73bc02","text":"'List the years in which non-current assets were recorded.'"}
{"_id":"q1a712172","text":"Rewritten Query: 'Explain the reasons for excluding RSUs from the calculation of diluted earnings per share for the years 2017 and 2018.'"}
{"_id":"q1a731f40","text":"Calculate the Cost of Customer Support Revenues for fiscal year 2019 in thousands, excluding the $0.4 million increase in other miscellaneous costs."}
{"_id":"q1a717b72","text":"Calculate the percentage change in equipment notes payable from 2018 to 2019."}
{"_id":"q1a728832","text":"Identify the factors that contributed to the increase in Wireless revenue in 2018."}
{"_id":"q1a741954","text":"Calculate the percentage of Satellite subscribers among total retail subscribers in 2019."}
{"_id":"q1a7366da","text":"'Provide the revenue figures for the year 2019.'"}
{"_id":"q1a720d12","text":"Calculate the increase in valuation allowance from 2018 to 2019."}
{"_id":"q1a71a5e8","text":"'List the years for which the table provides data on accounts receivable.'"}
{"_id":"q1a71e346","text":"List the fiscal years covered in the table for the price range per share of common stock."}
{"_id":"q1a71cc30","text":"Calculate the percentage change in the Cost of Living Indexation Rate for Post-Employment Benefit Obligations."}
{"_id":"q1a717988","text":"Calculate the percentage change in total related party revenues from 2018 to 2019."}
{"_id":"q1a71e9e0","text":"Calculate the change in net Property and Equipment in South Africa from the year ending March 31, 2018, to the year ending March 31, 2019."}
{"_id":"q1a736266","text":"Calculate the difference in the number of shares between June 30, 2018, and June 30, 2019."}
{"_id":"q1a736b6c","text":"Please provide a detailed description of the data in the table for analysis and interpretation."}
{"_id":"q1a73dbb0","text":"'Compare the operating profit figures for each year to identify the year with the largest operating profit.'"}
{"_id":"q1a71d766","text":"'Calculate the difference in spending on \"developed technology\" between 2019 and 2018.'"}
{"_id":"q1a722b6c","text":"Calculate the average cost of net revenue for the years ending December 31, 2018, and 2019."}
{"_id":"q1a72b3c0","text":"Identify the variables used to calculate the value of government grants included in trade and other payables from January 1 to December 31."}
{"_id":"q1a72b1f4","text":"'Calculate the change in Webzone's performance from 2018 to 2019.'"}
{"_id":"q1a7255c4","text":"Calculate the total capitalized interest for the years 2018 and 2019."}
{"_id":"q1a73190a","text":"Identify the different segments of product sales and their respective contributions to total sales."}
{"_id":"q1a71d4a0","text":"'What was the total Other Comprehensive Loss before reclassifications for the year 2017?'"}
{"_id":"q1a72accc","text":"Identify the years when Sales to unaffiliated customers were recorded."}
{"_id":"q1a72e2fa","text":"Retrieve the Restricted Share Awards (RSAs) for the fiscal years 2019, 2018, and 2017, and present the values for each year respectively."}
{"_id":"q1a71746a","text":"Calculate the percentage change in total assets for Corporate and eliminations from 2018 to 2019."}
{"_id":"q1a73550a","text":"Identify the source of the selected financial data for each of the five years ending December 31, 2019."}
{"_id":"q1a7391aa","text":"Calculate the change in the accumulated benefit obligation for foreign defined benefit pension plans from 2018 to 2019."}
{"_id":"q1a73df34","text":"'List the years when revenue was less than 500,000 thousand.'"}
{"_id":"q1a711e7a","text":"Identify the factors that led to the increase in capital expenditures for wireless services."}
{"_id":"q1a734812","text":"Calculate the average general and administrative expenses for the years 2017 and 2018."}
{"_id":"q1a738692","text":"What was the total revenue generated by the software industry in 2019?"}
{"_id":"q1a737c6a","text":"'Provide the percentage of direct sales to contract manufacturers and consignment warehouses for the years 2017, 2018, and 2019, respectively.'"}
{"_id":"q1a737d50","text":"Calculate the average revenue of Avnet Logistics for the years 2017, 2018, and 2019."}
{"_id":"q1a71cc58","text":"Calculate the percentage change in life expectancy at age 65 for 2019."}
{"_id":"q1a71d798","text":"Find the investor note that provides details on Oracle's intangible assets and their amortization."}
{"_id":"q1a74197c","text":"Calculate the percentage of IPTV subscribers relative to the total retail subscribers in 2019."}
{"_id":"q1a71762c","text":"What are the criteria for revenue recognition in accounting?"}
{"_id":"q1a720420","text":"Identify the reasons for the decrease in cash flow from operating activities in 2019 compared to 2018."}
{"_id":"q1a71f480","text":"Calculate the average Net Sales for the fiscal year ending April 28, 2018, compared to the previous year ending April 29, 2017."}
{"_id":"q1a73c986","text":"Retrieve the cash remuneration amounts for the Board of Directors for the fiscal years ending June 30, 2017, 2018, and 2019."}
{"_id":"q1a73d084","text":"'What were the cash and cash equivalents for the year 2019?'"}
{"_id":"q1a7405e0","text":"What are the steps involved in purchasing inventory?"}
{"_id":"q1a720a42","text":"Calculate the average number of non-vested RSU shares from December 31, 2018, to December 31, 2019."}
{"_id":"q1a727306","text":"What was the total fair value of money market funds on June 30, 2018?"}
{"_id":"q1a72c694","text":"'List the years when the U.S. Federal statutory tax rate was in effect.'"}
{"_id":"q1a737efe","text":"What items or categories are included under \"Other\" in the table?"}
{"_id":"q1a72a9ac","text":"Retrieve the Loss from discontinued operations for the year 2019."}
{"_id":"q1a727d7e","text":"'Identify the year when Products and Licensing revenue fell below 25 million.'"}
{"_id":"q1a716b96","text":"'What were the effective tax rates for 2018 and 2019?'"}
{"_id":"q1a72de9a","text":"Calculate the difference between total operating lease obligations and total capital lease obligations."}
{"_id":"q1a714530","text":"Calculate the percentage change in the amount of Accruals."}
{"_id":"q1a71f8d6","text":"'What was the principal amount for loans or investments in 2019?'"}
{"_id":"q1a71cba4","text":"Calculate the weighted average duration of the post-employment benefit obligation."}
{"_id":"q1a712d7a","text":"List the individuals or entities that did not receive a FY19 EAIP payout."}
{"_id":"q1a734fa6","text":"'What was the risk-free interest rate for the year 2018?'"}
{"_id":"q1a71a1f6","text":"Calculate the change in Adjusted EBITDA between 2018 and 2019."}
{"_id":"q1a736932","text":"Calculate the change in deferred tax assets from 2018 to 2019."}
{"_id":"q1a7279b4","text":"'What was the revenue growth rate for 2019?'"}
{"_id":"q1a7379f4","text":"List the components that make up operating expenses in financial statements."}
{"_id":"q1a72b5dc","text":"'List the years when information about granted and vested shares of common stock is available.'"}
{"_id":"q1a73058c","text":"Retrieve the amortization expense for the year 2019."}
{"_id":"q1a72c05e","text":"Identify the factors that led to a decrease in net cash provided by operating activities."}
{"_id":"q1a739d12","text":"Retrieve the total amount of short-term lines of credit as of the end of 2019."}
{"_id":"q1a729ffc","text":"Identify the year when Bell had the highest number of new subscribers in retail Internet, IPTV, and wireless growth services."}
{"_id":"q1a717956","text":"'Calculate the change in data and analytic services from 2017 to 2019.'"}
{"_id":"q1a7323dc","text":"Identify the factors that caused a decrease in shipping revenues."}
{"_id":"q1a725e48","text":"Retrieve the operating accruals for the years 2018 and 2019."}
{"_id":"q1a71de96","text":"'Identify the year when the value of purchased parts and assemblies was larger.'"}
{"_id":"q1a7146ac","text":"Retrieve the foreign pretax income data for the year 2018."}
{"_id":"q1a727338","text":"'Compare the total fair value of money market funds at the end of 2018 and 2019 to identify which year has a higher value.'"}
{"_id":"q1a730924","text":"Calculate the year-on-year change in revenue for FinTech and Business Services."}
{"_id":"q1a712a14","text":"What methods are used to determine the fair value of financial instruments that are not actively traded?"}
{"_id":"q1a7258ee","text":"What are the main components contributing to BTL's losses?"}
{"_id":"q1a717bcc","text":"Calculate the outstanding percentage of the loan used for acquiring an excavator."}
{"_id":"q1a72f736","text":"'Calculate the difference in revenue between the Americas and Asia Pacific for the year 2019.'"}
{"_id":"q1a73d8d6","text":"Calculate the average audit-related fees for the most recent fiscal year."}
{"_id":"q1a7215dc","text":"Calculate the percentage change in long-term deferred revenue between 2018 and 2019."}
{"_id":"q1a7137b6","text":"Calculate the difference between total operating lease obligations and total other purchase obligations and commitments."}
{"_id":"q1a726fc8","text":"What is the total amount of debt obligations?"}
{"_id":"q1a73f6b8","text":"'What were the total expenditures on building and building improvements in 2018?'"}
{"_id":"q1a722b9e","text":"Calculate the average percentage of net revenue relative to the cost of net revenue for the years ended December 31, 2018, and 2019."}
{"_id":"q1a7157e6","text":"Calculate the difference in income taxes payable from 2018 to 2019."}
{"_id":"q1a7386ec","text":"Calculate the total value of the top 3 property and equipment in 2018."}
{"_id":"q1a737fee","text":"Identify the primary component contributing to total accrued expenses and other payables."}
{"_id":"q1a729354","text":"What are the initial products or forms in which processed chicken is sold?"}
{"_id":"q1a732198","text":"'What are the excluded potential common shares for the year 2019?'"}
{"_id":"q1a728be8","text":"Calculate the percentage change in total product revenue from 2018 to 2019."}
{"_id":"q1a73e600","text":"'Compare the values of Other financial income across different years to identify the year with the largest amount.'"}
{"_id":"q1a71415c","text":"'Compare the share of net earnings for Golar Partners across different years to identify the year with the highest share.'"}
{"_id":"q1a735f28","text":"Identify the factors that contributed to the revenue growth of DRAM and NAND from 2017 to 2018."}
{"_id":"q1a738f2a","text":"'Determine the number of years in which current foreign provision for income tax was greater than $40 million.'"}
{"_id":"q1a73a546","text":"'Provide the number of exercisable shares excluded for the years 2019 and 2018, respectively.'"}
{"_id":"q1a72967e","text":"'Compare the total loans due from subsidiaries for each year to identify which year had a higher amount.'"}
{"_id":"q1a717b9a","text":"Calculate the percentage change in subtotal loans payable from 2018 to 2019."}
{"_id":"q1a724ab6","text":"What are the components and implications of the Group's deferred income balances?"}
{"_id":"q1a735f78","text":"Calculate the percentage change in gross margin from 2018 to 2019."}
{"_id":"q1a72a24a","text":"What are the main activities or services offered by the company?"}
{"_id":"q1a72c2ca","text":"What is the carrying value of long-term debt?"}
{"_id":"q1a73c954","text":"Identify the key management personnel of the Group."}
{"_id":"q1a73d886","text":"Identify the authority or committee responsible for approving audit and non-audit services provided by Ernst & Young."}
{"_id":"q1a73b374","text":"'Retrieve the total number of shares granted in 2018.'"}
{"_id":"q1a7406bc","text":"Calculate the percentage change in Accounts Payable to Supplier A from 2018 to 2019."}
{"_id":"q1a72b60e","text":"'Identify the year with the smallest weighted average grant-date fair value per common stock.'"}
{"_id":"q1a72ce82","text":"Identify the top two prepaid expenses recorded in 2019."}
{"_id":"q1a73ef92","text":"'What were the expected volatility figures for 2017 and 2018?'"}
{"_id":"q1a71f9bc","text":"Calculate the effective interest rate for the liability component."}
{"_id":"q1a711740","text":"Identify the years for which the table includes data on R&D, sales and marketing, and G&A expenses."}
{"_id":"q1a724160","text":"'What was the percentage of semiconductor manufacturing at 14 nanometers and smaller in 2017?'"}
{"_id":"q1a721230","text":"'What factors contributed to the decrease in restructuring costs from 2018 to 2019?'"}
{"_id":"q1a721c9e","text":"Calculate the percentage of cash and cash equivalents held outside the U.S. as of December 31, 2019."}
{"_id":"q1a737f30","text":"Please provide a detailed description of the data in the table for analysis and interpretation."}
{"_id":"q1a735af0","text":"What is the expiration date for Lifeway's share repurchase program?"}
{"_id":"q1a738f02","text":"What was the income tax provision in the Current State for the year 2017?"}
{"_id":"q1a71f232","text":"'List the years for which the table provides operating income data by reportable segment.'"}
{"_id":"q1a71ba74","text":"Calculate the difference in restructuring expenses between 2019 and 2018."}
{"_id":"q1a72fad8","text":"Calculate the loss from bond repurchases at a premium in 2019."}
{"_id":"q1a7282d8","text":"List the years for which the table provides amortization information on purchased intangible assets."}
{"_id":"q1a718914","text":"'What is the typical payment schedule for trade payables?'"}
{"_id":"q1a71d9f0","text":"Calculate the change in personnel expenses from the 2017\/2018 fiscal year to the 2018\/2019 fiscal year."}
{"_id":"q1a731978","text":"Calculate the percentage change in total product sales between 2018 and 2019."}
{"_id":"q1a736ef0","text":"Calculate the difference in Early debt extinguishment costs between 2018 and 2019."}
{"_id":"q1a732666","text":"Calculate the percentage change in sales in the United States from 2018 to 2019."}
{"_id":"q1a71efda","text":"Calculate the average accrued expenses for the years 2018 and 2019."}
{"_id":"q1a73574e","text":"Calculate the company's return on assets (ROA) for the year 2017."}
{"_id":"q1a72af38","text":"What were the reasons for adjusting accruals and other liabilities?"}
{"_id":"q1a736676","text":"'What were the net liabilities for the year 2019?'"}
{"_id":"q1a7333fe","text":"Retrieve the accounts receivable figures for the years 2019 and 2018."}
{"_id":"q1a7347b8","text":"Retrieve the general and administrative expenses for the year ended 2019."}
{"_id":"q1a728b8e","text":"Calculate the change in total products and services from 2017 to 2018."}
{"_id":"q1a7204b6","text":"Calculate the percentage change in cash flows from operating activities between 2018 and 2019."}
{"_id":"q1a7308f2","text":"Calculate the year-on-year change in VAS Business revenue."}
{"_id":"q1a73feba","text":"Calculate the increase in ROFE (Return on Funds Employed) on a normalized basis from F18 to F19."}
{"_id":"q1a729dea","text":"Identify the year with the lowest transaction-based costs."}
{"_id":"q1a72b636","text":"Calculate the change in the fair value of common stock that vested in 2019 compared to 2018."}
{"_id":"q1a7401c6","text":"Calculate the difference in the number of active users from 2018 to 2019."}
{"_id":"q1a73292c","text":"'What is the tax rate applied to fully franked dividends?'"}
{"_id":"q1a735226","text":"'Determine the number of years in which shares issued under the ESPP exceeded $2 million.'"}
{"_id":"q1a73d5e8","text":"'Find the number of shares issued in February 2018.'"}
{"_id":"q1a741922","text":"'Calculate the change in the number of IPTV retail subscribers from the beginning to the end of 2019.'"}
{"_id":"q1a7403b0","text":"Identify the components that contribute to the total prepayments listed in the table."}
{"_id":"q1a7370d0","text":"'Compare the revenue figures for the UK across different years to identify the year with the largest revenue.'"}
{"_id":"q1a71909e","text":"Calculate the change in the Amount using the statutory rate from 2018 to 2019."}
{"_id":"q1a72e714","text":"Identify the factors that led to the increase in amortization of intangible assets in 2019."}
{"_id":"q1a738f52","text":"Calculate the change in total current provision for income tax from 2017 to 2018."}
{"_id":"q1a71418e","text":"'Calculate the change in ownership interest held in Golar Partners over the specified period.'"}
{"_id":"q1a722e64","text":"Calculate the percentage change in finance costs from 2018 to 2019."}
{"_id":"q1a719ce2","text":"'List the different types of non-cash changes and their definitions.'"}
{"_id":"q1a71276c","text":"Calculate the difference between the actual group cash generation and the target group cash generation for 2019."}
{"_id":"q1a7366a8","text":"'What were the net liabilities in 2018?'"}
{"_id":"q1a717d70","text":"What components are included in the total employee expenditure listed in the table?"}
{"_id":"q1a7345b0","text":"Calculate the change in the Projected Benefit Obligation from 2018 to 2019."}
{"_id":"q1a73224c","text":"Calculate the percentage change in earnings allocated to participating securities from 2018 to 2019."}
{"_id":"q1a72e7c8","text":"'Identify the year when ASTRO Acquisition was the primary driver of growth or change.'"}
{"_id":"q1a729d68","text":"Identify the factors used in the calculation of adjusted revenue."}
{"_id":"q1a73f47e","text":"'List the years included in the table showing unrecognized tax benefits and their impact on the effective income tax rate if recognized.'"}
{"_id":"q1a713b26","text":"What items are excluded from the non-GAAP results?"}
{"_id":"q1a73d6a6","text":"Calculate the change in share balance between June 2018 and June 2019."}
{"_id":"q1a740144","text":"What strategies does the company use to grow its user community?"}
{"_id":"q1a73fe88","text":"What is the Return on Financial Equity (ROFE) for the fiscal year 2019?"}
{"_id":"q1a72a77c","text":"Calculate the change in trade receivables from 2018 to 2019."}
{"_id":"q1a734a56","text":"Calculate the total net revenue for fiscal years 2017 and 2018 combined."}
{"_id":"q1a7344f2","text":"List the years for which the table shows projected benefit obligation, accumulated benefit obligation, and fair value of plan assets for the company's Pension Plans."}
{"_id":"q1a73eb1e","text":"'What were the net unrealized holding gains or losses for the year 2018?'"}
{"_id":"q1a731266","text":"'Calculate the change in Other miscellaneous assets from 2018 to 2019.'"}
{"_id":"q1a7124e2","text":"Calculate the percentage change in balance from January 1, 2017, to December 31, 2017."}
{"_id":"q1a71f2b4","text":"Calculate the percentage change in total operating income from 2018 to 2019."}
{"_id":"q1a71a642","text":"'Retrieve the net accounts receivable figure for the year 2019.'"}
{"_id":"q1a71ef80","text":"Calculate the change in lease liability between 2018 and 2019."}
{"_id":"q1a7355a0","text":"Calculate the percentage change in revenues between 2018 and 2019."}
{"_id":"q1a73cbf2","text":"Identify the components that make up warranty liability in accounting."}
{"_id":"q1a7302d0","text":"Calculate the total gross carrying value for the specified asset or financial statement."}
{"_id":"q1a72a718","text":"'What were the unbilled trade receivables for the year 2018?'"}
{"_id":"q1a72a272","text":"What products or services does the company offer?"}
{"_id":"q1a71bd76","text":"Calculate the percentage change in the net periodic benefit cost discount rate from 2018 to 2019."}
{"_id":"q1a73ed76","text":"'What was the basic net income attributable to common stockholders of American Tower Corporation in 2018?'"}
{"_id":"q1a7362c0","text":"Calculate the percentage change in the total number of shares from June 30, 2018, to June 30, 2019."}
{"_id":"q1a726f64","text":"What are the components of the company's debt obligations?"}
{"_id":"q1a7282a6","text":"What factors contributed to the decrease in amortization of purchased intangible assets?"}
{"_id":"q1a7171c2","text":"Calculate the average age of the executive officers in the company."}
{"_id":"q1a727b1c","text":"Calculate the change in Constant Currency revenue from 2018 to 2019."}
{"_id":"q1a7401f8","text":"Calculate the percentage change in the number of devices sold between 2018 and 2019."}
{"_id":"q1a712aaa","text":"Calculate the change in level 1 FVPL from the end of 2018 to the end of 2019."}
{"_id":"q1a738962","text":"Calculate the percentage change in the balance from the beginning of 2018 to the beginning of 2019."}
{"_id":"q1a732c10","text":"'Identify the factors that contributed to the increase in Noncurrent liabilities.'"}
{"_id":"q1a716f74","text":"Calculate the difference in litigation expenses between 2017 and 2018."}
{"_id":"q1a72afec","text":"Calculate the percentage change in Accruals and other liabilities from 2018 to 2019."}
{"_id":"q1a7326c0","text":"Calculate the percentage change in total net sales between 2018 and 2019."}
{"_id":"q1a720510","text":"Calculate the percentage change in cash and cash equivalents from 2018 to 2019."}
{"_id":"q1a73fbfe","text":"List the individuals who were appointed as executive officers during fiscal year 2019."}
{"_id":"q1a74016c","text":"'What is the total number of devices sold worldwide in 2019?'"}
{"_id":"q1a71f908","text":"Determine the net carrying amount before unamortized debt issuance costs for the year 2018."}
{"_id":"q1a71ec4c","text":"Calculate the change in amortization of other intangible assets from 2018 to 2019."}
{"_id":"q1a7284b8","text":"List the components that make up inventories."}
{"_id":"q1a72d332","text":"'List the years for which the number of options outstanding was calculated as of 31 March.'"}
{"_id":"q1a72afc4","text":"Calculate the change in Distributions payable from 2018 to 2019."}
{"_id":"q1a7390e2","text":"Retrieve the accumulated benefit obligation for United States defined benefit pension plans in 2019."}
{"_id":"q1a728918","text":"Calculate the change in media revenue between 2017 and 2018 to find the increase or decrease."}
{"_id":"q1a737d28","text":"Calculate the change in Sanmina's revenues between 2018 and 2019."}
{"_id":"q1a71e99a","text":"Calculate the change in net Property and Equipment in the United Kingdom from the year ending March 31, 2018, to the year ending March 31, 2019."}
{"_id":"q1a71ffc0","text":"Calculate the net profit excluding impairment charges."}
{"_id":"q1a73f690","text":"'What was the depreciation expense for property, plant, and equipment in 2019?'"}
{"_id":"q1a71bfec","text":"Calculate the percentage change in revenue from customer B between 2018 and 2019."}
{"_id":"q1a725038","text":"Calculate the total number of shares of common stock that were issuable under equity incentive plans from 2017 to 2019."}
{"_id":"q1a72fede","text":"'Identify the year when \"Other\" was larger compared to the specified category or value.'"}
{"_id":"q1a739d9e","text":"Calculate the percentage of purchase obligations relative to total contractual obligations."}
{"_id":"q1a72fe84","text":"What were the tax credits available in 2019?"}
{"_id":"q1a715d90","text":"Calculate the proportion of goodwill, trademarks, other intangible assets, and investment in unconsolidated subsidiaries relative to total liabilities for the year 2018."}
{"_id":"q1a722ebe","text":"Calculate the total expenses for the fiscal year 2019 (FY19)."}
{"_id":"q1a733962","text":"Identify the geographic reportable segments for which the company's revenue information is provided in the table."}
{"_id":"q1a724da4","text":"'What was the cash provision amount for the year 2017?'"}
{"_id":"q1a718978","text":"Retrieve the value of trade payables for the year 2019."}
{"_id":"q1a71cef6","text":"Calculate the difference in cash paid for interest between 2018 and 2019."}
{"_id":"q1a72c6bc","text":"'Identify the year with the highest U.S. Federal statutory tax rate.'"}
{"_id":"q1a721884","text":"Calculate the percentage change in surcharge revenue from 2018 to 2019."}
{"_id":"q1a735a96","text":"'Find the date when Lifeway publicly announced their share repurchase program.'"}
{"_id":"q1a727392","text":"Calculate the change in the total fair value of long-lived assets held for sale from 2018 to 2019."}
{"_id":"q1a738638","text":"'Retrieve the depreciation expense for the fiscal year 2019.'"}
{"_id":"q1a735546","text":"Rewritten Query: 'What additional financial data should be considered alongside the selected financial data for accurate analysis?'"}
{"_id":"q1a723b8e","text":"'Calculate the total income for the year 2017.'"}
{"_id":"q1a72fb8c","text":"Calculate the percentage change in total financial costs between 2017 and 2019."}
{"_id":"q1a72a7cc","text":"Calculate the percentage change in net trade receivables from 2018 to 2019."}
{"_id":"q1a72d5ee","text":"Retrieve the software and hardware revenue figures for the years 2018 and 2019."}
{"_id":"q1a733c82","text":"'Determine the number of years in which the tax benefit for stock compensation expense was greater than $1,000 thousand.'"}
{"_id":"q1a7212e4","text":"Calculate the difference in accelerated depreciation amounts for the years 2018 and 2019."}
{"_id":"q1a71f6e2","text":"What components are included in the calculation of net cash inflow from operating activities?"}
{"_id":"q1a72e14c","text":"Calculate the change in revenue from South America between 2017 and 2018."}
{"_id":"q1a740694","text":"Calculate the percentage change in inventory purchases from Supplier A between 2017 and 2018."}
{"_id":"q1a7391d2","text":"Calculate the percentage change in the accumulated benefit obligation for foreign defined benefit pension plans from 2018 to 2019."}
{"_id":"q1a715d36","text":"'What were the inventory asset values for fiscal years 2018 and 2019?'"}
{"_id":"q1a72b442","text":"Calculate the percentage change in the amount as of 31 December."}
{"_id":"q1a724624","text":"Retrieve the net income per basic share for the pro forma year ending September 30, 2018."}
{"_id":"q1a716bf0","text":"'Calculate the change in the Effective tax rate from 2018 to 2019.'"}
{"_id":"q1a73a5a0","text":"Calculate the average diluted EPS and shares outstanding for the years 2018 and 2019."}
{"_id":"q1a72556a","text":"Calculate the change in capitalized interest for the year 2019."}
{"_id":"q1a73439e","text":"What were the reasons for the slight decrease in board compensation from 2018 to 2019?"}
{"_id":"q1a733674","text":"Define purchase obligations and explain their significance in contracts or agreements."}
{"_id":"q1a712e10","text":"Calculate the total salary of NEOs (Named Executive Officers)."}
{"_id":"q1a7264b0","text":"'What was the total income from foreign countries in 2019?'"}
{"_id":"q1a73dc0a","text":"Calculate the percentage change in profit before taxation from 2018 to 2019."}
{"_id":"q1a73b9fa","text":"Calculate the total fair value of restricted stock that vested in 2017, 2018, and 2019, and then find the sum of these values."}
{"_id":"q1a73ef2e","text":"'What was the amount of unrecognized compensation cost for the year 2020?'"}
{"_id":"q1a7248cc","text":"'What was the expected volatility on December 31, 2019?'"}
{"_id":"q1a726c4e","text":"'What were the impairment charges for the Grocery & Snacks segment in fiscal year 2019?'"}
{"_id":"q1a72c2fc","text":"Calculate the difference between the carrying value and the fair value of Notes Payable for the year 2019."}
{"_id":"q1a72e1b0","text":"Calculate the total revenue of the top 3 companies in 2018."}
{"_id":"q1a736e3c","text":"Retrieve the pension and benefit credits data for the year 2018."}
{"_id":"q1a71828e","text":"Calculate the percentage change in the capital intensity ratio for BCE."}
{"_id":"q1a73fc80","text":"Calculate the percentage increase in Mr. Kapuria's salary following his promotion."}
{"_id":"q1a73a79e","text":"'Compare the net current trade accounts receivable for each year to identify the year with the largest amount.'"}
{"_id":"q1a7368b0","text":"Determine the fair value of the company's equity interest in LNTL."}
{"_id":"q1a72e354","text":"Retrieve the total amount of convertible notes issued in the fiscal year 2019."}
{"_id":"q1a73dee4","text":"Calculate the change in revenues from 2018 to 2019."}
{"_id":"q1a739790","text":"'Explain the meaning of a credit risk rating of 7 or higher for a company.'"}
{"_id":"q1a733f84","text":"'What percentage of the remaining interests in Inotera did the company acquire in 2016?'"}
{"_id":"q1a74063a","text":"Calculate the percentage of total inventory purchases that Supplier C contributed in 2019."}
{"_id":"q1a731f9a","text":"Calculate the Customer Support Revenues of the Americas as a percentage of the GAAP-based Customer Support Gross Profit for Fiscal Year 2019."}
{"_id":"q1a73b428","text":"'Compare the number of outstanding shares at the end of each year to identify which year has a higher total.'"}
{"_id":"q1a7293ae","text":"Calculate the average value added percentage from fresh vacuum-sealed registrant processed chicken relative to net sales for fiscal years 2018 and 2019."}
{"_id":"q1a7395f6","text":"Calculate the percentage change in total accrued liabilities from 2018 to 2019."}
{"_id":"q1a71e972","text":"Calculate the change in net Property and Equipment in the United States from March 31, 2018 to March 31, 2019."}
{"_id":"q1a72b140","text":"What factors determine the allocation of goodwill to the appropriate Cash Generating Unit (CGU)?"}
{"_id":"q1a73866a","text":"'What was the total value of leasehold improvements in 2019?'"}
{"_id":"q1a71fb88","text":"What was the total accrued revenue for the year 2018?"}
{"_id":"q1a73acee","text":"'What methods were used to value the company's inventories?'"}
{"_id":"q1a73f1c2","text":"Calculate the increase in selling and administrative expenses as a percentage of net sales in 2019 compared to 2018, expressed in basis points."}
{"_id":"q1a738386","text":"'Provide the voyage revenues for 2018 and 2019, and compare the two years.'"}
{"_id":"q1a72830a","text":"'Retrieve the cost of sales for the year 2019.'"}
{"_id":"q1a7295f2","text":"Please provide a detailed description of the data in the table for analysis and interpretation."}
{"_id":"q1a723698","text":"Retrieve the Net income or loss figures for the year 2019."}
{"_id":"q1a72291e","text":"'What were the research and development labor resources in the fiscal year 2019?'"}
{"_id":"q1a7229aa","text":"Calculate the difference in the fiscal increase for payroll and payroll-related benefits between 2019 and 2018, and between 2018 and 2017."}
{"_id":"q1a741b52","text":"'Compare the values of raw materials and supplies across different years to identify the year with the largest amount.'"}
{"_id":"q1a733700","text":"'Calculate the total operating lease obligations of the company from 2020 to 2022.'"}
{"_id":"q1a721028","text":"Determine the total goodwill acquired in fiscal 2019, excluding the goodwill from the acquisition of BOLTS Technologies, Inc."}
{"_id":"q1a711ede","text":"Calculate the change in wireless capital expenditure between 2018 and 2019, specifying whether it was an increase or decrease."}
{"_id":"q1a724d72","text":"Retrieve the net cash provided by or used in operating activities for the year 2017."}
{"_id":"q1a721262","text":"Calculate the decrease in restructuring costs from 2018 to 2019."}
{"_id":"q1a72c0c2","text":"Identify the factors contributing to the year-over-year increase in cash flow from financing activities."}
{"_id":"q1a71bace","text":"What are the components of restructuring expenses?"}
{"_id":"q1a73d160","text":"Calculate the percentage change in cash and cash equivalents from 2018 to 2019."}
{"_id":"q1a73b18a","text":"'Calculate the percentage of revenue allocated to Research and Development expenses for the years 2019 and 2018.'"}
{"_id":"q1a7277b6","text":"Calculate the total sitting fees as a percentage of the total managerial remuneration."}
{"_id":"q1a7321f2","text":"Calculate the change in net income from 2018 to 2019, specifying whether it was an increase or decrease."}
{"_id":"q1a731234","text":"'What was the amount of long-term prepaid ground rent in 2018?'"}
{"_id":"q1a738be2","text":"What factors contributed to the increase in income tax benefits?"}
{"_id":"q1a72b19a","text":"Identify the components that contribute to the total carrying value of Cash-Generating Units (CGUs) in the provided table."}
{"_id":"q1a72394a","text":"'What was the total subscription revenue for the year 2019?'"}
{"_id":"q1a7254ca","text":"Determine the average interest rate used for capitalized interest calculations in 2018."}
{"_id":"q1a7379c2","text":"List the components that make up revenue in financial statements."}
{"_id":"q1a737cf6","text":"'Identify the year when Flextronics Technology's percentage fell below 20.0%.'"}
{"_id":"q1a73bbd0","text":"What are the main components of \"Other non-current assets\" in 2018?"}
{"_id":"q1a741e36","text":"Calculate the percentage effect of dilutive securities that are excluded as anti-dilutive for the fiscal year 2019."}
{"_id":"q1a72a2a4","text":"Calculate the change in communication figures between 2018 and 2019, specifying whether it is an increase or decrease."}
{"_id":"q1a714a12","text":"Calculate the percentage change in net property and equipment from 2018 to 2019."}
{"_id":"q1a714f08","text":"'What is the average cash compensation fee for non-employee directors?'"}
{"_id":"q1a73cf12","text":"Calculate the average net loss for the years 2018 and 2019."}
{"_id":"q1a71fc14","text":"Calculate the difference between unearned revenue and accrued revenue for the year 2019."}
{"_id":"q1a71fff2","text":"Rewritten Query: 'Explain why the company reports net profit without including impairment losses.'"}
{"_id":"q1a731716","text":"Calculate the percentage change in contract amounts over the past year."}
{"_id":"q1a733426","text":"Calculate the average value of employee benefits for the years 2018 and 2019."}
{"_id":"q1a732e68","text":"Determine the total number of restricted share units allocated under the 2001 share incentive plan."}
{"_id":"q1a732ec2","text":"What percentage of the total shares available for future issuance under equity compensation plans is represented by the Amended and Restated 2010 Share Incentive Plan?"}
{"_id":"q1a7239f4","text":"Calculate the percentage change in Total Revenue from 2017 to 2018."}
{"_id":"q1a7393d0","text":"Calculate the percentage of non-current assets of the United Kingdom relative to the total non-current assets in Europe, the Middle East, and Africa for the year 2019."}
{"_id":"q1a72af6a","text":"Identify the years listed in the table."}
{"_id":"q1a73e3a8","text":"Calculate the percentage change in total segment net revenues from 2018 to 2019."}
{"_id":"q1a7243b8","text":"'Identify the organization responsible for certifying research and development (R&D) centers.'"}
{"_id":"q1a71d70c","text":"'What was the average total amortization of intangible assets for the years 2018 and 2019?'"}
{"_id":"q1a72399a","text":"Calculate the difference in Subscription Revenue from 2018 to 2019."}
{"_id":"q1a7161a0","text":"Calculate the average basic earnings per share (EPS) for the fiscal years 2017, 2018, and 2019."}
{"_id":"q1a73deb2","text":"What is the amount of income tax benefit included in the net income for fiscal year 2018?"}
{"_id":"q1a7415da","text":"'Find the number of shares owned by Brian Kinion and Christopher Lien, respectively.'"}
{"_id":"q1a731f18","text":"What are the main components that make up the cost of customer support revenues?"}
{"_id":"q1a715cc8","text":"What was the amount of gross unrecognized tax benefits liability for fiscal year 2019?"}
{"_id":"q1a72c630","text":"'What was the U.S. Federal statutory tax rate for the year 2019?'"}
{"_id":"q1a72ec6e","text":"'Count the number of years when professional fees were greater than $1,000,000.'"}
{"_id":"q1a73736e","text":"What components constitute the currency translation reserve?"}
{"_id":"q1a73b702","text":"'What was the amortization expense for the year ending December 31, 2019, as reported in 2018?'"}
{"_id":"q1a71a174","text":"What factors contributed to the increase in amortization of purchased intangibles in the CTS operating results?"}
{"_id":"q1a71b4b6","text":"'What was the amount by which the company's valuation allowance decreased in 2019?'"}
{"_id":"q1a72a74a","text":"'What were the trade receivables for the year 2019?'"}
{"_id":"q1a72d8a0","text":"What are the components of the company's financing arrangements?"}
{"_id":"q1a71bd44","text":"'What was the percentage increase in compensation rates in 2019?'"}
{"_id":"q1a7186b2","text":"Calculate the percentage change in goodwill from 2018 to 2019."}
{"_id":"q1a73a5c8","text":"Calculate the difference in Basic EPS shares outstanding between 2018 and 2019."}
{"_id":"q1a7388ae","text":"What methods does the company use to calculate the allowance for doubtful accounts?"}
{"_id":"q1a71c92e","text":"Calculate the additional rental revenue generated by the refranchising strategy in 2019."}
{"_id":"q1a73b1e4","text":"'Identify the year when research and development expenses were below 50,000 thousand dollars.'"}
{"_id":"q1a72d062","text":"Calculate the change in interest expense from 2018 to 2019. What is the difference?"}
{"_id":"q1a73d82c","text":"What are the components that make up an audit fee?"}
{"_id":"q1a7397c2","text":"Calculate the total gross receivables for credit ratings 1 through 4 for the year 2019."}
{"_id":"q1a71e10c","text":"Calculate the ratio of net cash provided by operating activities to net cash used in investing activities for the year 2019."}
{"_id":"q1a731f72","text":"Calculate the mean annual GAAP-based Customer Support Gross Profit."}
{"_id":"q1a711b6e","text":"'What are the total assets reported as of June 30, 2019?'"}
{"_id":"q1a711f42","text":"Calculate the percentage change in capital expenditure from 2018 to 2019."}
{"_id":"q1a713720","text":"What components are included in operating lease obligations?"}
{"_id":"q1a7130e0","text":"Retrieve the net income data for August 2019."}
{"_id":"q1a729886","text":"Calculate the percentage change in goodwill impairment from 2017 to 2018."}
{"_id":"q1a71412a","text":"'What was the impairment charge amount for the year 2018?'"}
{"_id":"q1a733106","text":"Rewritten Query: 'Explain the method used by the company to calculate the volatility of derivatives.'"}
{"_id":"q1a7413aa","text":"Calculate the percentage change in total net property, plant, and equipment from 2018 to 2019."}
{"_id":"q1a73ebc8","text":"Calculate the percentage change in dividend and interest income from 2017 to 2018."}
{"_id":"q1a71c9e2","text":"Calculate the percentage of franchise rental revenues relative to total franchise revenues for the year 2019."}
{"_id":"q1a740914","text":"Calculate the average of current maturities for the latest financial data available."}
{"_id":"q1a7254fc","text":"What does the average rate for calculating capitalized interest indicate?"}
{"_id":"q1a7276d0","text":"'What are the sitting fees for Aman Mehta when attending board or committee meetings?'"}
{"_id":"q1a73f71c","text":"Calculate the change in the value of Machinery and Equipment from 2018 to 2019."}
{"_id":"q1a734588","text":"'Determine the number of years when the Accumulated Benefit Obligation was greater than $3,000 thousand.'"}
{"_id":"q1a71e3dc","text":"Calculate the difference between the high and low price per share for the first quarter of 2018."}
{"_id":"q1a72268a","text":"What items are included in special charges (recoveries)?"}
{"_id":"q1a72e796","text":"Calculate the average total amortization of intangibles for the years 2017, 2018, and 2019."}
{"_id":"q1a71ce9c","text":"'What was the amount of debt used for the acquisition of communication sites in 2018?'"}
{"_id":"q1a722720","text":"Calculate the average annual total charges for the specified period."}
{"_id":"q1a73edd0","text":"Calculate the change in Pro forma net income for American Tower Corporation common stockholders from 2018 to 2019."}
{"_id":"q1a73aaaa","text":"'What percentage of the total share-based compensation expense in 2019 is attributed to nonvested stock units?'"}
{"_id":"q1a738c0a","text":"'What was the value of minority interest in 2019?' \n\nRewritten Query: 'Provide the value of minority interest for the year 2019.'"}
{"_id":"q1a716966","text":"Calculate the average deferred compensation for the years 2018 and 2019."}
{"_id":"q1a71a8fe","text":"'What were the net earnings from operations for the year 2018?'"}
{"_id":"q1a73703a","text":"What is the outcome of a group serving a large number of customers?"}
{"_id":"q1a727dd8","text":"'Provide the Products and Licensing revenue figures for 2019 and 2018, respectively.'"}
{"_id":"q1a7339c6","text":"'What was the revenue generated from the Aerospace\/Defense sector in the AMER region?'"}
{"_id":"q1a740432","text":"Calculate the percentage change in prepaid taxes between 2018 and 2019."}
{"_id":"q1a73a03c","text":"Calculate the percentage change in revenue from Other regions from 2018 to 2019."}
{"_id":"q1a73d854","text":"What components are included in tax fees?"}
{"_id":"q1a718036","text":"'What were the average prices per megabit for 2017 and 2018?'"}
{"_id":"q1a72903e","text":"Calculate the net value of Property and Equipment as a percentage of the gross value for 2019."}
{"_id":"q1a721a64","text":"Retrieve the revenue figures for Traditional & Other Products from Network Solutions."}
{"_id":"q1a73dbd8","text":"Calculate the change in profit before taxation from 2018 to 2019."}
{"_id":"q1a71dc98","text":"Calculate the percentage of total revenue that Americas Revenue represented in 2019."}
{"_id":"q1a71fd86","text":"'What was the total revenue for all companies in Q1 2020?'"}
{"_id":"q1a733c32","text":"Determine the intrinsic value of SARS (Share Appreciation Rights) that were exercised in 2017."}
{"_id":"q1a727b4e","text":"Calculate the revenue growth from 2018 to 2019 and determine the change in percentage."}
{"_id":"q1a724412","text":"Calculate the difference in consolidated total R&D expenditure between FY 2018 and FY 2019."}
{"_id":"q1a7190d0","text":"Calculate the change in the Effect of prior year adjustments from 2017 to 2019."}
{"_id":"q1a716bc8","text":"Calculate the average Provision for income taxes for the years 2018 and 2019."}
{"_id":"q1a7349fc","text":"Calculate the percentage variance in net revenues from fiscal year 2017 to fiscal year 2018."}
{"_id":"q1a729ab6","text":"Calculate the average net income attributable to the parent company for the years ending December 31, 2019, and 2018."}
{"_id":"q1a72cbee","text":"What was the value of restricted stock in 2019?"}
{"_id":"q1a727ae0","text":"Calculate the change in Revenue from 2017 to 2018."}
{"_id":"q1a73cc24","text":"Calculate the difference in warranty reserve from the beginning to the end of the period in 2019."}
{"_id":"q1a72e3e0","text":"Calculate the difference in Restricted Share Awards (RSAs) between 2018 and 2019."}
{"_id":"q1a723ea4","text":"Calculate the average cash flow from investing activities for the years 2018 and 2019."}
{"_id":"q1a723152","text":"Calculate the percentage difference between the high values of the first and fourth quarters in fiscal year 2019."}
{"_id":"q1a71d7f2","text":"Rewritten Query: 'Explain the reasons for the increase in amortization of intangible assets from fiscal 2018 to fiscal 2019.'"}
{"_id":"q1a7415a8","text":"'Find the number of shares owned by L. Gordon Crovitz and Donald P. Hutchison, respectively.'"}
{"_id":"q1a724fac","text":"'Provide the number of convertible senior notes issued in 2018 and 2019 for comparison.'"}
{"_id":"q1a716114","text":"What specific information is included in the table?"}
{"_id":"q1a7288f0","text":"Calculate the change in cable revenue between 2017 and 2018, specifying whether it is an increase or decrease."}
{"_id":"q1a735032","text":"Calculate the change in the Weighted Average Grant Date Fair Value from 2018 to 2019, specifying whether it was an increase or decrease."}
{"_id":"q1a73ff6e","text":"Calculate the average sales per square metre for F18 and F19 separately."}
{"_id":"q1a72f2c2","text":"'Identify the year when Other liabilities were larger compared to previous years.'"}
{"_id":"q1a728d46","text":"List the purchases made in fiscal year 2019."}
{"_id":"q1a72098e","text":"Explain the expense recognition process for RSUs (Restricted Stock Units) that have time-based service conditions."}
{"_id":"q1a71447c","text":"'What was the total amount of government grants reported under other payables in 2018?'"}
{"_id":"q1a72801c","text":"Identify the individuals eligible for the noncontributory defined benefit pension plan."}
{"_id":"q1a711812","text":"'Count the number of years when general and administrative expenses were greater than $2,000 million.'"}
{"_id":"q1a72faa6","text":"'Identify the year for which financial income and costs were recorded.'"}
{"_id":"q1a740c20","text":"Calculate the total percentage change in the effect of exchange rate changes on cash and cash equivalents from 2017 to 2019."}
{"_id":"q1a73e5a6","text":"Calculate the total comprehensive income resulting from currency effects and measurement results of hedging transactions and relationships."}
{"_id":"q1a71631c","text":"List the years for which the table shows projected benefit obligation, accumulated benefit obligation, and fair value of plan assets for the company's Pension Plans."}
{"_id":"q1a740b3a","text":"'List the years for which the table includes data on net cash provided by (used in) operating activities.'"}
{"_id":"q1a724fde","text":"'Provide the number of shares of common stock issuable under equity incentive plans for the years 2018 and 2019.'"}
{"_id":"q1a737f94","text":"Calculate the percentage change in Total accrued expenses and other payables from 2018 to 2019."}
{"_id":"q1a71d7ca","text":"Identify the locations or sources from which the company acquired its intangible assets."}
{"_id":"q1a7232ec","text":"What factors are used to determine the lower of cost in accounting?"}
{"_id":"q1a739178","text":"'Compare the accumulated benefit obligation for foreign defined benefit pension plans across different years to identify the year with the largest amount.'"}
{"_id":"q1a728b34","text":"'What was the total revenue generated from Applications in 2019?'"}
{"_id":"q1a72bc58","text":"Calculate the average gross profit of the company for the years 2018 and 2019."}
{"_id":"q1a733c5a","text":"Calculate the change in the intrinsic value of SARS (Share Appreciation Rights) from 2017 to 2018."}
{"_id":"q1a73934e","text":"List the components of non-current assets in the USA for the year 2019."}
{"_id":"q1a711272","text":"'What method did the company adopt for Topic 606 in fiscal 2019?'"}
{"_id":"q1a71e404","text":"'Determine the number of quarters in 2019 when the high share price exceeded $85.00.'"}
{"_id":"q1a723350","text":"Calculate the change in the number of wireless devices and accessories from 2018 to 2019. What is the increase or decrease?"}
{"_id":"q1a7393f8","text":"Calculate the percentage change in non-current assets for the Asia Pacific region."}
{"_id":"q1a72f222","text":"Retrieve the total amount of Other liabilities for the year 2019."}
{"_id":"q1a72aa06","text":"Calculate the change in Loss from discontinued operations between 2017 and 2018."}
{"_id":"q1a7149e0","text":"Calculate the change in leasehold improvements from 2018 to 2019."}
{"_id":"q1a73ac6c","text":"Calculate the change in inventories of finished goods from 2018 to 2019."}
{"_id":"q1a73c77e","text":"Calculate the percentage of total operating service revenues relative to Total Bell Wireless revenues for the year 2019."}
{"_id":"q1a711c04","text":"Calculate the percentage change in total assets from fiscal year 2018 to 2019."}
{"_id":"q1a741378","text":"Calculate the change in the amount of Buildings and Improvements from 2018 to 2019."}
{"_id":"q1a72ca0e","text":"'Compare the net cash flow from operating activities for each year to identify the year with the larger amount.'"}
{"_id":"q1a720cb8","text":"'What was the company's valuation allowance for the year 2019?'"}
{"_id":"q1a717384","text":"Retrieve the total assets of AMER for the year 2018."}
{"_id":"q1a732440","text":"Calculate the change in Time Charter Equivalent revenues from the year ended December 31, 2018, to the year ended December 31, 2019."}
{"_id":"q1a73a578","text":"Retrieve the diluted EPS and shares outstanding for the years 2019 and 2018, and compare the values for both years."}
{"_id":"q1a73bc5c","text":"'Compare the values of oil derivative instruments across different years to identify which year had a higher value.'"}
{"_id":"q1a720ce0","text":"Retrieve the net deferred tax assets for the year 2019."}
{"_id":"q1a720254","text":"Identify the main categories of non-current assets listed in the table."}
{"_id":"q1a7178a2","text":"'List the years for which the table provides data on related party items included in Revenues.'"}
{"_id":"q1a735000","text":"Calculate the percentage change in the weighted average grant date fair value from 2018 to 2019."}
{"_id":"q1a722e3c","text":"What was the landholder duty for acquiring APDC properties in 2019?"}
{"_id":"q1a722bd0","text":"'Identify the year when the cost of net revenue was below 150,000 thousand.'"}
{"_id":"q1a719896","text":"'What was the amount of restricted cash in 2017?'"}
{"_id":"q1a713392","text":"Calculate the difference in ending balances for the years 2018 and 2019."}
{"_id":"q1a7364fa","text":"Calculate the percentage of the amortized costs of corporate bonds relative to the total amortized costs. What is this value?"}
{"_id":"q1a71a89a","text":"What is the formula for calculating basic net earnings per common share?"}
{"_id":"q1a719012","text":"Identify the foreign jurisdictions that significantly impacted income tax provisions."}
{"_id":"q1a737076","text":"What are the details of external revenue reporting?"}
{"_id":"q1a716628","text":"'Compare the years for the total of Over 2 months overdue past due but not impaired receivables to identify which year had a greater amount.'"}
{"_id":"q1a72c3a6","text":"Provide the disclosure details for cash and cash equivalents, accounts receivable, and accounts payable in financial statements."}
{"_id":"q1a72be1a","text":"Calculate the increase in sales and marketing expenses from 2018 to 2019."}
{"_id":"q1a71bd12","text":"'What is the discount rate that was applied in the financial statement?'"}
{"_id":"q1a723094","text":"What are the reasons for a common stock to be delisted from the NASDAQ capital market?"}
{"_id":"q1a731bb2","text":"'What were the total Restricted Stock Unit (RSU) issuances in 2019?'"}
{"_id":"q1a723be8","text":"Calculate the change in domestic income from 2017 to 2018."}
{"_id":"q1a72b172","text":"'What was the goodwill value for Digital in 2019?'"}
{"_id":"q1a71c960","text":"'What were the total royalties earned in 2019?'"}
{"_id":"q1a73a5fa","text":"Calculate the total number of exercisable shares excluded for the years 2018 and 2019 combined."}
{"_id":"q1a72cbbc","text":"Determine the income tax benefit from share-based compensation for the year 2019."}
{"_id":"q1a73bc8e","text":"Calculate the change in the valuation of mark-to-market interest rate swaps from 2018 to 2019."}
{"_id":"q1a7342ae","text":"Identify the key factors that contributed to the increase in operating expenses in 2019."}
{"_id":"q1a74093c","text":"Calculate the average of long-term debt, excluding current maturities."}
{"_id":"q1a73f744","text":"Calculate the change in the number of projects in process from 2018 to 2019."}
{"_id":"q1a71e602","text":"What are the components that make up data centre services revenue?"}
{"_id":"q1a7228ec","text":"What are the main components of research and development expenses?"}
{"_id":"q1a71598a","text":"Retrieve the total stock-based compensation expense for the year 2018."}
{"_id":"q1a7178d4","text":"List the software services available in 2019."}
{"_id":"q1a719be8","text":"Please provide the content of the note so I can help identify its topic."}
{"_id":"q1a7279e6","text":"'What was the constant currency revenue for the year 2019?'"}
{"_id":"q1a72d8fa","text":"Calculate the percentage change in net loan receivables from 2018 to 2019."}
{"_id":"q1a72be42","text":"Calculate the increase in sales and marketing expenses from 2017 to 2018."}
{"_id":"q1a71f70a","text":"'Compare the amount of interest received in each year to identify the year with the largest amount.'"}
{"_id":"q1a72702c","text":"Calculate the difference between total operating lease obligations and total purchase obligations."}
{"_id":"q1a740892","text":"What are the requirements for a company to repurchase its capital stock?"}
{"_id":"q1a725cb8","text":"Calculate the change in revenue for FinTech and Business Services between Q4 2018 and Q4 2019."}
{"_id":"q1a73295e","text":"'Calculate the total cash dividends paid in 2019.'"}
{"_id":"q1a73cbca","text":"What is the duration of the warranty period for repair or replacement of defective products after purchase?"}
{"_id":"q1a7233aa","text":"Calculate the change in total inventories from 2018 to 2019, specifying whether it is an increase or decrease."}
{"_id":"q1a723e18","text":"'What was the decrease in cash flow from investing activities in 2019?'"}
{"_id":"q1a73e2c2","text":"Retrieve the segment operating income for Blizzard Entertainment in 2019."}
{"_id":"q1a72a056","text":"Calculate the total number of subscribers for Television and Local residential telephone services in 2019."}
{"_id":"q1a72db8e","text":"Calculate the percentage of furniture and equipment relative to the total assets for the year 2019."}
{"_id":"q1a73b3ce","text":"Calculate the percentage change in the number of shares forfeited from 2018 to 2019."}
{"_id":"q1a723b34","text":"'List the years for which the table provides data on Income before income taxes.'"}
{"_id":"q1a7176ea","text":"Calculate the percentage of total revenue decrease attributed to the loss in Zyla (Oxaydo)."}
{"_id":"q1a741ac6","text":"'Calculate the inventory amount using the FIFO method instead of the LIFO method for the specified period.'"}
{"_id":"q1a7258bc","text":"Identify the financial reporting standards used for the preparation of this document."}
{"_id":"q1a722496","text":"'Calculate the total amount of operating leases that are due within the next 3 years.'"}
{"_id":"q1a739ace","text":"Calculate the difference between Loan Receivables and Financed Service Contracts totals."}
{"_id":"q1a737698","text":"'What date was the dividend declared in 2019?'"}
{"_id":"q1a713bd0","text":"Calculate the percentage change in acquisition-related costs from 2018 to 2019."}
{"_id":"q1a726cda","text":"Calculate the percentage change in the total gross carrying amount of intangible assets between 2018 and 2019."}
{"_id":"q1a729f98","text":"Identify the top products that are attracting customers due to their innovative features and programming advancements."}
{"_id":"q1a717b0e","text":"Determine the principal amount of the loan for acquiring an excavator in November 2016."}
{"_id":"q1a73eaec","text":"'What were the total amounts of dividend income and interest income in 2019?'"}
{"_id":"q1a73b734","text":"'What was the total amount of credit facilities available in 2019?'"}
{"_id":"q1a72b956","text":"Retrieve the Carrying Value of Kenya's debt in 2019, expressed in the local currency."}
{"_id":"q1a72e32c","text":"'What was the total amount of stock options granted in the fiscal year 2017?'"}
{"_id":"q1a739f60","text":"'What was the total revenue generated in North America in 2019?'"}
{"_id":"q1a71e6e8","text":"Calculate the total revenue and total other income for FY19 and provide their sum."}
{"_id":"q1a736e6e","text":"'What were the early debt redemption costs for 2019?'"}
{"_id":"q1a73483a","text":"Calculate the change in average general administrative expenses from 2017-2018 to 2018-2019."}
{"_id":"q1a71d964","text":"Retrieve the total expenses for long-term remuneration components in fiscal year 2019."}
{"_id":"q1a71a674","text":"'Determine the number of years when Accounts Receivable was greater than $50 million.'"}
{"_id":"q1a7121d6","text":"List the different types of earnings and losses per share shown in the table."}
{"_id":"q1a713edc","text":"Calculate the average Net Loss for the years 2018 and 2019 as of December 31."}
{"_id":"q1a7124ba","text":"Calculate the balance change from January 1, 2017, to January 1, 2018."}
{"_id":"q1a72ad30","text":"Calculate the change in the Rest of World data from 2018 to 2019."}
{"_id":"q1a73ef60","text":"'Provide the fair value of performance-based stock awards that vested in fiscal years 2019, 2018, and 2017, respectively.'"}
{"_id":"q1a71fb60","text":"What was the total unearned revenue for the year 2019?"}
{"_id":"q1a734f74","text":"'What was the risk-free interest rate for the year 2019?'"}
{"_id":"q1a72d3b4","text":"Calculate the percentage change in dividend shares awarded from 2018 to 2019."}
{"_id":"q1a7284ea","text":"Calculate the percentage change in the value of raw materials from 2018 to 2019."}
{"_id":"q1a73be82","text":"What factors determine the realization of net deferred tax assets?"}
{"_id":"q1a716c22","text":"Identify the year when the provision for income taxes was negative."}
{"_id":"q1a73ed44","text":"'What was the pro forma revenue for the year 2019?'"}
{"_id":"q1a712258","text":"Calculate the percentage change in the weighted average number of shares outstanding, including the dilutive effect of share options, from 2018 to 2019."}
{"_id":"q1a735faa","text":"Retrieve the total operating expenses of the company for the year 2019."}
{"_id":"q1a729fd4","text":"Calculate the percentage change in BCE's retail wireless subscribers."}
{"_id":"q1a741094","text":"Retrieve the incentive compensation amounts for Richard, Robert, and Bruce Leeds individually."}
{"_id":"q1a7388d6","text":"What was the net amount of long-term accounts receivable, after accounting for doubtful accounts, as of June 30, 2018?"}
{"_id":"q1a717410","text":"'Count the number of years when total assets were greater than $2,000,000 thousand.'"}
{"_id":"q1a72c324","text":"Calculate the percentage change in the carrying value of the Note payable."}
{"_id":"q1a737cce","text":"Identify the largest customer for each year: 2019, 2018, and 2017."}
{"_id":"q1a7154d0","text":"What were the reasons for the reduction in property and equipment in 2018 and 2019?"}
{"_id":"q1a7347e0","text":"Calculate the average general and administrative expenses for the years 2018 and 2019."}
{"_id":"q1a71837e","text":"Calculate the percentage of Bell Wireline's capital expenditures relative to BCE's total capital expenditures in 2019."}
{"_id":"q1a722144","text":"Identify the factors that led to the increase in research and development expenses."}
{"_id":"q1a71656a","text":"Identify the categories of past due receivables that are not classified as impaired."}
{"_id":"q1a724b4c","text":"'Compare the deferred income figures for each year to identify which year had a larger amount.'"}
{"_id":"q1a713e28","text":"What was the amount of restricted stock awards excluded from the diluted earnings per share calculation for the fiscal year 2019?"}
{"_id":"q1a73df8e","text":"'Retrieve the Gross Profit figures for the years 2019, 2018, and 2017, respectively.'"}
{"_id":"q1a72b5aa","text":"'What was the amount of cash used to settle obligations in 2017?'"}
{"_id":"q1a72af9c","text":"'Determine the number of years when servicing liabilities were greater than $3,000 thousand.'"}
{"_id":"q1a726a28","text":"'Identify the factors contributing to the increase in total revenue.'"}
{"_id":"q1a7393a8","text":"'Identify the year when non-current assets in the Asia Pacific region were at their highest.'"}
{"_id":"q1a72cc16","text":"Calculate the total unrecognized compensation cost for non-vested RSAs and PSAs in 2019."}
{"_id":"q1a713108","text":"'What was the gross profit for May 2019?'"}
{"_id":"q1a72070e","text":"Identify the years when share-based payments for the Share Incentive Plan (SIP) were recorded in financial statements."}
{"_id":"q1a714be8","text":"Retrieve the revenue figures for Europe for the years 2018 and 2019."}
{"_id":"q1a71b10a","text":"Identify the factors that contributed to the increase in Selling and Marketing expenses."}
{"_id":"q1a7163e4","text":"Calculate the percentage change in plan assets for Equity Securities from 2018 to 2019."}
{"_id":"q1a73d64c","text":"'Identify the date on which the number of shares issued reached its maximum value.'"}
{"_id":"q1a726a82","text":"Calculate the percentage of revenue from subscriptions and returns relative to the total revenue in 2018. What is that percentage?"}
{"_id":"q1a723ef4","text":"Calculate the net change in cash and cash equivalents from discontinued operations for 2018 and 2019, and determine the increase or decrease between the two years."}
{"_id":"q1a72e0f2","text":"'What was Canada's revenue in 2017?'"}
{"_id":"q1a725010","text":"Calculate the average number of convertible senior notes issued from 2017 to 2019."}
{"_id":"q1a71d504","text":"'Calculate the change in minimum pension liability balance from 2017 to 2018.'"}
{"_id":"q1a7325da","text":"Identify the main countries that the United States exports goods to."}
{"_id":"q1a723382","text":"Calculate the change in Other finished goods and merchandise from 2018 to 2019, specifying whether it is an increase or decrease."}
{"_id":"q1a7351c2","text":"'What were the proceeds from share issuances in 2017?'"}
{"_id":"q1a7336d8","text":"'Explain the significance of the company's investment commitments and what they represent.'"}
{"_id":"q1a719c4c","text":"What components are included in the \"financing cash flows\" line item in financial statements?"}
{"_id":"q1a725290","text":"What are the associated costs related to share-based compensation expense for 2018, including any additional costs?"}
{"_id":"q1a7140ee","text":"Explain the significance of the share of net earnings in other affiliates."}
{"_id":"q1a7186da","text":"Calculate the percentage change in net recognized amounts of identifiable assets acquired and liabilities assumed from 2018 to 2019."}
{"_id":"q1a73030c","text":"Calculate the percentage of the gross carrying value of other intangible assets relative to the total gross carrying value."}
{"_id":"q1a741148","text":"Calculate the total percentage of net sales allocated to Barry Litwin and Thomas Clark under the 2019 Plan."}
{"_id":"q1a722dd8","text":"Identify the significant expense items that The Group reported as impacting financial performance for the year."}
{"_id":"q1a711eac","text":"Identify the factors that led to the decrease in capital expenditure for the cable industry in 2019."}
{"_id":"q1a73c698","text":"Identify the factors that influenced the change in product revenues for the year 2019."}
{"_id":"q1a72db02","text":"'What was the depreciation expense for the fiscal year 2017?'"}
{"_id":"q1a721a28","text":"Retrieve the revenue figures for Access & Aggregation services provided by Network Solutions."}
{"_id":"q1a73b342","text":"'Retrieve the number of outstanding shares at the beginning of 2019.'"}
{"_id":"q1a7251fa","text":"Please provide a detailed description of the data in the table for analysis and interpretation."}
{"_id":"q1a71fe1c","text":"Calculate the change in diluted net income per weighted-average share for VMware, Inc. common stockholders (Classes A and B) from Q2 to Q3 of 2020."}
{"_id":"q1a739ce0","text":"What are the objectives and goals outlined in the company's policy?"}
{"_id":"q1a717686","text":"Calculate the decrease in licensing revenue for Zyla (Oxaydo) between 2018 and 2019."}
{"_id":"q1a73ff14","text":"Calculate the nominal difference in Sales between F19 and F18."}
{"_id":"q1a713752","text":"What do capital purchase obligations represent in financial terms?"}
{"_id":"q1a726c80","text":"'Provide the accumulated amortization amounts for the fiscal years 2018 and 2019.'"}
{"_id":"q1a73730a","text":"'Evaluate the current financial position of the group and provide a summary of its status.'"}
{"_id":"q1a71e0b2","text":"'What is the amount of cash attributed to intercompany balances related to the Inotera Acquisition?'"}
{"_id":"q1a732990","text":"Explain what dividends are and how they function in the context of investments."}
{"_id":"q1a726532","text":"Calculate the total income for 2017 and 2018, then find the difference between the two years."}
{"_id":"q1a719044","text":"Calculate the combined provision for income taxes for China and Mexico in 2019."}
{"_id":"q1a7196e8","text":"Calculate the percentage change in the impairment of investment for Golar Partners."}
{"_id":"q1a7383b8","text":"'List the voyage expenses for 2018 and 2019 separately.'"}
{"_id":"q1a726ffa","text":"Calculate the difference between total debt obligations and purchase obligations."}
{"_id":"q1a71dbda","text":"'What was the change in total revenue for 2019 compared to 2018?'"}
{"_id":"q1a7272ac","text":"Identify the three levels displayed in the provided table."}
{"_id":"q1a736964","text":"Calculate the change in Other assets from 2018 to 2019."}
{"_id":"q1a723bb6","text":"'Determine the number of years when foreign income was greater than $5,000 thousand.'"}
{"_id":"q1a72f04c","text":"Calculate the change in net income (loss) from 2018 to 2019."}
{"_id":"q1a7193d2","text":"Calculate the average number of PSAs granted from 2017 to 2019."}
{"_id":"q1a712dde","text":"What is the base salary of Gregory S. Clark?"}
{"_id":"q1a719f44","text":"'Identify the year with the highest dividend paid per ordinary share in euros.'"}
{"_id":"q1a736bd0","text":"What are the projected operating fiscal gains for the company in fiscal years 2020 and 2021, and what are the forecasts for subsequent years based on the timing of recognition of the hedged items?"}
{"_id":"q1a72c982","text":"Retrieve the net cash flow from operating activities for the year 2019."}
{"_id":"q1a73bf36","text":"Calculate the percentage change in the net operating loss carry forward between 2018 and 2019."}
{"_id":"q1a73fc58","text":"Calculate the average annual salary for NEO employees in fiscal year 2019 (FY19)."}
{"_id":"q1a732bde","text":"Identify the factors that led to the increase in prepaid expenses."}
{"_id":"q1a7260f0","text":"What was the total key management compensation for the year 2019?"}
{"_id":"q1a73670c","text":"Calculate the revenue change from 2018 to 2019. What is the difference in revenue for those years?"}
{"_id":"q1a7339ee","text":"'Count the number of geographical segments where external revenue exceeds $1 billion.'"}
{"_id":"q1a7133ec","text":"Calculate the percentage change in the ending balance from 2017 to 2018."}
{"_id":"q1a712a50","text":"'What is the level 1 FVPL amount as of December 31, 2019?'"}
{"_id":"q1a71f44e","text":"Calculate the increase in the Medical segment's loss from operations in fiscal 2018 compared to fiscal 2017."}
{"_id":"q1a73c9e0","text":"Calculate the average annual total compensation for the Board of Directors for the fiscal years ending June 30, 2017, 2018, and 2019."}
{"_id":"q1a7180c2","text":"Calculate the percentage change in on-net customer connections from 2017 to 2018."}
{"_id":"q1a724b1a","text":"List the different types of deferred income as presented in the table."}
{"_id":"q1a7314dc","text":"Calculate the average percentage of net revenues for the years 2018 and 2019."}
{"_id":"q1a724656","text":"Determine the remaining weighted-average useful life of acquired intangible assets."}
{"_id":"q1a728e04","text":"Calculate the percentage change in the price of gold from 2018 to 2019."}
{"_id":"q1a728d14","text":"What factors influence the cost of sales and gross margin?"}
{"_id":"q1a727d1a","text":"Calculate the change in Products and Licensing revenue from December 31, 2018, to December 31, 2019."}
{"_id":"q1a73acbc","text":"Calculate the percentage change in total inventories from 2018 to 2019."}
{"_id":"q1a73055a","text":"'What was the depreciation expense for the year 2017?'"}
{"_id":"q1a72d864","text":"'What was the total volume of channel partner financing in fiscal year 2019?'"}
{"_id":"q1a73e8da","text":"'What were the other expenses or income figures for 2017?'"}
{"_id":"q1a7288be","text":"Calculate the change in wireless revenue between 2017 and 2018, specifying whether it is an increase or decrease."}
{"_id":"q1a71ad72","text":"'What was the total amount of equity raised by the Group in 2018?'"}
{"_id":"q1a7301c2","text":"'What is the gross carrying value of computer software as of the latest available data?'"}
{"_id":"q1a71b862","text":"List the potential uses of cash reserves in a business or personal finance context."}
{"_id":"q1a71e666","text":"'What was the total revenue for the fiscal year 2019 (FY19)?'"}
{"_id":"q1a72f290","text":"Identify the components that constitute Total Restructuring Reserves as listed in the table."}
{"_id":"q1a73aa78","text":"Calculate the total share-based compensation expense for 2018 and 2019, then find the difference between the two years."}
{"_id":"q1a71f41c","text":"'Retrieve the net sales figures for the year 2018.'"}
{"_id":"q1a73a2a8","text":"'Calculate the total reimbursements for Mr. Post's annual physical examination costs and related travel expenses.'"}
{"_id":"q1a737f62","text":"List the components of accrued expenses and other payables in financial statements."}
{"_id":"q1a72647e","text":"Retrieve the total income of the United States for the year 2019."}
{"_id":"q1a712712","text":"What are the specific plans included in the remuneration measure?"}
{"_id":"q1a72d2ce","text":"Calculate the weighted average market value per ordinary share for DABP options exercised in 2019."}
{"_id":"q1a733728","text":"Calculate the percentage of purchase obligations relative to total contractual obligations for the year 2020."}
{"_id":"q1a740e00","text":"'What was the pension settlement charge recognized in 2019?'"}
{"_id":"q1a73af6e","text":"What percentage do provisions represent of the total deferred tax assets?"}
{"_id":"q1a723666","text":"What are the different non-GAAP measures and their purposes?"}
{"_id":"q1a73268e","text":"Calculate the percentage change in international sales between 2017 and 2018."}
{"_id":"q1a73641e","text":"Retrieve the value of the company's marketable securities as of December 31, 2019."}
{"_id":"q1a733fb6","text":"Rewritten Query: 'Explain the sales transactions of Inotera's DRAM products to Micron up to December 2016, including details from the provided table.'"}
{"_id":"q1a72597a","text":"'Calculate the percentage change in the group share of associates' profits due to tax impact in 2018.'"}
{"_id":"q1a730bae","text":"Calculate the percentage change in the company's net owned property and equipment from September 2018 to September 2019."}
{"_id":"q1a732e9a","text":"'Determine the number of stock options used to calculate the Weighted-Average Exercise Price of Outstanding Options, Warrants, and Rights.'"}
{"_id":"q1a721000","text":"What is the core beginning balance as of June 30, 2019?"}
{"_id":"q1a72240a","text":"Calculate the total long-term debt that is due for payment."}
{"_id":"q1a711c36","text":"Calculate the difference in Restructuring costs and other reserves between fiscal years 2019 and 2018."}
{"_id":"q1a73d3ea","text":"Calculate the change in the number of customers from the USA between 2018 and 2019, specifying whether it is an increase or decrease."}
