{"_id":"q82d4c6ec","title":"","text":"Fourth Quarter, 2012, sum, financial analysis, revenue, earnings, profit, loss, companies, financial performance"}
{"_id":"q855a35a0","title":"","text":"Interest income, Provision for credit losses, financial analysis, income statement, credit risk, financial institutions, earnings report, loan portfolio, risk management, fiscal year 2023."}
{"_id":"q85384530","title":"","text":"Total Forward Hedged Revenues, 2019, 2020, million, growth rate"}
{"_id":"q842c8af2","title":"","text":"purchase ratio, December 2012, January 2013"}
{"_id":"q85451756","title":"","text":"segment, total amount, 2015"}
{"_id":"q85737826","title":"","text":"Customer deposits, 50%, total value, financial analysis, liquidity, banking sector, deposit ratios, financial periods, trend analysis."}
{"_id":"q827742c4","title":"","text":"Credit Card, Amount, Average, 2012"}
{"_id":"q81e448f2","title":"","text":"severance, benefits, expense, decrease, 2015, 2016"}
{"_id":"q82305cc4","title":"","text":"iShares ETFs, Non-ETF index, 2016, equity, total amount, active"}
{"_id":"q81a100a6","title":"","text":"Terrestar, acquisition, cash purchase price, millions, closing"}
{"_id":"q847a1ac4","title":"","text":"interest paid, percent change, 2016, 2017"}
{"_id":"q82bb179c","title":"","text":"Pilgrim Nuclear Power Station, after its last refueling in 2019, was permanently closed in 2020. Therefore, it took approximately 1 year to close the plant after its last refueling. \n\nKeywords: Pilgrim Nuclear Power Station, 2019, 2020, refueling, closure."}
{"_id":"q82787914","title":"","text":"Credit loss impairments, Years Ended December 31, financial reporting, total amount, ranking, financial analysis."}
{"_id":"q847c4394","title":"","text":"DP&L, preferred stock, maximum premium, December 31, 2015"}
{"_id":"q85306054","title":"","text":"share repurchase, 2014, 2015, ratio, financial analysis, stock buyback, corporate finance"}
{"_id":"q81b147b8","title":"","text":"Options For Shares, Granted, 100, financial analysis, equity compensation, stock options, valuation, performance metrics, employee stock options, incentive plans"}
{"_id":"q81a86062","title":"","text":"Carrying amount, Total, 2009"}
{"_id":"q852ed734","title":"","text":"balance increase, percentage, 2016, 2017, financial analysis"}
{"_id":"q81097aec","title":"","text":"containerboards, net sales, industrial packaging, 2005"}
{"_id":"q8232eeda","title":"","text":"total debt maturity, 2018, percentage, financial analysis, debt management, corporate finance"}
{"_id":"q82c368f2","title":"","text":"total impairment, US assets, financial reporting, asset valuation, impairment loss, accounting standards, financial analysis, company disclosures, fiscal year, market conditions"}
{"_id":"q83dfd0c2","title":"","text":"Software expenses, IT maintenance expenses, Customer deposits, Less Than 1 Year, Client claims, refunds, 2017, 2016"}
{"_id":"q84448792","title":"","text":"Net investment income, Total revenue, Required interest on net reserves, financial analysis, investment income, revenue streams, financial metrics, income calculation, investment performance."}
{"_id":"q8332f334","title":"","text":"Cost of sales, Year Ended December 31, 2016, Decreases in current period tax positions, Total Year Ended December 31, 2005, Balance at End of Period"}
{"_id":"q83905290","title":"","text":"interest expense, percentage change, 2015, 2016, financial analysis"}
{"_id":"q84a187b2","title":"","text":"average value, Europe, Middle East, Africa, Asia-Pacific, 2017"}
{"_id":"q833c8228","title":"","text":"Management fees, financial advice fees, Distribution fees, Net investment income, Premiums, 2013"}
{"_id":"q85c8bb88","title":"","text":"Commercial, TotalLoans, Equipment lease financing, increasing rate, lowest amount, year, finance"}
{"_id":"q8144794e","title":"","text":"Distribution fees, Net investment income, increasing rate, financial analysis, investment funds, 2023"}
{"_id":"q84abfc2e","title":"","text":"Netcomm Products, Notebooks, Mobile Devices, financial analysis, revenue, sales figures, millions, year comparison"}
{"_id":"q811aabe6","title":"","text":"Asset Management, Mortgage, loans receivable, allowance, 2006"}
{"_id":"q811d0d0a","title":"","text":"Net credit losses, Provision for benefits and claims, financial growth rate, fiscal year, financial analysis, credit risk, loss reserves, insurance claims, financial reporting, risk management."}
{"_id":"q82364166","title":"","text":"Product revenue, Service revenue, total revenue, financial analysis, revenue growth, fiscal year, earnings report, financial performance, revenue streams, company performance."}
{"_id":"q83c3dbba","title":"","text":"Long-term debt, growth rate, 2010, financial projection, debt analysis."}
{"_id":"q8258ff9e","title":"","text":"Home equity, Operating lease obligations, Total, 2011, million"}
{"_id":"q84360b04","title":"","text":"Granted, shares, thousands, year, financial analysis, stock options, equity compensation, company performance, market trends."}
{"_id":"q8397ee9c","title":"","text":"Cash and cash equivalents, financial analysis, liquidity, balance sheet, fiscal year, financial metrics, cash flow, investment, company performance, 2023."}
{"_id":"q818cb290","title":"","text":"Net written premiums, 2014, insurance, financial analysis, underwriting, premium revenue, insurance companies, risk management, actuarial data."}
{"_id":"q8203fe68","title":"","text":"share-based compensation expense, percentage change, 2012, 2013"}
{"_id":"q82f207b6","title":"","text":"equity securities, Level 1, U.S. defined benefit pension plans, 2011, total equity, investment allocation"}
{"_id":"q83e3e52c","title":"","text":"Fair Values, Total derivatives, hedging instruments, December 31, 100000 thousand, Assets, financial year"}
{"_id":"q82374f34","title":"","text":"Commercial, Commercial real estate, Gross Charge-offs, financial analysis, year comparison, data analysis, risk assessment, credit losses, financial metrics"}
{"_id":"q83e16b08","title":"","text":"shares purchase discount, 2015, 2016, 2017, millions"}
{"_id":"q830208be","title":"","text":"Corporate Benefit Funding, Auto & Home, International, Total operating revenues, average value, million"}
{"_id":"q83554574","title":"","text":"SquareFeet, Total Consolidated Portfolio, Ann. Rent Revenue, increasing rate, financial analysis, real estate, portfolio management, year, revenue growth."}
{"_id":"q848f1da2","title":"","text":"Citigroup, proceeds from sales of investments, proceeds from maturities of investments, proceeds from significant disposals, 2016, average value, million"}
{"_id":"q84494d40","title":"","text":"GAAP, Operating Income, financial metrics, accounting standards, revenue recognition, expense allocation, fiscal year, financial performance, profitability analysis."}
{"_id":"q83562c00","title":"","text":"Net interest income, banks, financial institutions, interest rates, loan portfolio, deposit rates, economic cycles, fiscal policy, monetary policy, 2023, Q1, Q2, Q3, Q4."}
{"_id":"q81cfaef6","title":"","text":"Premiums earned, December 31, 2015, insurance, financial performance, revenue, underwriting, actuarial analysis, risk management."}
{"_id":"q821eb91a","title":"","text":"S&P 500, 2006, percentual fluctuation, return, old peer group, financial performance, investment comparison."}
{"_id":"q83ee4b48","title":"","text":"Total segment, Total Incurred, 2016, increasing rate"}
{"_id":"q8284743a","title":"","text":"2014, million, sum, elements"}
{"_id":"q823ddc1e","title":"","text":"percent change, average shares outstanding, dilution, 2008"}
{"_id":"q8543ee4e","title":"","text":"Electric, Operating revenues, financial performance, fiscal year, revenue growth, 2023, 2022, 2021, financial analysis."}
{"_id":"q82d0e284","title":"","text":"Total revenues, Retirement Products, Corporate Benefit Funding, financial analysis, revenue sum, chart 4, million"}
{"_id":"q820e4ada","title":"","text":"electricity, average price, GWh, energy market, utility companies, demand, consumption, pricing trends, market analysis, 2023"}
{"_id":"q81661522","title":"","text":"Granted for shares, Outstanding, growth rate, financial analysis, stock options, equity compensation, company performance, year-on-year comparison."}
{"_id":"q81719e24","title":"","text":"Net credit losses, Gains on sales of real estate, 2009, 2006, million"}
{"_id":"q83fd9170","title":"","text":"Case reserves, 2008 Ceded, Balance, end of year, 2009, sum, financial analysis, insurance reserves, actuarial data"}
{"_id":"q83baea32","title":"","text":"Cash and cash equivalents, Unsettled fund receivables, percentage, total amount, 2011"}
{"_id":"q81d04c30","title":"","text":"Amplifiers, Radio frequency, Converters, growth rate, table 0, year, financial analysis"}
{"_id":"q84f2c618","title":"","text":"Second Quarter 2012, Six Months, positive, financial analysis, revenue, earnings, profit, company performance, quarterly results."}
{"_id":"q83c04efa","title":"","text":"Tier 1 capital, Risk-weighted, Basel III, Standardized Transitional, 2016, average value, million"}
{"_id":"q83cf55b2","title":"","text":"Total, Future cash inflows, 2003, 2002"}
{"_id":"q82384b82","title":"","text":"Value, 400, 1000, 2011, millions"}
{"_id":"q826ed10c","title":"","text":"Shares, positive, 2017"}
{"_id":"q8445e3ee","title":"","text":"Common equity tier 1 capital, Standardized Approach, growth rate, Basel III, capital requirements, financial institutions, regulatory framework, 2023."}
{"_id":"q815dd65a","title":"","text":"Commercial Utilized Loans, Leases, Positive, Year, Financial Analysis, Lending, Credit, Financial Institutions, Economic Indicators"}
{"_id":"q817a53d4","title":"","text":"Office Net Charge-offs, increasing rate, table 3, financial analysis, fiscal year, charge-off percentage, credit risk, loan performance, financial metrics."}
{"_id":"q8302f030","title":"","text":"Segment net sales, growth rate, 2012"}
{"_id":"q83ecfa72","title":"","text":"BALANCE, JANUARY 1, 2007, BALANCE, DECEMBER 31, 2007, negative value, financial year, million"}
{"_id":"q83542c84","title":"","text":"Town Grove, LLC, Avalon Del Rey, LLC, CVP I, LLC, Town Run Associates, 2007, total amount"}
{"_id":"q839b24cc","title":"","text":"Goodwill, intangible assets, growth rate, 2017, 2018, financial analysis, valuation, net assets."}
{"_id":"q83880a04","title":"","text":"research and development, total, December 31, 2017, 2015, millions"}
{"_id":"q82573bfa","title":"","text":"Case reserves, Ceded, 2008, 2009, insurance, reinsurance, financial analysis, reserve management"}
{"_id":"q83206f84","title":"","text":"Assumed, Total assets, growth rate, 2014, 2015, million"}
{"_id":"q84fb6e6c","title":"","text":"Total commercial lending, commercial loans, financial institutions, lending growth, 2023, 2022, 2021, 2020, 2019, economic impact, interest rates, credit risk, loan portfolio, banking sector."}
{"_id":"q826da55c","title":"","text":"Europe, Asia-Pacific, increasing rate, financial analysis, year comparison, regional growth, economic data."}
{"_id":"q853b5e6e","title":"","text":"Total Forward Hedged Revenues, 2019, growth rate"}
{"_id":"q82dca556","title":"","text":"Entergy, net revenue, growth rate, wholesale commodities, 2013"}
{"_id":"q84e55370","title":"","text":"Total operating revenues, 2011, increasing rate"}
{"_id":"q8198bd92","title":"","text":"Net income, Fourth Quarter, 2016, growth rate"}
{"_id":"q8518ff4a","title":"","text":"refined products, trunk lines, production, tbd, three year period"}
{"_id":"q82be72ac","title":"","text":"Capital lease obligations, payments due by period, financial analysis, lease liabilities, amortization schedule, present value, interest expense, lease term, financial reporting, accounting standards, ASC 842, IFRS 16."}
{"_id":"q85724ac8","title":"","text":"Global equity, equity-related, Global long-term debt, Market Share, financial analysis, investment, capital markets, equity markets, debt instruments, financial metrics."}
{"_id":"q8556c10e","title":"","text":"fuel surcharge program, freight revenue, percentage change, 2013, 2014"}
{"_id":"q82581dc2","title":"","text":"average amount, 2019 Notes, 2013, Granted, Number of shares"}
{"_id":"q81bc4a1e","title":"","text":"Pension plans, Benefits earned, 2010, million"}
{"_id":"q81520e92","title":"","text":"Con Edison, CHANGE IN PROJECTED BENEFIT OBLIGATION, 2014, 2013, total amount, financial analysis"}
{"_id":"q858b5c20","title":"","text":"Net investment income, revenues, table 1, financial analysis, investment income, fiscal year, financial metrics."}
{"_id":"q81cb3060","title":"","text":"Projected benefit obligation, Con Edison, largest value, financial analysis, pension obligations, actuarial assumptions, year-end reporting, 2023."}
{"_id":"q84dd9f7c","title":"","text":"Reserve for unearned premiums, 2014, Weighted Average Exercise Price, financial metrics, insurance companies, actuarial analysis, premium reserves, financial reporting."}
{"_id":"q84e682ea","title":"","text":"adjusted total assets, 2018, increasing rate, dollars, millions"}
{"_id":"q81566442","title":"","text":"Expenses, 2008, Amount, thousand"}
{"_id":"q838b6d0c","title":"","text":"environmental-related reserves, environmental-related asset retirement obligations, December 31, 2015, percent"}
{"_id":"q834fefca","title":"","text":"Regulated natural gas, Nonregulated electric, increasing rate, 2023, energy sector, market analysis."}
{"_id":"q842fefc6","title":"","text":"Planned generation, TWh, 2005, 2006, energy production, growth rate, electricity generation, year-on-year comparison."}
{"_id":"q8300ab0e","title":"","text":"U.S. Treasuries, Fixed Income Securities, interest rates, yield curve, government bonds, Treasury bills, Treasury notes, Treasury bonds, credit risk, investment grade, inflation, Federal Reserve, market liquidity, duration, maturity dates."}
{"_id":"q81392cb0","title":"","text":"Net investment income, Other income, positive, financial analysis, income statement, revenue, investment returns, fiscal year, financial metrics."}
{"_id":"q853e847c","title":"","text":"Total net revenue, Reported Results, Fully taxable-equivalent adjustment, Managed basis, average value, million"}
{"_id":"q859daefc","title":"","text":"Estimated Fair Value, Other, 2023, financial analysis, valuation, market trends, investment, asset management."}
{"_id":"q836cd57c","title":"","text":"segment, 2015, highest value"}
{"_id":"q810fb0f6","title":"","text":"Allowance, 270, 2018, million"}
{"_id":"q82b28b22","title":"","text":"Sales Commissions, Occupancy, Equipment, increasing rate, financial analysis, year, metrics, performance indicators"}
{"_id":"q8384b3ea","title":"","text":"Group retirement products, Net Investment Income, Cash at end of year 2011, Cash at end of year 2010."}
{"_id":"q81d7599e","title":"","text":"US SBU, average, 2014, 2013, 2012, million"}
{"_id":"q853c2a92","title":"","text":"Income (loss) before income taxes, minority interest, As Reported, 2006, Sales, 2003"}
{"_id":"q81d3a056","title":"","text":"Americas, growth rate, 2004, 2005, million"}
{"_id":"q849d08a4","title":"","text":"Premiums, growth rate, 2012, million"}
{"_id":"q811c3614","title":"","text":"allowance for loan losses, percentage change, 2008, 2009"}
{"_id":"q82c9a85c","title":"","text":"stock-based performance units, fair value, decrease, 2016, 2018"}
{"_id":"q83bc7cbc","title":"","text":"March 31, 2008, Operating revenues, Operating income, financial analysis, revenue recognition, income statement, financial metrics"}
{"_id":"q8175db10","title":"","text":"percent change, average CDS, excluded, 2013, 2014"}
{"_id":"q82c2627c","title":"","text":"Subtotal analog signal processing, 500000, 2014"}
{"_id":"q82efcc80","title":"","text":"Reinsurance assets, Cash provided by operating activities, 2018, 2014"}
{"_id":"q82864972","title":"","text":"Total calendar year effect, financial analysis, investment performance, market trends, fiscal year, economic indicators, portfolio management, asset allocation, risk assessment, financial forecasting."}
{"_id":"q82b4cc20","title":"","text":"rent expenses, operating leases, percentage change, 2010, 2009"}
{"_id":"q84ceb836","title":"","text":"Other borrowings, Carrying Value, financial analysis, year comparison, debt instruments, financial reporting, balance sheet, interest rates, liquidity, capital structure."}
{"_id":"q82871b7c","title":"","text":"free cash flow, percentage change, 2014, 2015"}
{"_id":"q847a93dc","title":"","text":"profit before taxes, 2017, U.S. tax reform, Gain on sale of equity investment, million"}
{"_id":"q83e70dd8","title":"","text":"Share repurchase program, October 2013, average, exceed, companies, stock buyback, financial analysis, market trends."}
{"_id":"q856d40e6","title":"","text":"Product revenues, net, financial performance, revenue analysis, fiscal year, quarterly earnings, revenue growth, company performance, financial metrics."}
{"_id":"q81da9686","title":"","text":"Sales, Fair Value, increasing rate, percentage, financial analysis, valuation, market trends"}
{"_id":"q81f778aa","title":"","text":"Metropolitan, current assets, financial analysis, balance sheet, liquidity, assets valuation, fiscal year, financial reporting."}
{"_id":"q82e4317c","title":"","text":"Total, discounted future net cash flows, proved oil and gas reserves, standardized measure, 2023."}
{"_id":"q845eabea","title":"","text":"Fixed income, Active, 2016, 2017, million"}
{"_id":"q836b9360","title":"","text":"Granted Shares, Net Reserves, Table 3, Table 4, increasing rate, financial analysis, year, data comparison"}
{"_id":"q815893ca","title":"","text":"foreign currency forward contracts, percentage change, fair value, 2008, 2009"}
{"_id":"q8290c910","title":"","text":"ratio, value, range, 400, 1000, sum, 2011"}
{"_id":"q8435886e","title":"","text":"dilutive effect, 2006, 2008, percentage change"}
{"_id":"q837b54d0","title":"","text":"Net sales, 2014, Notes Payable, 2008, Carrying Amounts"}
{"_id":"q8580ff64","title":"","text":"Service cost, Pension Benefits, financial analysis, actuarial valuation, 2023, 2022, 2021, company pension plans, employee benefits, retirement plans."}
{"_id":"q81dc665a","title":"","text":"China, growth rate, 2013, 2014, GDP, million"}
{"_id":"q83d4ede2","title":"","text":"Fair Value, Aaa, Fair Value, Aa, growing rate, financial analysis, credit ratings, investment grade, market trends, valuation, financial metrics, year-over-year growth."}
{"_id":"q83e4d1ee","title":"","text":"derivatives, balance, 2009, increasing rate, dollars, millions"}
{"_id":"q8159e19e","title":"","text":"Residential mortgage, Recoveries, loans, leases, charged off, 2023"}
{"_id":"q821d9148","title":"","text":"Alpine Country, Alpine Village"}
{"_id":"q8247de8a","title":"","text":"Benefit obligation, Pension Benefits, year end, financial analysis, actuarial assumptions, discount rate, funding status, pension plan, liabilities, 2023, 2022, 2021, company financials."}
{"_id":"q852a4c64","title":"","text":"Fixed maturities, Foreign government bonds, Amortized Cost, Corporate securities, average value, financial analysis, investment portfolio, bond market, fiscal year, million."}
{"_id":"q84e8101a","title":"","text":"ABO, fair value, plan assets, Pension Benefits, growth rate, 2015"}
{"_id":"q81344b3c","title":"","text":"Loss expenses, Casualty, 2008, Gross, Case reserves, 2009, Gross"}
{"_id":"q85cc7e58","title":"","text":"Interruptible sales, Total firm sales, transportation, increasing rate, percentage, financial analysis, sales data, year comparison."}
{"_id":"q84e182f4","title":"","text":"Loews, ROI, investment, common stock, 2011, 2012"}
{"_id":"q83cdbf9a","title":"","text":"Construction, Commercial real estate, 2015, ratio"}
{"_id":"q83caeaea","title":"","text":"common shareholders, equity, percentage change, adjustments, Basel III, CET1, 2019"}
{"_id":"q843df09e","title":"","text":"Price\/mix-1, Volume – Units, financial analysis, revenue growth, sales performance, profitability metrics, data analysis, financial modeling."}
{"_id":"q81db3f50","title":"","text":"Gas utility operations, electric utility operations, total amount, financial analysis, utility sector, operational metrics, revenue comparison, fiscal year, performance evaluation."}
{"_id":"q82c4fd2a","title":"","text":"Fixed income markets, 2004, 2003, market value, bond market, interest rates, yield, investment grade, treasury bonds, corporate bonds."}
{"_id":"q828a58aa","title":"","text":"Total segment, Total Incurred, 2016, 2017, million"}
{"_id":"q837a4e78","title":"","text":"SVB Capital Partners II, LP, Private equity, venture capital, carrying value, December 31, positive, average, financial analysis, investment performance."}
{"_id":"q8441a2de","title":"","text":"Change, net of taxes, 2015, million, financial analysis, positive changes, tax impact"}
{"_id":"q84d56a96","title":"","text":"Cash and cash equivalents, marketable securities, inventories, total assets, 2014, financial analysis, balance sheet, liquidity, asset management."}
{"_id":"q85b3b076","title":"","text":"CET1 capital, Basel III, Tier 1 capital, financial regulation, capital adequacy, transitional period, banking sector, capital requirements, 18300 million"}
{"_id":"q817f6202","title":"","text":"Total calendar year effect, financial analysis, fiscal year, economic impact, market trends, investment performance, 2023, 2022, 2021, financial forecasting."}
{"_id":"q83c7a90c","title":"","text":"TRICARE, Commercial, increasing rate, subtotal, financial analysis, healthcare finance, 2023."}
{"_id":"q8241c7b6","title":"","text":"Qualifying Accounting Hedges-2, Gross Derivative Assets, 2010, percentage, financial analysis, derivatives, hedging, accounting standards."}
{"_id":"q81b8fb70","title":"","text":"Commercial paper, 2011, Amortized Cost, Net sales, 2011, Net sales, 2013"}
{"_id":"q8542325c","title":"","text":"Net earnings, As Reported, positive, financial performance, fiscal year, earnings report, profitability, income statement, financial analysis."}
{"_id":"q835b5ee6","title":"","text":"Interest cost, benefit obligation, U.S. pension plans, 2017, increasing rate, million"}
{"_id":"q81439f7e","title":"","text":"Professional services, growth rate, 2012, market trends, consulting firms, revenue projections, industry analysis, economic factors, service diversification, client demand, technology integration, competitive landscape."}
{"_id":"q838d6486","title":"","text":"Home equity, California, New York, total equity, real estate, mortgage, housing market, equity value, financial analysis, property value, market trends, 2023."}
{"_id":"q834d2524","title":"","text":"Greenline acquisition, aggregate consideration, sellers, 2009, 2008 earn-out target, percentage."}
{"_id":"q8277c280","title":"","text":"Operating lease obligations, Pension, postretirement cash requirements, table 1, increasing rate, financial analysis, obligations comparison."}
{"_id":"q828e37cc","title":"","text":"protect, carrying values, excess inventories, increase, 2002, 2003, percentage"}
{"_id":"q832dd8e0","title":"","text":"Pension plans, Benefits earned, increasing rate, 2023, retirement funds, actuarial assumptions, defined benefit plans, contributions, liabilities, funding status."}
{"_id":"q83576886","title":"","text":"Other, total amount, million, financial analysis, revenue streams, financial metrics"}
{"_id":"q85a20326","title":"","text":"stock-based compensation, expense, percentage increase, 2009, 2010"}
{"_id":"q83affb90","title":"","text":"Investment banking fees, 2004, Commissions and fees, Year Ended December 2014"}
{"_id":"q848cf432","title":"","text":"NCLC, senior unsecured notes, December 2016, due December 2021, payment, interest rate, principal amount."}
{"_id":"q8187d4c8","title":"","text":"Management fees, financial advice fees, Distribution fees, Net investment income, million, 2023"}
{"_id":"q837f5ea4","title":"","text":"Insurance, December 31, 2017, Case Reserves, December 31, 2016, Case Reserves, total amount"}
{"_id":"q82852614","title":"","text":"total value, amount, smaller than 100, 2008, million"}
{"_id":"q82bca3be","title":"","text":"New orders, 2013, 2012, million, financial analysis, year-over-year comparison"}
{"_id":"q8327a402","title":"","text":"Total assets, growth rate, 2014, financial projection"}
{"_id":"q84404592","title":"","text":"Passive for Equities, Active, Company stock\/ESOP, 2008, billion"}
{"_id":"q83b66782","title":"","text":"Net flows, Market appreciation, Growth rate, Financial analysis, Investment performance, Yearly comparison, Asset management, Portfolio growth, Capital inflows, Market trends."}
{"_id":"q851ab862","title":"","text":"Group Specialty, growth rate, 2011, 2012, million"}
{"_id":"q8376846e","title":"","text":"distribution fees, revenues, 2014, average, million"}
{"_id":"q836db4e2","title":"","text":"Average expected option life, Risk-free interest rate, financial metrics, options trading, investment analysis, market trends, financial modeling, interest rate environment, valuation techniques, derivatives market."}
{"_id":"q81e74066","title":"","text":"FirstQuarter, total amount, ranking, financial analysis"}
{"_id":"q82b17a0c","title":"","text":"Pension obligations, employee benefit obligations, AFDC, plant, conservation programs, contract valuation adjustments, 2006, total value, financial analysis."}
{"_id":"q85a157e6","title":"","text":"revenue, net investment gains, financial analysis, positive gains, fiscal year, earnings report, investment performance, financial metrics"}
{"_id":"q8319c9cc","title":"","text":"rent expense, percentage increase, 2013, 2014"}
{"_id":"q84d7866e","title":"","text":"Nigen, acquisition, implied value, 2000, financial analysis, valuation, market capitalization, transaction details."}
{"_id":"q849f8d68","title":"","text":"percentage change, R&D spending, 2013, 2014"}
{"_id":"q82afa40c","title":"","text":"Working capital, Total assets, increasing rate, financial analysis, liquidity, balance sheet, fiscal year, asset management, capital structure, financial ratios."}
{"_id":"q83dc33e0","title":"","text":"Bermuda, December 31, 2017, IBNR Reserves, December 31, 2016, IBNR Reserves, average, reserves"}
{"_id":"q80f34920","title":"","text":"Below Investment Grade, 2004, average, credit rating, financial analysis, investment grade, bond market, risk assessment."}
{"_id":"q85ce788e","title":"","text":"Writedowns, Fixed Maturity Securities, 2008, financial crisis, asset impairment, market value decline, investment losses, credit risk, bond market, securities valuation."}
{"_id":"q8160538a","title":"","text":"Unrecognized net loss, CECONY, 2015, Operating earnings, 2008, Funded status, Con Edison, 2014, Change in plan assets"}
{"_id":"q83b9f24e","title":"","text":"IPL, cumulative preferred stock, dividend rate, December 31, 2016, December 31, 2015"}
{"_id":"q8239f9dc","title":"","text":"Total commercial real estate, average value, financial analysis, commercial property, investment, market trends, real estate valuation, positive growth, economic indicators."}
{"_id":"q82da7740","title":"","text":"Net interest income, 2016, financial performance, interest rates, banks, earnings report, financial institutions."}
{"_id":"q85924a12","title":"","text":"repurchase claims, first quarter, 2005, 2006, 2007, 2008, millions"}
{"_id":"q855bb718","title":"","text":"aggregate notional amount, outstanding interest rate swaps, percentage change, 2011, 2012"}
{"_id":"q8130c3ea","title":"","text":"Net income, Operating activities, Total cash provided, 1760, financial analysis, cash flow, fiscal year, earnings, profitability."}
{"_id":"q82c08bfa","title":"","text":"Total expenses, Other income, million, financial analysis, fiscal year, revenue, profit and loss, income statement, financial metrics."}
{"_id":"q82834aba","title":"","text":"Other operations and maintenance, 2018, average, million"}
{"_id":"q82e700dc","title":"","text":"Network development services, Costs of operations, financial analysis, operational efficiency, year-on-year comparison, cost reduction strategies."}
{"_id":"q84aa0324","title":"","text":"Labor and related benefits, companies, financial analysis, 2023, employee compensation, payroll expenses, labor costs, economic trends."}
{"_id":"q81e2083a","title":"","text":"Gas, Operating revenues, resale, increasing rate, financial analysis, year, revenue growth"}
{"_id":"q830ab982","title":"","text":"Target date, FX impact, Operating leases, Principal, Total"}
{"_id":"q8555209c","title":"","text":"Concentra, total current assets, financial analysis, balance sheet, fiscal year 2023, liquidity, asset management."}
{"_id":"q8238d340","title":"","text":"Risk-free interest rate, Expected volatility, average value, financial analysis, investment, market conditions, economic indicators."}
{"_id":"q8309ecd2","title":"","text":"Proved Developed Reserves, U.S., 2013, Synthetic crude oil, mmbbl, Total proved developed reserves, mmboe."}
{"_id":"q82954f30","title":"","text":"Management fees, financial advice fees, Distribution fees, Net investment income, Premiums, 2012"}
{"_id":"q82614f00","title":"","text":"Distribution fees, GAAP, 2010, 2009, financial analysis, comparison, millions"}
{"_id":"q82def450","title":"","text":"private equity investments, estimated fair value, December 31, 2015, December 31, 2014, change, billions"}
{"_id":"q8112818c","title":"","text":"Cost of sales, Net sales, financial analysis, revenue, profit margin, fiscal year, financial metrics, earnings report."}
{"_id":"q81baf628","title":"","text":"advertising, total revenues, increasing rate, financial analysis, revenue growth, marketing expenditure, fiscal year, financial performance"}
{"_id":"q83818904","title":"","text":"Equity securities, growth rate, Policy loans, financial analysis, investment, insurance companies, 2023."}
{"_id":"q82ca7a16","title":"","text":"Cash provided by operating activities, 2013, Reserve for unearned premiums, 2017, Future policy benefits, life and accident and health insurance contracts, 2017"}
{"_id":"q835e1cda","title":"","text":"Noninterest income, 2015, Fourth Quarter, Net income, Change, Fiscal Year 2019, Total revenue, net of interest expense, 2016, Second Quarter"}
{"_id":"q82806e08","title":"","text":"Fee revenue, Total revenue, 13000000, financial analysis, revenue growth, fiscal year, financial metrics"}
{"_id":"q842f82de","title":"","text":"RevPAR, 2006, total revenue, hotel industry, occupancy rate, average daily rate, financial performance, revenue management."}
{"_id":"q831774ce","title":"","text":"Loans, net, Assets, Carrying Value, Total assets, December 31, average, positive"}
{"_id":"q846a7bb4","title":"","text":"Working capital, Monterra del Sol, RentableSquareFootage, 2012, average"}
{"_id":"q844c5b20","title":"","text":"Income from continuing operations, 2006, As Reported, million, financial analysis, earnings report, fiscal year, financial performance."}
{"_id":"q81a6aea2","title":"","text":"U.S. large cap stocks, U.S. small cap stocks, Non-U.S. large cap stocks, Non-U.S. small cap stocks, 2013, market capitalization, equity markets, investment funds, asset allocation."}
{"_id":"q8557bdf2","title":"","text":"Interest expense, total, 2008, ratio, percentage"}
{"_id":"q85cbaa32","title":"","text":"firm-sponsored QSPES, ASF framework loans, serviced, financial institutions, asset-backed securities, loan servicing, financial management"}
{"_id":"q852b7a62","title":"","text":"Entergy New Orleans, deferred tax liability, total amount, greater than 20, thousand"}
{"_id":"q81a04d64","title":"","text":"2012, Gross profit, Operating expenses, financial analysis, revenue, net income, EBITDA, cash flow, balance sheet, financial metrics"}
{"_id":"q8594e628","title":"","text":"income tax benefit, noncontrolling interests, non-cash impairment charges, 2009"}
{"_id":"q857834c4","title":"","text":"market share, MKTX, common stock, March 8, 2006"}
{"_id":"q8279f0a0","title":"","text":"Interest-earning deposits, banks, 2018, 2017, financial growth, deposits increase, banking sector."}
{"_id":"q8299c632","title":"","text":"Total stock-based compensation, 2400 thousand, Dec 31, financial year, compensation expense, equity awards, stock options, company performance, fiscal quarter."}
{"_id":"q82e4ee32","title":"","text":"Operating Expenses, Revenue, average, financial analysis, positive revenue, fiscal year, financial metrics"}
{"_id":"q81ad2480","title":"","text":"North America, 3-Year term loan, 2017, total amount, financial analysis"}
{"_id":"q817bbdbe","title":"","text":"fuel surcharge revenues, percentage change, 2011, 2012"}
{"_id":"q831be112","title":"","text":"Card Member loans, growth, total loans, financial analysis, credit, consumer debt, lending trends, year-over-year growth, financial institutions, 2023."}
{"_id":"q827f3af6","title":"","text":"Long-term debt, total contractual obligations, percentage, financial analysis, liabilities, balance sheet, debt ratio, financial metrics."}
{"_id":"q81f01e20","title":"","text":"Required interest, net reserves, positive, financial institutions, reserve requirements, central banks, monetary policy, interest rates, liquidity, capital adequacy, regulatory framework."}
{"_id":"q85a830f2","title":"","text":"Operating leases, 2018, 2019, 2021, average value, million"}
{"_id":"q81328eaa","title":"","text":"Case reserves, positive, Gross, financial analysis, insurance reserves, actuarial science, 2023."}
{"_id":"q83406528","title":"","text":"securities, security holders, future issuance, portion, approved, available"}
{"_id":"q81ffb65a","title":"","text":"Citi, home equity portfolio, December 31, 2015, fixed-rate home equity loans, percentage."}
{"_id":"q813a3eca","title":"","text":"CET1 capital, Tier 1 capital, Total capital, 2017, million"}
{"_id":"q81b7d362","title":"","text":"Fair value, plan assets, Non-U.S., financial year, valuation, investment performance, pension funds, actuarial assumptions, 2023, 2022, 2021."}
{"_id":"q84c48bea","title":"","text":"No surrender charge, Individual Variable Annuities, 2010, Net cash used in financing activities, 2009"}
{"_id":"q83e62fc6","title":"","text":"Silicon Systems Group, Energy and Environmental Solutions, average, financial analysis, positive performance, millions, fiscal years."}
{"_id":"q8496d89e","title":"","text":"Australia, growth rate, Mill, finance, economic indicators, market analysis, investment trends"}
{"_id":"q81fb02cc","title":"","text":"Total writedowns, Fixed Maturity Securities, financial analysis, investment firms, asset management, 2023, 2022, 2021, 2020, market trends."}
{"_id":"q81e13324","title":"","text":"other loans, average, 2012, 2011"}
{"_id":"q8135b094","title":"","text":"Pensions, Service cost, net periodic benefit cost, U.S. Plans, total, 2006"}
{"_id":"q81621f8a","title":"","text":"Estimated Fair Value, Communications, growth rate, 2023, financial analysis, valuation, market trends"}
{"_id":"q84e0b432","title":"","text":"Average Balances, Interest-bearing deposits, Growth rate, 2017, December 31"}
{"_id":"q846bd810","title":"","text":"Other operations and maintenance, average, 2018"}
{"_id":"q83064186","title":"","text":"DISCB, cumulative total shareholder return, five year period, December 31, 2018, percentage."}
{"_id":"q84f7717c","title":"","text":"Total assets, Assumed, 2014, growth rate"}
{"_id":"q83deb16a","title":"","text":"Bank deposits, growth rate, Collateral financing arrangements, financial institutions, liquidity, capital markets, risk management, collateralized loans, 2023."}
{"_id":"q81b48752","title":"","text":"Avalon Terrace, LLC, Town Run Associates, average, financial performance, LLC, positive years, analysis, financial metrics"}
{"_id":"q858f9b64","title":"","text":"Asset allocation, balanced, December 31, 2016, operating leases, thereafter"}
{"_id":"q85627260","title":"","text":"Total contractual obligations, proportion, elements greater than 5000, financial analysis, risk assessment, liability management."}
{"_id":"q81c6c3c2","title":"","text":"Case reserves, gross, positive, sum, financial analysis, reserves calculation, insurance, actuarial, financial reporting."}
{"_id":"q85b2aaf0","title":"","text":"Snap-on, share repurchase, 2011, 2010, ratio"}
{"_id":"q83630e34","title":"","text":"Planned net MW, operation, 2006, energy, capacity, power generation, renewable energy, investment, infrastructure, utility companies."}
{"_id":"q82a8646c","title":"","text":"Curtailments, Settlements, Special termination benefits, 2010, average, million"}
{"_id":"q830e4cb4","title":"","text":"Other borrowings, Carrying Value, Deposits, financial analysis, year comparison, financial metrics."}
{"_id":"q8137ea08","title":"","text":"Land and land development, Nonperforming Loans, Foreclosed Properties, total, 2011"}
{"_id":"q85601100","title":"","text":"Depreciation, amortization, growth rate, 2013, financial projections, accounting, cash flow, asset valuation."}
{"_id":"q852613f6","title":"","text":"Equity securities, Carrying Value, financial year, market valuation, investment portfolio, asset management, financial reporting, valuation methods, company performance, stock market trends."}
{"_id":"q8292c274","title":"","text":"Securities available for sale, Trading securities, Spot commodities, Trading assets, Carrying Value, 2006"}
{"_id":"q851e07e2","title":"","text":"Operating activities, Year Ended December 31, 2007, Employee separations, financial analysis, cash flow, operational efficiency."}
{"_id":"q82975596","title":"","text":"CAD, USD, currency exchange rate, outstanding credit facility, December 31, 2006"}
{"_id":"q85224fc8","title":"","text":"Qualifying Accounting Hedges-2, Gross Derivative Assets, 2010, financial analysis, hedge accounting, derivatives, risk management."}
{"_id":"q8185ca48","title":"","text":"Wheelabrator, Fuel for Amount, average, positive years"}
{"_id":"q84aff248","title":"","text":"Securities Commissions and Fees, Interest, Financial Service fees, September 30, 2008, total amount, thousand"}
{"_id":"q81ed1eb4","title":"","text":"adjusted profit, profit before taxes, financial analysis, profit margins, fiscal year, earnings report, profitability, financial metrics"}
{"_id":"q838615fa","title":"","text":"Attritional, Total Incurred, 2017, percentage"}
{"_id":"q8330ab74","title":"","text":"Equity securities, Other investments, Amount, million, financial analysis, investment portfolio"}
{"_id":"q84b195a8","title":"","text":"Interest expense, 2009, average, financial analysis, cost of debt, interest rates, corporate finance, financial metrics"}
{"_id":"q83701958","title":"","text":"Con Edison, Benefit obligation, beginning of year, least, year, financial analysis, pension obligations, actuarial assumptions."}
{"_id":"q82e0526e","title":"","text":"growth rate, operating profit, space systems, 2011"}
{"_id":"q844b4ad2","title":"","text":"Treasury Stock, December 31, 2007, Balance, million"}
{"_id":"q81dd8de6","title":"","text":"net reserves, growth rate, 2005"}
{"_id":"q8118067a","title":"","text":"government, education, increasing rate, fiscal policy, budget allocation, public spending, economic growth, investment in education, GDP, 2023"}
{"_id":"q85b65ca4","title":"","text":"decline ratio, provision for commercial lending, credit losses, consumer provision, 2012"}
{"_id":"q82d7d486","title":"","text":"Premiums, growth rate, Interest credited, bank deposits, financial year, 2023."}
{"_id":"q833741dc","title":"","text":"Service cost, Interest cost, Pension Benefits, increasing rate, financial analysis, actuarial assumptions, 2023."}
{"_id":"q82cf6648","title":"","text":"Exercise of stock options, Shares, 2006, 2005 rate, growth, thousand"}
{"_id":"q832f46d0","title":"","text":"Goodwill, Total Assets, December 31, 2016, Percentage, Financial Analysis"}
{"_id":"q84929b12","title":"","text":"shares outstanding, February 8, 2019"}
{"_id":"q83ae5cae","title":"","text":"Group Retirement Products, Individual Fixed Annuities, growth rate, 2023"}
{"_id":"q824005e8","title":"","text":"Distribution fees, 1000, 2000, 2011, million"}
{"_id":"q8141e512","title":"","text":"Case reserves, 2008, Net, Exercise of stock options, 2008"}
{"_id":"q8356d650","title":"","text":"Client deposits, Average Balance, Year Ended December 31, 2014, U.S., December 31, 2014"}
{"_id":"q83795414","title":"","text":"Product revenues, net, 2014, highest total amount, financial data, revenue analysis, company performance, fiscal year 2014."}
{"_id":"q83f7e374","title":"","text":"Total fixed rate debt, financial analysis, debt structure, interest rates, corporate finance, balance sheet, long-term liabilities, debt maturity, financial leverage, risk management."}
{"_id":"q853121e2","title":"","text":"Year Ended October 31, 2017, ratio, financial analysis, range 0-5, fiscal year, performance metrics"}
{"_id":"q85c4c69a","title":"","text":"balance, 2013, 2015, financial analysis, year-over-year change"}
{"_id":"q810dcafc","title":"","text":"Total revenues, Restricted stock awards, 2007, million"}
{"_id":"q859ca02a","title":"","text":"March 31, 2005, proportion, financial analysis, three months ended, greater than 6000, total amount, financial metrics."}
{"_id":"q838f1d1c","title":"","text":"Swaps, Interest Rate Contracts, Notional, 2005, 2006, growth rate, dollars, millions"}
{"_id":"q82715706","title":"","text":"Square Feet-1, Apartment Units, total amount, excluding, greater than 100000"}
{"_id":"q820916b4","title":"","text":"Intangible amortization expense, Intangible assets, 17 million, financial reporting, accounting standards, amortization, fiscal year, expense recognition, financial analysis."}
{"_id":"q831f9cee","title":"","text":"net income, consolidation, 2010, financial analysis, total value, range, millions"}
{"_id":"q82561284","title":"","text":"derivative contracts, average contract life, annual exposure, US$ billion, December 31, 2005, derivative receivables"}
{"_id":"q851b989a","title":"","text":"Interest expense, affiliates, expenses, support services, 600 million"}
{"_id":"q859f47e4","title":"","text":"Assets, 2014, 2015, BALANCESHEETHIGHLIGHTS"}
{"_id":"q813e06ae","title":"","text":"AECO natural gas sales index, decline, percentage, 2011, 2013"}
{"_id":"q813ebad6","title":"","text":"ratio, amount, smaller than 100, sum of amount, 2008"}
{"_id":"q85c3554e","title":"","text":"Other, growing rate, Industrial, Rental Expenses, Table 0, Table 1, year, financial analysis"}
{"_id":"q8293450a","title":"","text":"Operating lease obligations, Total contractual obligations, ratio, financial analysis, lease accounting, financial metrics, liabilities, cash flow, company obligations, financial reporting."}
{"_id":"q81f5dc5c","title":"","text":"Natural Gas Wells, Gross, 10, production, reserves, exploration, companies, energy sector, investment, valuation, revenue, profitability, market analysis."}
{"_id":"q8498c0dc","title":"","text":"Office for Nonperforming Loans, Foreclosed Properties, growth rate, 2011, 2012, million"}
{"_id":"q85536af4","title":"","text":"Residential real estate, Recoveries, Commercial real estate, Gross charge-offs, 2023"}
{"_id":"q81a42bd2","title":"","text":"Earnings before taxes, Federal taxes, foreign taxes, growth rate, financial analysis, fiscal year, tax liabilities, corporate earnings, tax strategy, revenue growth, profit margins."}
{"_id":"q817d44ae","title":"","text":"Unvested, December 31, 2018, Shares, Adjusted balance, Benefit plans"}
{"_id":"q814a38fc","title":"","text":"Issued of Common Stock, negative value, 2004, financial analysis, equity, stock issuance, corporate finance."}
{"_id":"q815592a6","title":"","text":"Revenues, other income, 2007, financial analysis, income statement, proportion, total amount"}
{"_id":"q82a77912","title":"","text":"research and development expense, percentage change, 2015, 2016"}
{"_id":"q84f63fc8","title":"","text":"repurchase reserve, percentage change, 2008, 2009, millions"}
{"_id":"q83d8e992","title":"","text":"purchased impaired, 200, 3000, 2011, million"}
{"_id":"q84dfc8d8","title":"","text":"Net interest income, 2010, 2011, million"}
{"_id":"q84657c4a","title":"","text":"Entergy Texas, Inc., growth rate, net revenue, 2007"}
{"_id":"q82b76e4e","title":"","text":"Gross Unrealized Gains, Total corporate securities, December 31, 2015, million"}
{"_id":"q85b1cc34","title":"","text":"stock options, growth rate, shares, equity compensation, employee stock options, market trends, financial performance, 2023"}
{"_id":"q81755c30","title":"","text":"U.S., December 31, 2014, Client deposits, total amount"}
{"_id":"q85ab8388","title":"","text":"Average selling price, Granular urea, growth rate, product ton, market analysis, pricing trends, agricultural commodities, fertilizer industry, supply and demand, financial metrics."}
{"_id":"q815e5a4e","title":"","text":"Loans, leases, 2014, 2013, average value, financial analysis"}
{"_id":"q82b647e4","title":"","text":"Other, 2005, Bond trading securities, fair value, Asset Management, 2008"}
{"_id":"q82ba7094","title":"","text":"net income, common share, 2007, earnings per share, financial performance"}
{"_id":"q84479edc","title":"","text":"Trading account liabilities, 2010, sum, 15000, million"}
{"_id":"q84a7c2da","title":"","text":"Equity securities, carrying amount, fixed maturities, available-for-sale, growth rate, financial year, investment portfolio, market valuation, asset allocation."}
{"_id":"q83c1d5fe","title":"","text":"Equity securities, growth rate, 2009, December 31, 2010, million"}
{"_id":"q823ada82","title":"","text":"Total costs and expenses, Total revenue, growth rate, financial analysis, fiscal year, operating expenses, net income, profit margin, cost management, revenue growth, financial performance, expense ratio."}
{"_id":"q83789aba","title":"","text":"Basic net income, Industrial SquareFeet, 2007, 2025, common shareholders, financial analysis"}
{"_id":"q824c1b1c","title":"","text":"Annual growth rate, Number of Awards, January 1, financial analysis, performance metrics, year-over-year comparison, data trends, award distribution, financial forecasting."}
{"_id":"q8224dd2c","title":"","text":"mortgage, loans receivable, allowance, 2016, dollars, millions"}
{"_id":"q825e6902","title":"","text":"Allegion PLC, annualized return, investment, 2013-2017, financial performance, stock market, equity return, CAGR, total return, dividends, market capitalization."}
{"_id":"q843a7680","title":"","text":"net reserves, unpaid claims, claim adjustment expenses, growth rate, financial analysis, insurance industry, 2023"}
{"_id":"q81658e0e","title":"","text":"rent expense, operating leases, percentage change, 2001, 2002"}
{"_id":"q83ccbc6c","title":"","text":"Asset-backed securities, December 31, lowest value, chart, year."}
{"_id":"q82b95e3e","title":"","text":"Citi, home equity lines of credit, December 31, 2015, loan portfolio, percentage"}
{"_id":"q84ccfd52","title":"","text":"Total marketing, promotion, rewards and Card Member services, lowest, year, financial analysis, expenditure, budget, company performance, cost management."}
{"_id":"q815f474c","title":"","text":"Fixed income, 2015, millions"}
{"_id":"q813f92c6","title":"","text":"equity, 2018, increasing rate, million"}
{"_id":"q85b4b5f2","title":"","text":"Commission, brokerage, incurred losses, LAE, growth rate, financial analysis, insurance industry, 2023."}
{"_id":"q84ee81ac","title":"","text":"Structured notes, 2015, 2016, financial instruments, investment products, market trends, growth rate, investment banks, risk management, yield enhancement."}
{"_id":"q857f863e","title":"","text":"Communications, growth rate, Other, financial analysis, year, metrics."}
{"_id":"q84e42a22","title":"","text":"share-based compensation expense, percentage change, 2011, 2012"}
{"_id":"q856a557a","title":"","text":"average loan commitment, December 31, 2009, total loan commitments, millions"}
{"_id":"q8578f08a","title":"","text":"Net current-period other comprehensive income, Other comprehensive income before reclassifications, Changes related to cash flow derivative hedges, average, positive years."}
{"_id":"q81dfb1fc","title":"","text":"Municipal bonds, Available-for-sale debt securities, Total Fair Value, Total segment revenue, 1700 million"}
{"_id":"q8575d724","title":"","text":"Net plan assets, December 31, 2017, 25%, million"}
{"_id":"q839bdb2e","title":"","text":"distribution fees, Other revenues, table 1, growing rate, financial analysis, revenue growth, fiscal year"}
{"_id":"q82c77ef6","title":"","text":"cash provided by operating activities, percentage change, 2008, 2009"}
{"_id":"q82824750","title":"","text":"Fixed income, 2015, millions"}
{"_id":"q83141e00","title":"","text":"Total assets, Corporate bonds, Other bonds, Fixed maturity securities, 2016, million"}
{"_id":"q839de626","title":"","text":"Total long-term unsecured funding, Structured notes, 2016, average, financial analysis, funding sources, debt instruments."}
{"_id":"q833d3cb8","title":"","text":"non-cash impairment charges, real estate, development, percentage, financial reporting, asset valuation, impairment testing, accounting standards, market conditions, investment analysis"}
{"_id":"q84747074","title":"","text":"Interest, Operating leases, Purchase obligations, Investment commitments, 2018, millions"}
{"_id":"q825f6758","title":"","text":"net sales, growth rate, 2014, 2015"}
{"_id":"q83741de6","title":"","text":"Average contracted price per MWh, financial metrics, energy market, 2023, electricity pricing, market trends, power purchase agreements."}
{"_id":"q80ed48b8","title":"","text":"Total Revenues, Group retirement products, financial year, revenue growth, retirement plans, investment income, 2023, 2022, 2021, company performance, market trends."}
{"_id":"q81bf3fbc","title":"","text":"net income, diluted net income, common shareholders, percentage, 2008"}
{"_id":"q835f8944","title":"","text":"Planned generation, Average contracted price, TWh, MWh, financial analysis, energy market, growth rate, electricity contracts, market trends, pricing strategy."}
{"_id":"q83a9a06a","title":"","text":"Total consumer recoveries, 200, 500, 2016, million"}
{"_id":"q84a910ea","title":"","text":"net periodic benefit cost, Qualified plan, 2009, percentage, components, total amount"}
{"_id":"q83c12e24","title":"","text":"Cash equivalents, money market funds, Assets, Total Fair Value, Product revenue, average, financial analysis, million."}
{"_id":"q817946ba","title":"","text":"Revenues, 2008, September 30, thousand"}
{"_id":"q83adb6b4","title":"","text":"Foreign government bonds, highest value, section, financial analysis, investment portfolio, asset allocation."}
{"_id":"q83916586","title":"","text":"Gross profit, Net revenues, financial growth, profitability, fiscal year, revenue growth rate, financial analysis, earnings report, company performance, financial metrics."}
{"_id":"q854dade4","title":"","text":"Catastrophes for Prior Years, lowest year, financial analysis, insurance claims, loss reserves, underwriting, risk management, actuarial data."}
{"_id":"q84fcfe76","title":"","text":"Carrying amount, Private, ratio, Greater than twelve months, twenty-four months, total, 2009"}
{"_id":"q8110aa4c","title":"","text":"Aircraft on Firm Order, 2009, Boeing, Airbus, commercial aviation, backlog, orders, deliveries, aerospace industry, financial analysis."}
{"_id":"q8325cd44","title":"","text":"U.S. credit card loans, leases charged off 2014, cash proceeds, new securitizations, residential mortgage agency 2016, allowance for loan and lease losses, December 31, recoveries of loans and leases, previously charged off 2013."}
{"_id":"q84d6fd98","title":"","text":"Gross margin, Sales volume, product tons, financial analysis, revenue, cost of goods sold, profitability, financial metrics, fiscal year, earnings report."}
{"_id":"q8394d504","title":"","text":"Vested, Years Ended December 31, 2017, Shares, Beginning of period reserves, December 31, 2015"}
{"_id":"q81e2db2a","title":"","text":"Net income, noncontrolling interests, 2010, financial analysis, equity, subsidiaries, earnings, consolidation, minority interest"}
{"_id":"q8395cba8","title":"","text":"weighted average common shares outstanding, percentage change, 2017, 2018, basic computations"}
{"_id":"q8174dbe8","title":"","text":"Sales Volumes, 2009, 2008, financial analysis, year-over-year comparison, revenue growth, market trends, economic conditions, company performance."}
{"_id":"q85173688","title":"","text":"U.S. high-grade, increasing rate, 2005, financial projections, bond market, interest rates, credit quality, investment grade, yield curve, economic indicators."}
{"_id":"q82548a7c","title":"","text":"Income from continuing operations, Income taxes, financial analysis, fiscal year, revenue, profit, tax liability, earnings report, financial performance, corporate finance."}
{"_id":"q83c9a2b6","title":"","text":"Policy loans, Assets, Fair Value, 2010"}
{"_id":"q845db7b2","title":"","text":"Total loans and leases, total assets, table1, financial analysis, year, millions"}
{"_id":"q82e826f6","title":"","text":"Gross Unrealized Gains, Technology Corporate securities, Total corporate securities, December 31, 2015"}
{"_id":"q84596c52","title":"","text":"return on assets, actual return, expected return, percentual increase, 2013"}
{"_id":"q83608a24","title":"","text":"weighted average common shares, diluted computations, 2017, 2018, change"}
{"_id":"q81694e0e","title":"","text":"Seattle Metro, December 31, 2010, Apartment Units, Huntington Breakers, Rentable Square Footage"}
{"_id":"q8334e644","title":"","text":"Credit Card, Amount, 2012, average, million"}
{"_id":"q82cb6124","title":"","text":"Management fees, financial advice fees, distribution fees, net investment income, other revenues, 2009, millions"}
{"_id":"q83d7cdfa","title":"","text":"Notes payable, accrued interest, Gross written premiums, December 31, 2012, financial analysis, short-term liabilities, insurance premiums."}
{"_id":"q830cceac","title":"","text":"Elba Express, FEP, MilesofPipeline, financial analysis, pipeline companies, energy sector, infrastructure investment, operational metrics"}
{"_id":"q819b3022","title":"","text":"profit margin, 2018"}
{"_id":"q84ec400e","title":"","text":"Efficiency, SELECTEDRATIOS, Assets, BALANCESHEETHIGHLIGHTS, positive, average, million"}
{"_id":"q810b75d6","title":"","text":"Total cards-in-force, Other, 2016"}
{"_id":"q80f1979c","title":"","text":"Securities, Net realized losses, Earnings, 2008"}
{"_id":"q824e9e1e","title":"","text":"Investments, consolidated investment products, 2010, California, Number of Customers"}
{"_id":"q858d93f0","title":"","text":"Services, average value, 2012, 2011"}
{"_id":"q846e9500","title":"","text":"Total consumer recoveries, ratio, 200, 500, sum of elements, 2016"}
{"_id":"q85acc7b6","title":"","text":"Registered investment companies, growth rate, Total plan assets, leveling, level1, 2023."}
{"_id":"q84a39dcc","title":"","text":"Canada, International Offices, 2006, Operating Leases, Less Than 1 Year, Client Claims, Refunds, 2016"}
{"_id":"q8202f964","title":"","text":"investment income, 2014, million, range, 100, 1000"}
{"_id":"q831648ba","title":"","text":"Income taxes payable, Net earnings, average value, financial analysis, fiscal year, profitability, tax liability, earnings report, financial metrics."}
{"_id":"q82eca4f6","title":"","text":"commercial mortgage loans, fair value, December 31, 2012, total loans held for sale, percent"}
{"_id":"q82f0879c","title":"","text":"Amortized Cost, Fixed Maturities, financial ranking, investment, securities, valuation, financial reporting, market value, asset management, portfolio management"}
{"_id":"q815c4f74","title":"","text":"PNC, Series M Preferred Stock, redemption, December 10, 2012, total cash cost."}
{"_id":"q856f7f3c","title":"","text":"Group Retirement Products, Individual Fixed Annuities, 2010, average, million"}
{"_id":"q8558d53e","title":"","text":"Trading securities, debt, 2009, negative, sum, million"}
{"_id":"q81a5d414","title":"","text":"Gross written premiums, Net written premiums, Premiums earned, 2013"}
{"_id":"q84d939e6","title":"","text":"provision for impairment, December 31, 2011, billion"}
{"_id":"q8275aab8","title":"","text":"collateralized credit facility, real estate company, property acquisitions program, yearly interest income, million CAD"}
{"_id":"q8368b294","title":"","text":"S&P 500, percentual return, first year, stock market, investment performance, historical data, financial analysis."}
{"_id":"q83a81560","title":"","text":"Private equity, venture capital, December 31, 2010, operating profit, 2015"}
{"_id":"q83d06268","title":"","text":"Commercial real estate, Net Charge-offs, Recoveries, financial analysis, investment, property valuation, market trends, asset management, risk assessment, cash flow, portfolio management, real estate investment trusts (REITs), capital markets, underwriting, loan performance, credit risk, occupancy rates, lease agreements, property management, economic indicators, interest rates, market demand, valuation metrics, investment returns, financial modeling."}
{"_id":"q84674e44","title":"","text":"Risk-weighted assets, Total capital, average, financial analysis, capital adequacy, positive values, financial metrics, banking sector, regulatory compliance, Basel III, capital ratios, risk management."}
{"_id":"q83d346a4","title":"","text":"rent expense, 2008, 2009, increase"}
{"_id":"q83244604","title":"","text":"Policy fees, Years Ended December 31, 2011, Retained interest, AIA, 2011"}
{"_id":"q83fc49be","title":"","text":"Europe, Year Ended December 31, 2007, Retained Earnings, December 31, 2014, Revised, Total, Year Ended December 31, 2008"}
{"_id":"q83f1df74","title":"","text":"Fuel, Electric Vehicles, Growth Rate, 2023, Renewable Energy, Tesla, Ford, General Motors, Market Trends, Sustainability, Carbon Emissions, Energy Transition."}
{"_id":"q8524fb92","title":"","text":"Business separation costs, Business restructuring, cost reduction actions, Pension settlement loss, Operating Income, 2016"}
{"_id":"q81e99668","title":"","text":"total loan, average, 2011, million"}
{"_id":"q85518540","title":"","text":"rental expense, average, millions, 2000, 2001, 2002"}
{"_id":"q84f69ce8","title":"","text":"profit before taxes, profit, financial year, earnings, revenue, fiscal year, financial performance"}
{"_id":"q8315483e","title":"","text":"tax rate, 2008, aggregate net unrealized loss, company"}
{"_id":"q834a723e","title":"","text":"Residential mortgage, home equity, growth rate, financial analysis, housing market, interest rates, lending institutions, economic conditions, mortgage-backed securities, 2020, 2021, 2022, 2023."}
{"_id":"q819acb82","title":"","text":"Commercial, domestic, total, 2009, ratio"}
{"_id":"q8196f2c8","title":"","text":"net reserves, growth rate, 2006"}
{"_id":"q832a542c","title":"","text":"R&D expense, percentage change, 2016, 2017, financial analysis, expense report, company performance, budget allocation"}
{"_id":"q822a8e84","title":"","text":"investment advisory revenues, 2007, millions of dollars"}
{"_id":"q835308a4","title":"","text":"Interest rate swaps, Interest rate floors, growth rate, financial derivatives, 2023, asset management, risk management, market trends."}
{"_id":"q84bd152c","title":"","text":"Cost of sales, total, 2016, ratio"}
{"_id":"q84433acc","title":"","text":"performance shares, granted shares, ratio, percent, equity compensation, stock options, incentive plan, shareholder value, vesting schedule, total shares"}
{"_id":"q85c1337c","title":"","text":"Revenues, net of interest expense, 2010, million, financial analysis, earnings, net income, positive revenues, financial performance."}
{"_id":"q85c7f16c","title":"","text":"warehouse locations, Japan, logistics, supply chain, distribution centers, real estate, inventory management, market analysis, 2023"}
{"_id":"q833927cc","title":"","text":"Year Ended October 31, 2017, total value, 0, 5, million"}
{"_id":"q84a0ac02","title":"","text":"refineries, 2009, processed, total crude, blend stocks, mbpd"}
{"_id":"q85a31fae","title":"","text":"backlog, growth rate, 2015, 2016"}
{"_id":"q83f387fc","title":"","text":"Loans held for sale, average value, 2012, 2011, 2010, million"}
{"_id":"q826aa5b4","title":"","text":"Net earnings, As Reported, 2013, 2014, increase, financial performance, year-over-year, earnings growth"}
{"_id":"q81a4d2c6","title":"","text":"Active, Company stock, ESOP, growth rate, financial analysis, stock performance, equity compensation, market trends, investment strategy, fiscal year, shareholder value."}
{"_id":"q82729904","title":"","text":"U.S. Plans, Pension, 2016, average, retirement, funding ratio, liabilities, assets, defined benefit plans, actuarial assumptions."}
{"_id":"q84acf93a","title":"","text":"Home equity, sum, elements, greater than 10"}
{"_id":"q84331f2a","title":"","text":"Property and equipment, net, Total assets, 2012, average, financial analysis"}
{"_id":"q859adda8","title":"","text":"Marketplaces, 2009, ratio, total, financial analysis"}
{"_id":"q81f1664a","title":"","text":"stock-based performance unit awards, expense, 2018, 2017, 2016, millions"}
{"_id":"q827ba378","title":"","text":"compensation expense, directors, December 31, 2015, December 31, 2016, December 31, 2017, millions"}
{"_id":"q83b44f88","title":"","text":"Revenues, millions, 2016, 2017, increase"}
{"_id":"q85411d0e","title":"","text":"Foreign government, government agencies, Municipal bonds, RMBS, U.S. Treasuries, Fair value, 12 months or more."}
{"_id":"q84f8482c","title":"","text":"CECONY, retail choice customers, delivery service, increasing rate, lowest amount, year, financial analysis."}
{"_id":"q82604074","title":"","text":"RSUs, percentage increase, 2009, 2010"}
{"_id":"q82a3a3f0","title":"","text":"Net interest income, Total revenue, net of interest expense, financial analysis, earnings report, fiscal year, financial metrics, income statement."}
{"_id":"q816f0236","title":"","text":"Premiums, 2012, Negotiated amount, 2011, million"}
{"_id":"q84b879fe","title":"","text":"issued securities, security holders, total value, millions"}
{"_id":"q83b92f6c","title":"","text":"Earnings from operations, Pension, postretirement cash requirements, 2015, After 5 years"}
{"_id":"q82aa4520","title":"","text":"annual amortization expense, customer relationships, millions"}
{"_id":"q8386beba","title":"","text":"boiling water reactors, MW capacity, nuclear energy, reactor types, energy production"}
{"_id":"q847f8694","title":"","text":"Residential Mortgage Loans, Proportion, Total, 1 Year or Less, Percentage"}
{"_id":"q836795c6","title":"","text":"Securities America, Inc., Threadneedle, Actual Capital, 2023, million"}
{"_id":"q83837aac","title":"","text":"Commercial Banking, Investment Bank, total amount, greater than 1000, million"}
{"_id":"q811437fc","title":"","text":"Capital lease obligations, Operating lease obligations, financial analysis, lease accounting, financial reporting, lease liabilities, ASC 842, IFRS 16, financial metrics, lease obligations, company financials, fiscal year, financial year-end, lease agreements."}
{"_id":"q856edda2","title":"","text":"Total value, Cost, Amortized Cost, Aaa, financial analysis, valuation, investment, securities, credit rating, asset management"}
{"_id":"q81673f24","title":"","text":"Construction Payable, Estimated Fair Value, Net Sales, 2013"}
{"_id":"q8373aeec","title":"","text":"Collection, Total Collection, 2008, 2007, 2006, average"}
{"_id":"q81701b30","title":"","text":"General expenses, administrative expenses, other expenses, Production expenses, related taxes, financial analysis, expense summation, fiscal year, budget analysis."}
{"_id":"q82739688","title":"","text":"Net occupancy, total, 2005, percentage"}
{"_id":"q8250cb62","title":"","text":"400, 1000, 2011, million"}
{"_id":"q8111431c","title":"","text":"Other Expense, 30000, financial analysis, expense report, fiscal year, budget, financial forecasting"}
{"_id":"q82bbf4aa","title":"","text":"Earnings before taxes, financial performance, fiscal year, quarterly results, revenue growth, operating income, tax implications, profit margins, financial analysis, corporate earnings, economic conditions, industry trends."}
{"_id":"q820c112a","title":"","text":"Debt maturities, Operating lease obligations, Total obligations, Financial liabilities, Long-term debt, Lease commitments, Future cash flows, Maturity schedule, Financial obligations, Corporate finance."}
{"_id":"q843f9840","title":"","text":"Purchase of minerals in-place, growth rate, 2014, projections, financial analysis."}
{"_id":"q811fbd20","title":"","text":"market capitalization, February 19, 2016, stock market, equity valuation, financial metrics"}
{"_id":"q82eed906","title":"","text":"Professional fees, Personnel, Data processing and telecommunications, Foreign exchange activity, 2018"}
{"_id":"q81f9f8be","title":"","text":"Interest, Operating leases, table 2, increasing rate, year, financial analysis"}
{"_id":"q818096a4","title":"","text":"Employee separations, Liability, Investing activities, December 31, 2005, Year Ended December 31, 2006"}
{"_id":"q8380395a","title":"","text":"weighted average common shares, diluted computations, percentage change, 2015, 2016"}
{"_id":"q81ca2b0c","title":"","text":"loans, average, total loans, 2011"}
{"_id":"q85270e8c","title":"","text":"Granted Exercised, Canceled, Expired, Options For Shares, 2006"}
{"_id":"q847e2c36","title":"","text":"Segment net sales, growth rate, 2012, 2013, million"}
{"_id":"q85543eb6","title":"","text":"Interruptible sales, thousands of Dt Delivered, lowest year, financial analysis, sales data, energy sector, market trends."}
{"_id":"q82dba4da","title":"","text":"Corporate notes and bonds, 2010 Fair Value, Net sales, 2011"}
{"_id":"q8595bfee","title":"","text":"Balance at December 31, 2007-1, total value, elements, smaller than 15000, million"}
{"_id":"q82d3e286","title":"","text":"Unaffiliated customers, 2000, 2010, sum, million"}
{"_id":"q830dae8a","title":"","text":"Revenues, 2009, million, Management fees, Financial advice fees, Distribution fees"}
{"_id":"q81e7a268","title":"","text":"off-balance sheet obligations, total, millions"}
{"_id":"q815b4e3a","title":"","text":"Secured debt, 2006, December 31, increasing rate"}
{"_id":"q814c11c2","title":"","text":"Investment real estate, Gain (loss) recognized in OCI on derivatives, 2011, 2012, million"}
{"_id":"q823c56fa","title":"","text":"cash provided by operating activities, percentage change, 2007, 2008"}
{"_id":"q83ef4f2a","title":"","text":"accrued warranties, related costs, percentage change, 2005, 2006"}
{"_id":"q838e3f14","title":"","text":"committed credit facilities, unused credit facilities, December 31, 2010, millions"}
{"_id":"q83a31056","title":"","text":"Citi, home equity portfolio, December 31, 2015, loans, home equity lines of credit, revolving HELOCs, percentage."}
{"_id":"q844fa212","title":"","text":"Carrying amount, Total, 2009, million, financial analysis, percentage calculation"}
{"_id":"q816bd7aa","title":"","text":"Repurchases, securitization trusts, Residential Mortgage Agency, Allowance for loan and lease losses, January 1, 2015, 2016."}
{"_id":"q845fe974","title":"","text":"Assurant Solutions, 2015, Cash received, 2005, Gross Claims Liability"}
{"_id":"q8227f58e","title":"","text":"allowance for loan losses, percentage change, 2007, 2008"}
{"_id":"q831cc906","title":"","text":"Foreign currency forwards, Interest rate caps, years, sum, million"}
{"_id":"q83c6be48","title":"","text":"total amount, three months, finance, investment, liquidity, cash flow, short-term, financial analysis"}
{"_id":"q8164abd8","title":"","text":"Client deposits, Average Balance, Year Ended December 31, 2013, U.S., As of December 31, 2012"}
{"_id":"q838ac280","title":"","text":"amortization, revenue, 2010, 2011, 2012, 2013, 2014, financial analysis, accounting, average amounts"}
{"_id":"q857e548a","title":"","text":"Bank of America Corporation, Tier 1 capital, Standardized Approach, Granted Options, 2018, 2006, million"}
{"_id":"q819e62ec","title":"","text":"Average shares outstanding, December 31, 2003, Net sales, 2012, Total market value, common stock, December 31, 2002."}
{"_id":"q81190e80","title":"","text":"Debt maturities, Capital lease obligations, Less than 1 year, Thereafter, financial analysis, liabilities, balance sheet, cash flow management."}
{"_id":"q839fd986","title":"","text":"cumulative lease payments, employee, officer, company, business acquisition, 2008, 2009, 2010"}
{"_id":"q84e247d4","title":"","text":"Liabilities, 2011, Property, plant and equipment, Inventories"}
{"_id":"q82356106","title":"","text":"Attritional Ratio, Current Year, Total, 2013"}
{"_id":"q84581c94","title":"","text":"Global syndicated loans, Global long-term debt, Global equity, 2004, financial markets, capital raising, investment banking, debt instruments, equity markets."}
{"_id":"q84fab918","title":"","text":"total commitments, invest, funds, managed, firm, December 2013, December 2012, billions"}
{"_id":"q822d5cfe","title":"","text":"Fair Value, 30%, total Fair Value, 2011"}
{"_id":"q827065e4","title":"","text":"Goodwill, growth rate, 2019, million"}
{"_id":"q816dc54c","title":"","text":"Total marketing, promotion, rewards, Card Member services, increasing rate, Card Member rewards, 2014"}
{"_id":"q81b36020","title":"","text":"net inflows, institutional investors, retirement funds, target-date trusts, percentage, transfer"}
{"_id":"q8140c07e","title":"","text":"Con Edison, Projected benefit obligation, 2016, growth rate"}
{"_id":"q8523400e","title":"","text":"Net income, Basic earnings per share, 2008, 2007, 2006"}
{"_id":"q82b03f02","title":"","text":"Euro, U.S. dollars, Japanese yen, exchange rates, currency comparison, financial analysis, forex market, 2023."}
{"_id":"q81e874cc","title":"","text":"unrecognized tax benefits, gross adjustment, federal settlements, state settlements, 2009, millions"}
{"_id":"q8190fe5e","title":"","text":"Net revenues, growth rate, 2009, financial projections, revenue forecast"}
{"_id":"q8267ef2c","title":"","text":"Total Coal, Nuclear Sales, Total Forward Hedged Revenues, 2018, previous year, lower, elements"}
{"_id":"q84e70b0c","title":"","text":"percentage change, revenues, investments, equity method, 2000, 2001, 50% owned investments"}
{"_id":"q80ee24d6","title":"","text":"Distribution fees, growth rate, 2010, financial projection, revenue forecast."}
{"_id":"q856b1fc8","title":"","text":"cash to securities ratio, segregated special bank accounts, securities brokerage, futures brokerage, 2009, financial regulation, customer protection, liquidity management"}
{"_id":"q829d983e","title":"","text":"Non-GAAP, adjusted operating income, operating income, financial analysis, fiscal year, earnings report, profit margin, revenue growth, financial metrics."}
{"_id":"q835f1be4","title":"","text":"Management fees, financial advice fees, December 31, 2023, financial year, advisory services, expense trends, financial planning, investment management."}
{"_id":"q8262126e","title":"","text":"Payments, Marketplaces, increasing rate, financial year, transaction volume, e-commerce, growth rate, revenue, 2023."}
{"_id":"q8266f522","title":"","text":"Unaffiliated customers, proportion, greater than 2000, total amount, 2010"}
{"_id":"q84fe3854","title":"","text":"Group retirement products, Net Investment Income, Decrease in cash, 2010"}
{"_id":"q81c284ce","title":"","text":"Time deposits, Taxable, sum, financial analysis, investment, interest rates, liquidity, cash flow, financial institutions, savings accounts, economic indicators, fiscal year, revenue, taxation, financial metrics."}
{"_id":"q8200a484","title":"","text":"Notional, average, 2008"}
{"_id":"q85974f26","title":"","text":"Other comprehensive income, cash flow derivative hedges, ship improvements, 2013, 2014"}
{"_id":"q85a67226","title":"","text":"Distribution fees, total, 2012, ratio"}
{"_id":"q82893600","title":"","text":"Interest cost, benefit obligation, U.S. plans, pension plans, operating and maintenance, 2016, 2009."}
{"_id":"q85c994c2","title":"","text":"Other operating revenues, Total fair value, RSUs vested, Table 1, Table 2, increasing rate, financial analysis, revenue trends, equity compensation, fiscal year."}
{"_id":"q82a5395e","title":"","text":"Equity, Total Revenue, increasing rate, financial analysis, company performance, fiscal year, revenue growth, financial metrics, balance sheet, income statement."}
{"_id":"q83e33cbc","title":"","text":"Total loans, Card Member loans, growth rate, Average loans, financial analysis, year, metrics."}
{"_id":"q81d96a7c","title":"","text":"OpCity, acquired by Realtor.com, had non-cash assets valued at approximately $210 million during the transaction. \n\nKeywords: OpCity, Realtor.com, acquisition, non-cash assets, $210 million, transaction."}
{"_id":"q815ccfda","title":"","text":"Balance at Beginning of Period, average, 2006"}
{"_id":"q8291a70e","title":"","text":"Interest rate swaps, Assets, financial derivatives, market trends, 2023, risk management, fixed rate, floating rate, corporate finance, investment banks."}
{"_id":"q859158be","title":"","text":"Net income, GAAP, 2017, 2018"}
{"_id":"q819f63ea","title":"","text":"average train speed, mph, 2008, 2009, 2010, transportation, rail industry, statistics"}
{"_id":"q825216e8","title":"","text":"net sales, percentage change, 2011, 2012"}
{"_id":"q817e574a","title":"","text":"Land, December 31, 2016, Interest expense, Year Ended December 31, 2014"}
{"_id":"q82a101d6","title":"","text":"gross profit, percentage change, 2009, 2010"}
{"_id":"q854c5836","title":"","text":"Net sales, highest total amount, financial performance, revenue, fiscal year, company earnings, sales growth, market analysis, financial metrics."}
{"_id":"q842dcb60","title":"","text":"operating leases, minimum lease payments, December 31, 2006, percentage, financial analysis"}
{"_id":"q81a8f77a","title":"","text":"U.S. dollars, Pounds sterling, exchange rate, currency conversion, financial analysis, forex market, 2023."}
{"_id":"q83c8aae6","title":"","text":"Operating leases, financial analysis, lease obligations, capital expenditures, financial reporting, lease liabilities, accounting standards, ASC 842, IFRS 16, cash flow, present value, discount rate, lease term, financial metrics, lease expense, amortization, financial modeling, corporate finance, investment analysis."}
{"_id":"q847b33be","title":"","text":"Carrying Value, Liabilities, 2007, Deposits, Other borrowings"}
{"_id":"q81ac2d50","title":"","text":"Derivative liabilities, financial instruments, valuation, risk management, hedge accounting, balance sheet, financial derivatives, market risk, counterparty risk, fair value, financial reporting."}
{"_id":"q858eb974","title":"","text":"Wholesale revenues, Transmission revenues, Other revenues, 2018, dollars, millions"}
{"_id":"q853283b6","title":"","text":"growth rate, operating profit, space systems, 2012"}
{"_id":"q8186be08","title":"","text":"Stores Opened, 2011"}
{"_id":"q85895092","title":"","text":"net cash provided by operating activities, percentage growth, 2009, 2010"}
{"_id":"q81f21d9c","title":"","text":"company property, United States, asset allocation, real estate, geographical distribution"}
{"_id":"q839a8cf6","title":"","text":"Converters, Amplifiers, Radio frequency, Analog signal processing, 2014, Subtotal analog"}
{"_id":"q835c7114","title":"","text":"total debt, percentage change, 2015"}
{"_id":"q83385ebe","title":"","text":"Noninterest expense, growth rate, 2016, 2017, million"}
{"_id":"q814985ec","title":"","text":"total revenues, United States, Europe, average value, financial comparison"}
{"_id":"q851f21c2","title":"","text":"Residential mortgage-backed securities, 2008, financial analysis, securitization, mortgage market, investment, risk assessment, credit rating agencies, subprime mortgages, collateralized debt obligations, market liquidity, financial crisis, Fannie Mae, Freddie Mac, Lehman Brothers, Bear Stearns."}
{"_id":"q85bb6136","title":"","text":"customer indemnification reserve, total other expenses, 2008, percentage calculation"}
{"_id":"q84b4101c","title":"","text":"unrecognized tax benefits, percentage change, 2012, 2013"}
{"_id":"q824fcc9e","title":"","text":"impairment charge, financial reporting, annual report, 2021, 2022, 2023, millions, accounting standards, asset valuation, company performance"}
{"_id":"q831d73a6","title":"","text":"stock option, expenses, percentage change, 2009"}
{"_id":"q854f9d2a","title":"","text":"allowance for doubtful accounts, percentage change, 2011, 2012, expense, financial analysis"}
{"_id":"q82815ed0","title":"","text":"Hologic, Biolucent, acquisition, common stock, estimated price, transaction, October 2023."}
{"_id":"q816427ee","title":"","text":"Income from continuing operations, As Reported, financial analysis, year comparison, financial performance, earnings report, fiscal year, company analysis."}
{"_id":"q850271a8","title":"","text":"Postretirement, Net periodic benefit cost, lowest year, financial analysis, benefit cost trends."}
{"_id":"q824b7c3e","title":"","text":"percentage change, revenues, investments, equity method, 2001, 2002"}
{"_id":"q8312357c","title":"","text":"Pass-through securities, increasing rate, mortgage-backed securities, interest rates, yield, Fannie Mae, Freddie Mac, Ginnie Mae, 2023."}
{"_id":"q833a573c","title":"","text":"account balance, growth, 2017"}
{"_id":"q8220b65c","title":"","text":"amortization, revenue, financial analysis, last three years, millions"}
{"_id":"q83112876","title":"","text":"interest expense, loan, first quarter, financial analysis, interest rate, amortization, principal, financial reporting"}
{"_id":"q8518426c","title":"","text":"Incurred losses, LAE, financial analysis, insurance industry, 2023, actuarial data, loss reserves, underwriting performance."}
{"_id":"q8177a756","title":"","text":"Number of Accounts Re-defaulted for Six Months, financial metrics, default rates, credit risk, loan performance, financial analysis, risk management, October 2023."}
{"_id":"q8485967e","title":"","text":"oil sales, largest value, market trends, commodity prices, supply and demand, seasonal fluctuations, OPEC, Brent Crude, WTI, 2023, economic indicators"}
{"_id":"q847740b0","title":"","text":"free cash flow, percent change, 2015, 2016"}
{"_id":"q81b5f0ec","title":"","text":"retained earnings, unrecognized tax benefits, 2007, ratio, decrease, financial analysis"}
{"_id":"q84892e92","title":"","text":"Operating earnings, Con Edison, 2008, funded status change in plan assets, Con Edison, 2013"}
{"_id":"q81fc8034","title":"","text":"Fair Value, Aaa, highest, year, financial analysis, credit rating, market trends"}
{"_id":"q82a22138","title":"","text":"Income taxes, greater than 1000, year, financial analysis, tax regulations, revenue, fiscal policy."}
{"_id":"q82074078","title":"","text":"Corporate Benefit Funding, Total expenses, 50%, sum, million"}
{"_id":"q823e98ca","title":"","text":"Other comprehensive income, Net current-period other comprehensive income, cash flow derivative hedges, financial analysis, reclassifications, fiscal years."}
{"_id":"q81731cae","title":"","text":"Premiums earned, 2015, 2014, financial reporting, insurance, revenue, year-over-year comparison, underwriting, financial performance, earnings analysis."}
{"_id":"q856bb866","title":"","text":"U.S. dollars, Pounds sterling, Contract amount, 2023"}
{"_id":"q82497998","title":"","text":"Policy fees, 2012, 2011, 2008, average, financial analysis"}
{"_id":"q84c1b802","title":"","text":"net periodic benefit cost, Qualified plan, 2009, components, positive, million"}
{"_id":"q82e92768","title":"","text":"KMLP, Sierrita Gas Pipeline LLC, FEP, financial analysis, pipeline valuation, investment, cash flow, project financing, energy sector, infrastructure investment."}
{"_id":"q8271c4f2","title":"","text":"money pool, operating cash flows, percentage, receivables, 2003"}
{"_id":"q8391f000","title":"","text":"retained interests, fair value, growth rate, 2018, 2017"}
{"_id":"q81c5a8c0","title":"","text":"U.S. Government obligations, Qualified Plans, Pension plans, 2023, financial analysis, agency obligations."}
{"_id":"q825b9718","title":"","text":"Purchase of minerals in-place, growth rate, financial analysis, mineral companies, investment trends, market valuation, 2023."}
{"_id":"q8178ae1c","title":"","text":"Total operating revenues, 2011, 2012, increasing rate"}
{"_id":"q8128f872","title":"","text":"Securities loaned, Aggregate contractual principal, 2017, 2015, million"}
{"_id":"q80ef6abc","title":"","text":"Financial Services, 2007, total amount, million"}
{"_id":"q8372ab1e","title":"","text":"Unrealized gains, derivative instruments, net of income tax, net income, financial analysis, fiscal year, accounting standards, financial reporting."}
{"_id":"q82ea1bb4","title":"","text":"greatest stores, opened, 2011, 2010, retail, sales growth, market expansion, consumer trends, company performance, financial analysis"}
{"_id":"q845a7ee4","title":"","text":"CET1 capital, Basel III, Standardized Transitional, 183000, capital requirements, regulatory framework, financial institutions, capital adequacy, banking sector, risk-weighted assets."}
{"_id":"q822f7f2a","title":"","text":"Total loans and leases, financial metrics, year, highest, financial institutions, lending, credit, economic indicators, bank performance, asset growth."}
{"_id":"q8576c1f2","title":"","text":"Salaries, employee benefits, 2018, 2017, average, compensation, payroll, workforce, expenses"}
{"_id":"q823410b2","title":"","text":"ASSETS, 2003, financial analysis, total amount, greater than 500000, thousand"}
{"_id":"q83462972","title":"","text":"Defined contribution plans, growth rate, 2016, retirement savings, investment performance, employer contributions, employee contributions, market trends."}
{"_id":"q843c7958","title":"","text":"Ending balance, Fiscal Year 2017, ETBH Capital Trust XXIII, ETBH Capital Trust XXIV, Face Value"}
{"_id":"q8125caf8","title":"","text":"operating leases, rental expense, 2014, 2009, 2010, 2011, average, financial reporting, GAAP, IFRS, lease accounting"}
{"_id":"q82ee4676","title":"","text":"Commercial, Gross Recoveries, 2014, percentage"}
{"_id":"q85d11300","title":"","text":"Contract valuation adjustments, financial metrics, valuation, adjustments, greater than 1, year, financial analysis."}
{"_id":"q811e915c","title":"","text":"General and administrative expense, growth rate, General and Administrative Expenses, revenues, financial analysis, company performance, fiscal year, million, financial metrics."}
{"_id":"q83f97dba","title":"","text":"As of January 1, 2023, Awards, Year, Financial Analysis, Data Comparison."}
{"_id":"q85cfd724","title":"","text":"Auto & Home, percentage, positive elements, total amount"}
{"_id":"q81251e82","title":"","text":"principal transaction, 2013, increasing rate, financial growth, market trends, investment strategies, revenue projections, economic analysis"}
{"_id":"q83a513ba","title":"","text":"Interest rate swaps, Interest rate floors, Interest rate caps, 2007, average value, million"}
{"_id":"q83133436","title":"","text":"annual amortization expense, customer relationships, network location intangibles, millions"}
{"_id":"q837788f0","title":"","text":"Fixed income, 2015, 2016, difference, millions"}
{"_id":"q85cd693a","title":"","text":"Cash, cash equivalents, Fair Value, negative, financial analysis, liquidity, balance sheet, cash flow, assets, financial reporting."}
{"_id":"q8582252e","title":"","text":"allowance for doubtful accounts, percentage increase, 2009, 2010"}
{"_id":"q8398e9fa","title":"","text":"valuation allowance, state net operating loss carryforwards, December 31, 2012"}
{"_id":"q84cbe61a","title":"","text":"aggregate notional amount, outstanding foreign currency hedges, percentage change, 2011, 2012"}
{"_id":"q83ddee88","title":"","text":"Individual Fixed Annuities, Cash, 2009, Table 0, Table 2, average value, financial analysis"}
{"_id":"q810a5124","title":"","text":"Securities America, Inc., Actual Capital, 2010, 2009, financial comparison, capital difference, million"}
{"_id":"q820d0378","title":"","text":"total indebtedness, nonsecure, December 31, 2015, percentage"}
{"_id":"q84ed6326","title":"","text":"Goodwill, 2016, 2017, million, increasing rate"}
{"_id":"q83bdabd2","title":"","text":"Net revenues, 2015, 2016"}
{"_id":"q81eef32e","title":"","text":"Other analog, Converters, increasing rate, financial analysis, market trends, year comparison, revenue growth, industry performance"}
{"_id":"q82acb2ba","title":"","text":"U.S. Treasuries, Fixed Income Securities, sum, financial markets, government bonds, interest rates, investment portfolio, securities market, Treasury bonds, Treasury notes, Treasury bills."}
{"_id":"q84644d66","title":"","text":"Income tax expense, 2016, dollars, millions"}
{"_id":"q81f6d2e2","title":"","text":"Management fees, financial advice fees, highest year, financial services, advisory firms, 2023, investment management, fee structures, asset management, financial planning."}
{"_id":"q83eb26ca","title":"","text":"Fair Value, 30%, 2011"}
{"_id":"q84da3364","title":"","text":"Total revenue, 2013, 2014, increasing rate, millions"}
{"_id":"q81ae8f8c","title":"","text":"MST, net sales, operating profit, 2010, 2011, ratio, decrease"}
{"_id":"q8145201a","title":"","text":"No surrender charge, 2010 Individual Fixed Annuities, Change in cash, 2008, Total reserves, 2010 Individual Variable Annuities"}
{"_id":"q84d648f8","title":"","text":"Swaps, Futures, Forwards, Written Options, Purchased Options, Interest Rate Contracts, Notional Amount, 2005, Financial Derivatives"}
{"_id":"q848b3818","title":"","text":"Policy fees, 2015, 2014, difference, millions"}
{"_id":"q83510c84","title":"","text":"Asset-backed, 2016, million"}
{"_id":"q81825962","title":"","text":"Consumer, 2008, percentage, total"}
{"_id":"q827db0d2","title":"","text":"shares, negative, 2012, financial analysis, equity, stock market, share count, company valuation"}
{"_id":"q858a1a5e","title":"","text":"average price, shares repurchased, company, 2016"}
{"_id":"q84ada312","title":"","text":"asset retirement obligations, 2002, 2003, financial reporting, liabilities, accounting standards"}
{"_id":"q812c0b0c","title":"","text":"Total trading account assets, growth rate, 2010, 2011, million"}
{"_id":"q8344f5de","title":"","text":"Net income, Depreciation, Amortization, financial analysis, fiscal year, earnings, cash flow, accounting, financial metrics, valuation."}
{"_id":"q84f0138c","title":"","text":"North America, EMEA, Total change, U.S. GAAP, financial comparison, million"}
{"_id":"q81316fac","title":"","text":"December 31, 2017, 2016 program, percent remaining, available for purchase"}
{"_id":"q8596969e","title":"","text":"Share repurchase program, October 2013, average, companies, stock buyback, financial analysis, market trends."}
{"_id":"q81e68536","title":"","text":"Amortized Cost, Private Value, 2014, Financial Analysis, Valuation, Investment, Asset Management"}
{"_id":"q81c79824","title":"","text":"Share repurchase program, October 2013, $1,000,000, $2,000,000"}
{"_id":"q81fd9366","title":"","text":"Canada-1, Total calendar year effect, growing rate, financial analysis, economic indicators, fiscal year, investment trends, market performance, 2023."}
{"_id":"q84dc5c34","title":"","text":"Revenues, net of interest expense, 80000, financial analysis, fiscal year, total amount, financial metrics"}
{"_id":"q812ed2d8","title":"","text":"Total transaction and integration charges, 2010, exceeds 30%, element."}
{"_id":"q857cef82","title":"","text":"Total available-for-sale securities, financial assets, investment portfolio, market value, securities classification, balance sheet, financial instruments, fair value, unrealized gains, investment strategy."}
{"_id":"q8126ce80","title":"","text":"North Sea, oil reserves, total amount, financial valuation, energy companies, BP, Shell, Equinor, 2023."}
{"_id":"q844dbad8","title":"","text":"revenue growth rate, technology, risk management, 2015, 2016"}
{"_id":"q84845660","title":"","text":"pipeline barrels, percentage decline, 2007, 2009"}
{"_id":"q82287360","title":"","text":"Decreases in current period tax positions, Net sales, Year Ended December 31, 2014"}
{"_id":"q829bcdd8","title":"","text":"Deposits with banks, Average volume, increasing rate, financial year, banking sector, interest rates, liquidity, economic indicators."}
{"_id":"q81f93208","title":"","text":"Total gross recoveries, Fixed annuity, 2012, 2006"}
{"_id":"q811517ee","title":"","text":"growth rate, balance, December 31, 2008, December 31, 2009"}
{"_id":"q8265da70","title":"","text":"Purchase of minerals in-place, growth rate, mining industry, investment, market analysis, mineral rights, acquisition, valuation, 2023."}
{"_id":"q81f4d938","title":"","text":"Balance, December 31, 2007, million"}
{"_id":"q82eb0f9c","title":"","text":"Aircraft on Firm Order, financial analysis, aerospace industry, Boeing, Airbus, order backlog, Q3 2023, market trends, defense contracts."}
{"_id":"q81aa19b6","title":"","text":"Paid losses, Vested shares, December 31, 2016, financial analysis, average amount, years ended, company performance."}
{"_id":"q845b385c","title":"","text":"Pension Fundings, Commitment Type, 2023, financial analysis, investment strategy, asset allocation, retirement plans, capital commitments, institutional investors, funding levels."}
{"_id":"q8539a24a","title":"","text":"U.S. high-grade, average growth rate, 2003, 2004"}
{"_id":"q8586ac20","title":"","text":"Company, Bank, sum, year, financial analysis, data, thousand"}
{"_id":"q84f51a8a","title":"","text":"Premium, Total revenue, Policy benefits, Required interest on net reserves, Life insurance, Actuarial valuation, Underwriting, Reserves, Financial metrics, Insurance companies, Risk management."}
{"_id":"q85984980","title":"","text":"Commercial real estate, December 31 2008, Assets in custody, December 31 2009"}
{"_id":"q8328ed6c","title":"","text":"Net investment income, Distribution fees, financial growth, investment companies, revenue analysis, 2023, financial performance."}
{"_id":"q83f8afde","title":"","text":"Other assets, TradeHelm, Compensation expense, December 31, 2005"}
{"_id":"q82a009b6","title":"","text":"net losses, sales, non-core towers, assets, percent change, 2007, 2008"}
{"_id":"q81ee3fa6","title":"","text":"North American consumer packaging, total consumer packaging sales, 2012, percentage."}
{"_id":"q8184fb22","title":"","text":"average share price, shares repurchased, 2011"}
{"_id":"q85ca9516","title":"","text":"Office for Nonperforming Loans, Foreclosed Properties, growth rate, 2011"}
{"_id":"q846cc1ee","title":"","text":"discontinued operations, average revenue, 2013, 2011, millions"}
{"_id":"q818187da","title":"","text":"Operating income, Other investment income\/(losses), Equity in earnings of unconsolidated affiliates, Interest and dividend income, consolidation, financial metrics, income statement, earnings report."}
{"_id":"q84370e1e","title":"","text":"Net Charge-offs, Office, Total, 2011"}
{"_id":"q811dbf2a","title":"","text":"collateralized financings, 2018, repurchase agreements, securities loaned, financial markets, total amount, million"}
{"_id":"q83ac8384","title":"","text":"Registered investment companies, 2018, sum, range, financial assets, mutual funds, ETFs, investment management, SEC regulations."}
{"_id":"q84ce42de","title":"","text":"deferred acquisition payments, 2018, 2019, 2020, 2021, 2022, millions"}
{"_id":"q854769d4","title":"","text":"Gross investment income, investment expenses, year-end, December 31, financial performance, investment returns, income statement, fiscal year, financial analysis."}
{"_id":"q8201b8d8","title":"","text":"Finance Companies, Amortized cost, Gross unrealized gains, Gross unrealized losses, Average, Financial metrics, Millions"}
{"_id":"q831acf48","title":"","text":"Commercial, foreign reach, 2010, growth rate, millions"}
{"_id":"q8205e688","title":"","text":"Cost of goods sold, External net sales, average value, financial analysis, revenue, profitability, fiscal year, financial metrics."}
{"_id":"q82b41e56","title":"","text":"Capital leases, Carrying amount, 2003, 2002, average"}
{"_id":"q84cff2f0","title":"","text":"non-cash stock-based compensation, expense, percentage change, 2013, 2014"}
{"_id":"q85b9e5b8","title":"","text":"FES, OE, Expenses on Support services, amount gap, million"}
{"_id":"q82ff7716","title":"","text":"BlackRock, common stock, equivalent shares, December 31, 2015, equity method, cost per share, dollars"}
{"_id":"q83e22426","title":"","text":"Other comprehensive income, cash flow derivative hedges, positive, 2023."}
{"_id":"q83b1443c","title":"","text":"Exercisable Shares, Other Income, Percentage Change, 2013"}
{"_id":"q8314b324","title":"","text":"Fair Values, Total derivatives, hedging instruments, December 31, Assets, financial year, valuation, risk management."}
{"_id":"q85940ec4","title":"","text":"Structured notes, Total long-term unsecured funding, 2016, average, million"}
{"_id":"q853a6126","title":"","text":"Fixed maturities, Policy loans, Swaps, financial analysis, investment portfolio, insurance companies, asset management, liquidity management, risk management."}
{"_id":"q835915aa","title":"","text":"Service cost, Interest cost, Employer contributions, Pension Benefits, 2015, average value, million"}
{"_id":"q81232230","title":"","text":"cash from operations, percentage change, 2008, 2009"}
{"_id":"q83a6f7b6","title":"","text":"Policyholders’ account balances, investment contracts, Policy loans, Fair Value, Assets, total amount, years, million."}
{"_id":"q816357f6","title":"","text":"Rental, management, 2010, total amount"}
{"_id":"q85ba959e","title":"","text":"Interest rate, Foreign exchange, 2005, Notional amounts, billion"}
{"_id":"q81332f22","title":"","text":"Total fixed rate debt, Variable rate debt, Total debt, 2023"}
{"_id":"q8396ee3e","title":"","text":"total liability, percentage decrease, December 31 2007, December 31 2008"}
{"_id":"q85b816b6","title":"","text":"Total revenues, Net realized capital gains, financial analysis, investment performance, revenue growth, fiscal year, capital gains, financial metrics, profitability, earnings report."}
{"_id":"q83d15722","title":"","text":"Total operating expenses, Total operating revenues, financial analysis, operating income, profit margins, revenue recognition, expense management, financial metrics, fiscal year, operating performance."}
{"_id":"q81c91bd6","title":"","text":"Secured debt, Total debt, 2005, December 31"}
{"_id":"q83ff4a60","title":"","text":"Interest expense, 2009, average, financial analysis, company performance, debt management, cost of capital, financial metrics"}
{"_id":"q84f1161a","title":"","text":"Noninterest expense, 2016, million"}
{"_id":"q84d48068","title":"","text":"Fixed-rate, Total Commercial Banking, average, positive, million"}
{"_id":"q81afd040","title":"","text":"Operating profit, Net income, 2012, December 31, 2002, financial analysis, profit calculation"}
{"_id":"q858184ca","title":"","text":"Institutional Investors, Non-U.S., Loans, Leases, 2023"}
{"_id":"q8316fc06","title":"","text":"Sales volume, 2017, greater than 200, financial analysis, revenue, market share, sales metrics."}
{"_id":"q827cc5dc","title":"","text":"non-cash stock-based compensation, expense, percentage change, 2012, 2013"}
{"_id":"q81bcfd1a","title":"","text":"Professional fees, consulting fees, Depreciation, amortization, Amount, positive, years, sum, financial analysis"}
{"_id":"q81e57b96","title":"","text":"Balance, December 31, 2012, Net sales, Year Ended December 31, 2014"}
{"_id":"q835a4894","title":"","text":"oil sales, gas sales, 2023, energy sector, revenue, market analysis"}
{"_id":"q8170c918","title":"","text":"Interest Income, 2008, growth rate"}
{"_id":"q85777200","title":"","text":"Held-for-sale, Held-for-investment, financial analysis, asset valuation, investment strategy, financial reporting, market assessment, liquidity, portfolio management, financial metrics."}
{"_id":"q822c51ec","title":"","text":"Investment Bank for Total, 2009, 2010, million, increasing rate"}
{"_id":"q85003dde","title":"","text":"International Consumer and Network Services, U.S. Consumer Services, Card Member receivables, 2016, 2017, sum."}
{"_id":"q8433e9a0","title":"","text":"Solid Waste, Amortization, landfill airspace, average, financial analysis, positive values, data analysis, environmental finance."}
{"_id":"q829ed85c","title":"","text":"Provision for credit losses, Gains on sales of debt securities, Restated, 2005"}
{"_id":"q82432d04","title":"","text":"Change, net of taxes, financial analysis, fiscal year, tax impact, revenue growth, expense reduction, net income, financial performance, corporate earnings, tax liabilities, profit margins, year-over-year comparison."}
{"_id":"q820b0bcc","title":"","text":"net cash, operating activities, continuing operations, proceeds, maturities, investments, million"}
{"_id":"q82d6a034","title":"","text":"Total trading account assets, growth rate, 2010"}
{"_id":"q8348fc4c","title":"","text":"total electric retail, 2018, sum, threshold, 2000, thousand"}
{"_id":"q83100f7c","title":"","text":"Brazilian paper sales, printing papers, 2005"}
{"_id":"q828c1afa","title":"","text":"Fair of Total, ratio, elements, range, 1000, 3000, sum, financial analysis, metrics"}
{"_id":"q8157d8d6","title":"","text":"Volume – Units, EMEA, Latin America, total amount, excluding, greater than 1000"}
{"_id":"q85b90684","title":"","text":"homebuilding, financial services, growth rate, construction industry, real estate, 2023, market trends, economic indicators"}
{"_id":"q813cd09a","title":"","text":"Liquid hydrocarbons, growth rate, Natural gas, mmbbl, bcf, financial analysis, energy sector, production metrics."}
{"_id":"q82441796","title":"","text":"fair market value, plan assets, benefit pension plans, decrease, 2014, 2015"}
{"_id":"q819d229c","title":"","text":"BALANCE, JANUARY 1, 2007, negative, column number, financial analysis, accounting records"}
{"_id":"q85bc44e8","title":"","text":"Swaps, Interest Rate Contracts, Notional Amount, 2005, Growth Rate"}
{"_id":"q85709e08","title":"","text":"Weighted average partnership Units, Industrial SquareFeet, 2007, 2022, average amount, outstanding, financial analysis"}
{"_id":"q84805b5a","title":"","text":"Labor and related benefits, Transfer and disposal costs, Maintenance and repairs, Subcontractor costs, 2013"}
{"_id":"q83fa38cc","title":"","text":"Group specialty, growth rate, 2011, percentage"}
{"_id":"q833b4156","title":"","text":"total non-interest income, 2012, financial performance, revenue, positive income, banking sector, earnings, financial institutions"}
{"_id":"q8399f3a4","title":"","text":"Total loans, Card Member loans, financial year, 2023, American Express, Citibank, JPMorgan Chase, credit card debt, consumer loans."}
{"_id":"q83b376e4","title":"","text":"weighted average interest rate, cash, cash equivalents, short-term investments, 2007, 2006"}
{"_id":"q8504d8bc","title":"","text":"repurchase reserve, 2008, 2009, percent increase, sales, financial analysis"}
{"_id":"q82e2ab22","title":"","text":"Total asset-backed, Corporate bonds, Other bonds, Financial analysis, Investment, Securities, Market trends, 2023."}
{"_id":"q829908be","title":"","text":"GAAP, Operating Income, 2017, increasing rate, financial analysis, projections, revenue growth, expense management, accounting standards."}
{"_id":"q83669e0a","title":"","text":"Average annual rent per square foot, Life science, Average annual rent per unit, Senior housing, Positive values, Sum, Financial analysis, Real estate, Market trends"}
{"_id":"q83dd4992","title":"","text":"compressed natural gas, vehicles, conversion, energy sector, environmental impact, alternative fuels, transportation industry"}
{"_id":"q830bca48","title":"","text":"Premiums, GAAP, Net investment income, growth rate, table 1, financial analysis, fiscal year, revenue growth, insurance industry."}
{"_id":"q859a1ed6","title":"","text":"Home equity, Allowance, Commercial, positive, average value, million"}
{"_id":"q810cc3b4","title":"","text":"Average contract revenue, MWh, Planned net MW, operation, financial analysis, revenue generation, energy sector, contract terms, operational capacity, market trends."}
{"_id":"q8402e2e2","title":"","text":"Cash and cash equivalents, Goodwill and intangible assets, net, Borrowings, 2017, average, dollars, millions"}
{"_id":"q858cbd4a","title":"","text":"Total segment, Total Incurred, Catastrophes, increasing rate, financial analysis, year, lowest amount."}
{"_id":"q83bf4b36","title":"","text":"Andes SBU, growth rate, 2014, financial projection, million, revenue, forecast, CAGR, financial analysis."}
{"_id":"q812de33c","title":"","text":"TRICARE, 2003, 2004, healthcare costs, military healthcare, budget allocation, defense spending, healthcare expenditures"}
{"_id":"q85831240","title":"","text":"claims, September 30, 2007, September 30, 2009, September 30, 2010, September 30, 2011, September 30, 2012, percentage decrease"}
{"_id":"q851a0e26","title":"","text":"Capital lease obligations, Gross written premiums, December 31, 2012, financial analysis, liabilities, insurance, accounting standards, financial reporting."}
{"_id":"q8375b8cc","title":"","text":"Net realized capital gains, positive, losses, income, year, financial performance, investment returns."}
{"_id":"q832c4dfe","title":"","text":"adjustments, valuation allowances, increase, 2011, 2012, percentage"}
{"_id":"q812a0c08","title":"","text":"Purchased power, average increasing rate, 2017, 2018, million"}
{"_id":"q84a5d830","title":"","text":"Camarillo Oaks, Bonita Cedars, Anavia, total amount, financial analysis, investment valuation, property assessment, real estate, financial metrics."}
{"_id":"q82d2c518","title":"","text":"Fixed maturities, available-for-sale, Carrying amount, financial assets, investment portfolio, market value, securities, 2023, 2022, 2021, company reports, asset management."}
{"_id":"q85461e58","title":"","text":"Gross written premiums, growth rate, premiums earned, insurance industry, financial performance, underwriting, revenue growth, fiscal year, market analysis."}
{"_id":"q82a93a40","title":"","text":"Assumed, 2014, total assets, million"}
{"_id":"q850114b6","title":"","text":"Hudson Yards, growth rate, base rent, New York, third period, real estate, commercial lease, property valuation, investment analysis."}
{"_id":"q82200a7c","title":"","text":"Other revenues, Transmission revenues, growth rate, financial analysis, revenue streams, fiscal year, company performance, financial metrics."}
{"_id":"q85c747d0","title":"","text":"Incurred losses, December 31, 2017, Vested shares, Years ended December 31, 2016, financial analysis, loss calculation."}
{"_id":"q8483968a","title":"","text":"Proceeds, Gross investment gains, Fixed Maturity Securities, increasing rate, financial year, investment performance, securities market."}
{"_id":"q836f2ebc","title":"","text":"total amount, December 31, 2000, 3000, 2010, million"}
{"_id":"q8193210c","title":"","text":"net cash provided by operating activities, percentage change, 2016, 2017"}
{"_id":"q8361d06e","title":"","text":"Premium wine, December 31, 2014, Beginning Balance, Year Ended December 31, 2015"}
{"_id":"q84c06a10","title":"","text":"Acquisition payments, Software and IT maintenance expenses, 2017, average amount, financial analysis, expense tracking, investment evaluation."}
{"_id":"q8321712c","title":"","text":"warranty reserve, percentage change, year end balance, 2009"}
{"_id":"q84eaab0e","title":"","text":"Entergy Corporation, 2004, net revenue growth rate, financial performance, utility sector."}
{"_id":"q828823aa","title":"","text":"Accumulated benefit obligation, CECONY, 2013, Change in plan assets, Operating earnings, 2008"}
{"_id":"q8115b172","title":"","text":"pre-tax aggregate net unrealized loss, 2008"}
{"_id":"q8584d3c8","title":"","text":"Commercial of Gross Recoveries, Total Gross Recoveries, increasing rate, financial year, recovery rate, financial metrics, performance analysis."}
{"_id":"q847157e0","title":"","text":"Class A common stocks, percentage increase, participating employees, non-executive directors, 2016, 2017."}
{"_id":"q82bd9cf6","title":"","text":"Net investment gains (losses), positive, financial performance, investment portfolio, fiscal year, market conditions, asset management, investment strategy."}
{"_id":"q8204fa8e","title":"","text":"Management fees, financial advice fees, growth rate, financial advisory firms, 2023, revenue growth, fee structure, investment management, advisory services."}
{"_id":"q84911440","title":"","text":"Loan losses, 2008, 2009, financial crisis, credit risk, impairment, provisions, banks, financial institutions, economic downturn, asset quality, default rates."}
{"_id":"q85741ea2","title":"","text":"Electric utility operations, 1, year, operations, utility, finance"}
{"_id":"q84ff0cfc","title":"","text":"Pension, U.S. Plans, 2016, average, exceed"}
{"_id":"q84f3c928","title":"","text":"Net occupancy, 18000, year, financial metrics"}
{"_id":"q847d465e","title":"","text":"debt maturities, percentage, total maturities, 2019, financial analysis, debt management"}
{"_id":"q852067b2","title":"","text":"Corporate, total amount, financial analysis, threshold, data aggregation, fiscal year, revenue, financial metrics."}
{"_id":"q8253617e","title":"","text":"securities, ratio, issued, remaining, financial analysis"}
{"_id":"q8588b970","title":"","text":"company, properties, square feet, acre, 43560"}
{"_id":"q838c551e","title":"","text":"Total transaction and integration charges, 30%, 2010, million"}
{"_id":"q82d1dfae","title":"","text":"Restricted stock units, Junior subordinated notes, Outstanding Balance, December 31, average, financial analysis, 2066, positive balance."}
{"_id":"q81537282","title":"","text":"Premiums earned, As previously reported, financial metrics, insurance companies, revenue recognition, fiscal year-end, quarterly earnings, actuarial analysis, underwriting performance, financial reporting, 2023, 2022, 2021."}
{"_id":"q84b273ec","title":"","text":"U.S. small cap stocks, equity, securities, market capitalization, investment, financial analysis, stock market, valuation, portfolio management, asset allocation"}
{"_id":"q8529958a","title":"","text":"Ship improvements, Other comprehensive income, Changes in defined benefit plans, 2015"}
{"_id":"q85c1e02e","title":"","text":"Capital lease obligations, Payments due, 2017, 2018, increasing rate, financial analysis, lease liabilities, accounting standards, ASC 842, IFRS 16."}
{"_id":"q8136eb08","title":"","text":"Net cash used in financing activities, Individual fixed annuities, Net Investment Income, Group retirement products, Total Revenues, 2010"}
{"_id":"q8145f058","title":"","text":"gross unrecognized tax benefits, decline, 2009, 2010, percent"}
{"_id":"q85a05e90","title":"","text":"Collection, Residential, Total Collection, increasing rate, financial analysis, year, data, metrics"}
{"_id":"q8120e178","title":"","text":"Net interest revenue, Non-interest revenue, 2009, financial performance, revenue streams"}
{"_id":"q83e8e32e","title":"","text":"Operating revenues, sum, elements, financial analysis, revenue streams, fiscal year, financial performance, income statement."}
{"_id":"q839effac","title":"","text":"average growth rate, Production expenses, related taxes, 2011, 2012"}
{"_id":"q84bdf1d6","title":"","text":"Services, Hardware, increasing rate, financial analysis, year, revenue growth, market trends, financial performance."}
{"_id":"q81eaafa8","title":"","text":"Shares, percentage, total amount, 2017"}
{"_id":"q85372790","title":"","text":"corporate, 6000, 2015, million"}
{"_id":"q84c3c372","title":"","text":"Net written premiums, Specialty, Other revenue, 2016"}
{"_id":"q826cd24e","title":"","text":"Noninterest income, Interest payments, 2010, Payments due, million"}
{"_id":"q82699dea","title":"","text":"Fair of Total, total value, range, 1000, 3000, financial analysis, valuation"}
{"_id":"q8326c244","title":"","text":"Trading securities, debt, average, 2009"}
{"_id":"q818fa568","title":"","text":"Additions to customer relationship, acquisition costs, Cash Flows from Operating Activities, total amount, financial analysis"}
{"_id":"q82ab7daa","title":"","text":"cumulative total shareholder return, Discovery Inc., December 31, 2018, five year period, percentage"}
{"_id":"q85880192","title":"","text":"Sales volume, product tons, positive, year, financial analysis, metrics, performance indicators"}
{"_id":"q816ca8b0","title":"","text":"collective bargaining agreements, employees, labor unions, percentage, workforce, negotiations, labor relations, 2023"}
{"_id":"q83e9e292","title":"","text":"Management and financial advice fees, Distribution fees, 2023, financial services, advisory fees, total fees, investment management, asset management, financial advisory firms."}
{"_id":"q835220e2","title":"","text":"Notional sum, financial assets, interest rate risk, December 31, 2008, negative ones, million"}
{"_id":"q84ba27ea","title":"","text":"Total deferred tax liabilities, Long-term deferred income taxes, average, financial analysis, tax liabilities, deferred tax, accounting, financial reporting."}
{"_id":"q82c1c808","title":"","text":"Income taxes, 2008, Municipal investments, Loan Commitments"}
{"_id":"q83a0fcf8","title":"","text":"Finance Companies, positive, financial performance, revenue growth, profitability, market expansion, investment opportunities, risk management, customer acquisition, operational efficiency, capital structure, credit quality, regulatory compliance, asset management, liquidity position, interest rates, economic conditions."}
{"_id":"q815113e8","title":"","text":"RevPAR, 2016, total amount, elements, excluding, greater than 150"}
{"_id":"q8231b952","title":"","text":"secured debt, 2006, December 31, increasing rate, 2007, financial projection"}
{"_id":"q8393b9bc","title":"","text":"Net income, Fourth Quarter, growth rate, 2016, 2017, dollars, millions"}
{"_id":"q840174b6","title":"","text":"Subprime, Non-U.S. Residential, Securities, Loans, 2009, Gross, total value, million"}
{"_id":"q81d5b544","title":"","text":"What's the total amount of the Diluted: Weighted-average common shares outstanding for Denominator in the years where Total revenues for Revenues is greater than 0? (in million)"
{"_id":"q84e3361c","title":"","text":"Curtailments, Settlements, financial analysis, total amount, years, million"}
{"_id":"q81ce41f6","title":"","text":"Total stock-based compensation, Dec 31, 2009, Mar 31, 2010, Jun 30, 2010, average, financial analysis, compensation expense, quarterly results, financial reporting."}
{"_id":"q852cab94","title":"","text":"Balance%, 2009, total amount, 0, 200000, thousand"}
{"_id":"q83f02d8c","title":"","text":"Expenses on Support services, 600 million, column number, financial analysis"}
{"_id":"q83470c66","title":"","text":"Net flows, 2009, 2008, billion, financial analysis, investment, capital flows, economic indicators"}
{"_id":"q84b68568","title":"","text":"Deposits, Average volume, 2015, financial institutions, banking sector, liquidity, capital management, interest rates, savings accounts, time deposits."}
{"_id":"q81284e90","title":"","text":"Net interest revenue, dividends, growth, financial institutions, interest rates, economic cycles, investment strategies, banks, credit unions, 2023."}
{"_id":"q81ecc3ec","title":"","text":"net rental expense, increase, 2006, 2008"}
{"_id":"q831eac4e","title":"","text":"Other borrowed funds, Preferred stock, 2016, ratio"}
{"_id":"q822677ea","title":"","text":"Net sales, highest value, financial analysis, revenue, income statement, fiscal year, quarterly report, earnings report."}
{"_id":"q853f6702","title":"","text":"Fidelity National Information Services, ROI, 2007, 2008, investment, financial performance, stock price, market analysis."}
{"_id":"q84bbd8c4","title":"","text":"Total revenues, growth rate, 2011, million"}
{"_id":"q81be64ac","title":"","text":"Catastrophes, Attritional, Total Incurred, increasing rate, financial analysis, insurance industry, risk management, loss reserves, underwriting, claims management."}
{"_id":"q85c627c4","title":"","text":"Equity securities, Financial Services Businesses, Closed Block Business, Year Ended December 31, 2006"}
{"_id":"q856c87b4","title":"","text":"F-35, net sales, increased volume, production contracts, 2015"}
{"_id":"q83d25d02","title":"","text":"defined contribution plans, expenses, U.S., 2016, 2017, millions"}
{"_id":"q83d5e170","title":"","text":"Notebooks\/Mobile Devices, Netcomm Products, financial analysis, market comparison, revenue trends, product categories, sales performance, fiscal years, industry analysis."}
{"_id":"q838a16dc","title":"","text":"inventories, percentage change, 2012, 2013"}
{"_id":"q84735fe0","title":"","text":"Residential\/Consumer, 2009, percentage, total"}
{"_id":"q82c60594","title":"","text":"Average Balances, Interest-bearing deposits, growth rate, 2017, December 31, 2018, December 31"}
{"_id":"q84761ffa","title":"","text":"total equity securities, Level 1, U.S. defined benefit pension plans, 2011, 20%"}
{"_id":"q818d973c","title":"","text":"Balance, December 31, Foreign exchange translation, growing rate, financial year, currency fluctuations, exchange rates, multinational companies, foreign subsidiaries, financial reporting."}
{"_id":"q84d1064a","title":"","text":"unallocated items, Other, selling, general and administrative expenses, 2016"}
{"_id":"q81cd657e","title":"","text":"Total writedowns, Fixed Maturity Securities, Proceeds, growth rate, financial analysis, investment performance, year comparison."}
{"_id":"q85c2451e","title":"","text":"Long-term debt, Operating leases, financial analysis, debt management, lease accounting, financial metrics, company valuation, cash flow analysis, balance sheet, financial reporting."}
{"_id":"q855e70f2","title":"","text":"average growth rate, Other cost of management, Cost of operations, 2008, 2009, Year Ended December 31"}
{"_id":"q842a732a","title":"","text":"net revenues, 2007, millions of dollars"}
{"_id":"q81486b08","title":"","text":"Net interest revenue, Non-interest revenue, Revenues, net of interest expense, 2009"}
{"_id":"q8193eb00","title":"","text":"S&P 500, ROI, investment, 2011, 2012, stock market, index fund, performance, returns, financial analysis"}
{"_id":"q82aee3be","title":"","text":"Losses on reacquired debt, Contract valuation adjustments, financial analysis, financial reporting, accounting standards, financial metrics, fiscal year, financial performance."}
{"_id":"q82945418","title":"","text":"Commercial, Gross Charge-offs, least, year, financial analysis, credit risk, loan performance, banking sector, financial institutions."}
{"_id":"q83f4f3a8","title":"","text":"Cost of sales, 2009, financial analysis, increase rate, revenue, profit margin, expense ratio, financial metrics."}
{"_id":"q848826d2","title":"","text":"Net credit losses, Revenues, Total operating expenses, financial year, financial metrics, company performance, financial analysis"}
{"_id":"q8259f1ba","title":"","text":"Asset-backed securities, December 31, ranking, value"}
{"_id":"q828ef9be","title":"","text":"Fair Value, Financial Instruments, Assets, Liabilities, Market Value, Valuation Techniques, IFRS 13, ASC 820, Level 1 Inputs, Level 2 Inputs, Level 3 Inputs."}
{"_id":"q83f6593c","title":"","text":"Inventories, 2015, increasing rate, million, financial projection"}
{"_id":"q849ed562","title":"","text":"Net interest income, Total revenue, net of interest expense, 2016"}
{"_id":"q830527c4","title":"","text":"Southern California, December 31, 2010, Apartment Units, Tierra Vista, Rentable Square Footage, Alpine Country, Rentable Square Footage"}
{"_id":"q854ab756","title":"","text":"Distribution expenses, total expenses, 2011"}
{"_id":"q84e8db44","title":"","text":"ACC-4(5), Actual Capital, Short-Term Debt, Adjusted, 2010"}
{"_id":"q82e1dfc6","title":"","text":"Net income, 2015, total value, As previously reported, financial analysis"}
{"_id":"q84816a72","title":"","text":"Pan Am, Fairfax, VA, Shoppers’ World, Charlottesville, Amount, increasing rate"}
{"_id":"q828ca970","title":"","text":"fair value, retained interests, billions, December 2018, December 2017"}
{"_id":"q8592e77e","title":"","text":"Capital leases, Carrying amount, financial year, accounting standards, lease liabilities, balance sheet, IFRS 16, ASC 842, financial reporting, depreciation, asset valuation."}
{"_id":"q857c0cfc","title":"","text":"U.S. high-grade, interest rates, bond market, credit quality, yield curve, investment grade, financial markets, October 2023."}
{"_id":"q8194e6b8","title":"","text":"customer satisfaction index, percentage increase, 2008, 2010"}
{"_id":"q828faf8a","title":"","text":"Impaired loans, allowance, 2016, financial analysis, loan portfolio, credit risk, financial institutions, provisions, asset quality, banking sector."}
{"_id":"q82c8673a","title":"","text":"Active, 100000, 500000, 2015, million"}
{"_id":"q843194de","title":"","text":"reinsurance, accounts, percentage change, 2009, 2010"}
{"_id":"q83479d2a","title":"","text":"Earnings from operations, Pension, postretirement cash requirements, 2015, financial analysis, cash flow, retirement benefits, actuarial assumptions, corporate finance, long-term liabilities."}
{"_id":"q826436a2","title":"","text":"Pass-through securities, 2009, increasing rate, million, mortgage-backed securities, interest rates, investment trends, financial markets."}
{"_id":"q85801d10","title":"","text":"Total Revenues, Other Expense, 30000, financial analysis, revenue calculation, expense threshold, fiscal year, financial metrics"}
{"_id":"q839cb2d8","title":"","text":"net revenue, growth rate, 2008, 2007"}
{"_id":"q84c90ae4","title":"","text":"CardServices, loan losses, 2009, 2008, 2007, average value, financial analysis"}
{"_id":"q81c0906a","title":"","text":"Pension Benefits, U.S., 2018, sum, million"}
{"_id":"q82dd3fa2","title":"","text":"Net revenues, December 31, largest value, financial reporting, fiscal year, revenue recognition, accounting standards, quarterly earnings, year-end results."}
{"_id":"q836a7304","title":"","text":"March 31, 2005, financial data, sum, three months ended, greater than 6000, millions."}
{"_id":"q83c5297a","title":"","text":"Operating income, Interest income, table 2, financial analysis, year, sum, thousand"}
{"_id":"q83cbc938","title":"","text":"Interest on debt, Fair value of plan assets, 2016, Total assets, December 31, 2012, sum"}
{"_id":"q84aedba6","title":"","text":"Interest expense, Year Ended December 31, 2013, Office equipment, December 31, 2015"}
{"_id":"q8528daa0","title":"","text":"acquisition, income tax, deduction, future, company, financial impact, tax liability, amortization, goodwill, tax shield"}
{"_id":"q85aacf9c","title":"","text":"principle payment, 2008, 2009, 2010, 2011, total amount"}
{"_id":"q8246be4c","title":"","text":"Purchase obligations, December 31, 2009, Due after 5 Years, Commercial real estate, December 31, 2009, Small business commercial – domestic, December 31, 2009, Amount."}
{"_id":"q81906eda","title":"","text":"asset allocation, percentage change, 2016, 2017"}
{"_id":"q81dec7ec","title":"","text":"allowance for doubtful accounts, increase, 2005, 2006"}
{"_id":"q83427390","title":"","text":"Consolidated Edison, CECONY, full service customers, lowest, year, 2023."}
{"_id":"q84a6d6b8","title":"","text":"Noninterest expense, Net occupancy, financial analysis, expense report, financial metrics, fiscal year, accounting standards."}
{"_id":"q851c1f0e","title":"","text":"Property and equipment, net, Basic weighted average common shares outstanding, average, financial analysis, company performance, fiscal year, financial metrics."}
{"_id":"q84c73f70","title":"","text":"Management fees, financial advice fees, 2023, financial services, advisory firms, investment management, fee structures, revenue growth."}
{"_id":"q82adc86c","title":"","text":"Fixed maturities, Carrying Value, Equity securities, Carrying Value, growth rate, financial analysis, investment portfolio, 2023."}
{"_id":"q8308c00a","title":"","text":"Mondovi, net assets, acquired, sale, excess assets, deal, thousands"}
{"_id":"q85adb040","title":"","text":"Fixed income, Active, 2016, increasing rate"}
{"_id":"q84c64732","title":"","text":"Qualifying Accounting Hedges-2, Gross Derivative Assets, 2010, billion"}
{"_id":"q84d37542","title":"","text":"Additional Paid-in Capital, 2007, positive values, financial analysis, equity financing, capital structure, company valuation, stock issuance, market capitalization."}
{"_id":"q8199c7aa","title":"","text":"Net sales, 2012, Commercial paper, 2010, Fair Value, U.S. government securities, agency securities, 2011"}
{"_id":"q814cc00e","title":"","text":"Securities loaned, 14000, year, financial metrics, lending, market trends"}
{"_id":"q8455ea96","title":"","text":"Standardized Approach, financial metrics, million, regulatory framework, Basel III, risk-weighted assets, capital requirements, banking sector, 2023."}
{"_id":"q81243044","title":"","text":"Total operating revenues, Other investment income, positive, average, financial analysis, revenue metrics, investment performance, fiscal year, financial reporting."}
{"_id":"q8160f1dc","title":"","text":"average value, January 1, Number of Awards, Weighted Average Grant Date Fair Value"}
{"_id":"q848282b8","title":"","text":"Money market funds, average increasing rate, 2012, 2013."}
{"_id":"q84ab0bf2","title":"","text":"Fair Value, other debt securities, 2011"}
{"_id":"q8245c302","title":"","text":"Operating revenues, Purchased power, Fuel, Other operations and maintenance, Electric"}
{"_id":"q822237e8","title":"","text":"weighted average shares outstanding, diluted net earnings per share, percentage change, 2006, 2007"}
{"_id":"q819227de","title":"","text":"operating leases, percent change, 2011\/12, 2013\/4"}
{"_id":"q83076002","title":"","text":"Production expenses, related taxes, financial analysis, cost management, fiscal year, budget allocation, expense tracking."}
{"_id":"q8489f7dc","title":"","text":"Corporate bonds, other bonds, investment-grade bonds, high-yield bonds, bond market, fixed income, yield curve, credit rating, bond issuance, interest rates, bond maturity, bondholders, securities, debt instruments."}
{"_id":"q81cc588c","title":"","text":"amortization, income tax, 2014, 2015, 2016, tax deduction, future income tax, financial analysis"}
{"_id":"q842c0636","title":"","text":"sum, three months, highest value, financial analysis, data comparison"}
{"_id":"q824af32c","title":"","text":"Financial standby letters of credit, Benefit plans-3, total amount, financial metrics, credit risk, liquidity, financial instruments, 2023, financial analysis."}
{"_id":"q83ca3ed8","title":"","text":"Total fixed rate debt, 2010, 2011, average value, comparison"}
{"_id":"q825d30aa","title":"","text":"Total revenues, Regulated Natural Gas, chart 3, highest value, year"}
{"_id":"q82080364","title":"","text":"minimum lease payments, assets under construction, financial analysis, lease liabilities, accounting standards, IFRS 16, ASC 842, financial reporting, lease obligations, cash flow management"}
{"_id":"q82234fde","title":"","text":"Interest cost, U.S. pension plans, benefit obligation, increasing rate, 2023"}
{"_id":"q832afed6","title":"","text":"Group Retirement Products, year, financial services, retirement planning, investment options, 2023"}
{"_id":"q8569a382","title":"","text":"Mutual funds, Equity products, growth rate, 2023, investment, financial markets, asset management, performance metrics."}
{"_id":"q81d1e3b0","title":"","text":"Total revenues, Regulated Natural Gas, growth rate, 2008"}
{"_id":"q854ea032","title":"","text":"bond authorization, withdrawn, total amount lost, financial loss, investment, securities, market value, fiscal year, interest rates, bond market"}
{"_id":"q818bcaa6","title":"","text":"Investment securities, increasing rate, 2013, million"}
{"_id":"q8491f3ba","title":"","text":"Aon, 2010, total revenue, 25%, HR solutions, millions"}
{"_id":"q81b04e76","title":"","text":"valuation allowance, 2011, 2012, company valuation, decrease"}
{"_id":"q85beddf2","title":"","text":"Significant Other Observable Inputs, Level 2, 2011, positive, sum, financial analysis, valuation, market data."}
{"_id":"q818a37b8","title":"","text":"Residential, Religious, kWhs Delivered, 2005, 2004, difference, million"}
{"_id":"q837dfed8","title":"","text":"Consumers, sum, greater than 1, million"}
{"_id":"q836e80f2","title":"","text":"Commissions, Goodwill, Intangible Assets, Deferred Tax Liabilities, Year Ended December 31, Average, Financial Analysis, Positive Balance"}
{"_id":"q834c4d84","title":"","text":"Total revenues, growth rate, 2011, 2012, million"}
{"_id":"q80f0a76a","title":"","text":"Entergy Arkansas, Entergy Louisiana, Power Purchase Agreements, average value, comparison, energy market, utility companies, 2023."}
{"_id":"q85a7cc98","title":"","text":"Auto & Home, sum, positive elements, million"}
{"_id":"q81d4df20","title":"","text":"receivable balances, Puerto Rico, December 31, 2017, past due, percentage"}
{"_id":"q83364962","title":"","text":"Total revenue, 13000000"}
{"_id":"q857b4efc","title":"","text":"Con Edison, Current Fair Value, Derivative Assets, Gross Amounts, Recognized Assets, Liabilities, Total, 2014"}
{"_id":"q833ef6de","title":"","text":"U.S. credit card loans, charged off, 2016, cash proceeds, new securitizations, residential mortgage agency, 2014."}
{"_id":"q81a22a62","title":"","text":"Goodwill, 2016, million, increasing rate"}
{"_id":"q82d8ef42","title":"","text":"balance increase, 2017, financial analysis, year-end, beginning balance, end balance"}
{"_id":"q81f4001c","title":"","text":"Cash and cash equivalents, Unsettled fund receivables, 2011, million"}
{"_id":"q826322e4","title":"","text":"options exercised, intrinsic value, 2007, 2006, 2005, millions"}
{"_id":"q83b8b2ee","title":"","text":"Commitment Type, 2015, 2016, 2017, decrease, financial analysis, trend, year-over-year, data comparison"}
{"_id":"q811391f8","title":"","text":"advertising costs, 2001, 2002, change, financial analysis"}
{"_id":"q83b59da2","title":"","text":"Total Loans, Commercial Loans, financial analysis, loan portfolio, credit risk, lending, financial institutions, balance sheet, loan performance, risk assessment"}
{"_id":"q813b8c26","title":"","text":"Unit redemptions, Mortgages Payable, Carrying Amounts, financial analysis, cash flow, liabilities, asset management, year-over-year comparison, financial metrics."}
{"_id":"q812cf9ae","title":"","text":"Con Edison, Benefit Obligation, Year, Growing Rate, Financial Analysis, Pension Liability, 2023, 2022, 2021"}
{"_id":"q846236fc","title":"","text":"Bermuda, December 31, 2017, Case Reserves, Insurance, December 31, 2016, Case Reserves, International, December 31, 2016, Total Reserves"}
{"_id":"q85a99302","title":"","text":"Bermuda, IBNR Reserves, Insurance, Case Reserves, 2016, 2017"}
{"_id":"q82b3823e","title":"","text":"International Funds, Federal Money Market Funds, average value, Total, million, financial analysis, investment funds, market trends, performance metrics."}
{"_id":"q84a29b34","title":"","text":"Defined benefit plans, 2015, total amount, negative plans, pension funds, actuarial valuation, liabilities, retirement benefits."}
{"_id":"q8195ccf4","title":"","text":"Con Edison, Benefit obligation, beginning of year, largest, financial analysis, pension obligations, actuarial assumptions, fiscal year, 2023, 2022, 2021."}
{"_id":"q84ca661e","title":"","text":"Restated, Net income, highest, year, financial performance, earnings, fiscal year"}
{"_id":"q83c2a93e","title":"","text":"repurchase, shares, board of directors, 2006, billions"}
{"_id":"q81e4f9be","title":"","text":"Interest rate, Equity, Credit derivatives, Notional amounts, billion, 2023"}
{"_id":"q8400a284","title":"","text":"Interest cost, Environmental, growth rate, Table 1, Table 0, 2023"}
{"_id":"q84c305fe","title":"","text":"Commercial mortgage, loans, ranking, year ended December 31, financial analysis, mortgage market, loan portfolio, 2023."}
{"_id":"q85752c8e","title":"","text":"Cost of Goods Sold, Year Ended December 31, 2016, Inventories, At December 31, 2013, Leasehold Improvements, Tenant Improvements, December 31, 2016"}
{"_id":"q83228472","title":"","text":"Proceeds, Fixed Maturity Securities, highest, year, financial analysis, investment, securities market, yield, interest rates, bond market."}
{"_id":"q845279c4","title":"","text":"JW Marriott, Marriott International, financial performance, revenue, hotel industry, luxury hospitality, market share, 2023, earnings report, total assets, investment, brand valuation."}
{"_id":"q85874db0","title":"","text":"Equity securities, growth rate, 2009, December 31, financial analysis, investment, market performance."}
{"_id":"q81a371f6","title":"","text":"Attritional, Current Year, International, average, million"}
{"_id":"q83fb1e4a","title":"","text":"Gain (loss), assets, executive deferred compensation plan, 2017, 2016, 2015, Year Ended October 31, million"}
{"_id":"q814f56d4","title":"","text":"Investment Bank, Total, 2009, increasing rate"}
{"_id":"q8499ad76","title":"","text":"2011, million, sum, elements"}
{"_id":"q81f2e43e","title":"","text":"segregated collateral, brokerage customers, December 31, 2009, total value, millions"}
{"_id":"q8566cf36","title":"","text":"Cash provided by operating activities, Reinsurance assets, 2013, 2017, financial reporting, balance sheet, insurance companies, liquidity, cash flow, actuarial reserves."}
{"_id":"q851cc3be","title":"","text":"net change, retained interests, 2018, millions"}
{"_id":"q83a62494","title":"","text":"Net income, Land, financial analysis, total amount, years, financial metrics, company performance, asset valuation."}
{"_id":"q81b53972","title":"","text":"Employee Compensation and Benefits, Communications and Information Processing, Occupancy and Equipment, 2006, average value"}
{"_id":"q83daa26e","title":"","text":"Total contractual obligations, sum, greater than 5000, million"}
{"_id":"q831886de","title":"","text":"Finance Companies, positive, sum, million"}
{"_id":"q833247b8","title":"","text":"Employee separations, Operating activities, Year Ended December 31, 2007"}
{"_id":"q85d3a8c2","title":"","text":"consolidated revenues, growth rate, 2011, 2012"}
{"_id":"q857a4322","title":"","text":"airliner count, 2016, net change"}
{"_id":"q83a43364","title":"","text":"Attritional, average growth rate, 2015, 2016, percentage"}
{"_id":"q83ab3cf4","title":"","text":"Mutual funds, Insurance, Annuity products, Equity products, Fixed income products, 2018"}
{"_id":"q8538e544","title":"","text":"liabilities, asset retirement obligations, 2003, millions"}
{"_id":"q84bf69a8","title":"","text":"Total expenses, 50%, million"}
{"_id":"q829ce3f8","title":"","text":"Net actuarial loss, 2014, 2015, 2016, actuarial assumptions, pension plans, financial reporting, liabilities, discount rates, mortality rates, pension obligations."}
{"_id":"q843299d8","title":"","text":"Con Edison, Projected benefit obligation, growth rate, financial analysis, pension obligations, 2023."}
{"_id":"q8534d314","title":"","text":"rent, operating expense, 2013, 2012, 2011, millions"}
{"_id":"q85a5bb42","title":"","text":"Group retirement products, Net Investment Income, Cash at end of year 2011, Total Revenues, 2005"}
{"_id":"q852d98f6","title":"","text":"principal transactions, increasing rate, finance, percentage, market trends, financial analysis"}
{"_id":"q82a64de4","title":"","text":"net change in revenue, 2006, 2007, transmission revenue, percentage, financial analysis"}
{"_id":"q812183d0","title":"","text":"Equity securities, 50 million, 100 million, sum, financial analysis"}
{"_id":"q825563f2","title":"","text":"Payments, long-term debt obligations, growth rate, 2019, financial analysis, debt servicing, interest payments, amortization schedule."}
{"_id":"q816a4a7a","title":"","text":"Boeing, Airbus, total aircraft orders, firm order, commercial aviation, 2023, backlog, delivery schedule, aircraft manufacturers, market demand."}
{"_id":"q821b69a4","title":"","text":"Investment Bank, greater than 1000, sections, financial analysis, market capitalization, equity underwriting, debt issuance, mergers and acquisitions, advisory services, trading revenue, asset management, financial modeling, risk management, capital markets, corporate finance, underwriting fees, deal flow, investment strategies, financial advisory, private placements, public offerings."}
{"_id":"q837bea62","title":"","text":"Goodwill, intangible assets, growth rate, 2017, financial analysis, net assets, valuation, accounting standards."}
{"_id":"q83b7e33c","title":"","text":"Expected volatility, Conversion Feature, Net credit losses, Table 0, Table 2, growth rate, financial analysis, risk assessment."}
{"_id":"q83583c0c","title":"","text":"total asset-6, gross profit, growing rate, financial analysis, year, percentage"}
{"_id":"q814d91b4","title":"","text":"HR Solutions, operating income, growth rate, 2009, 2010"}
{"_id":"q8183d97c","title":"","text":"Repurchases, securitization trusts, Residential Mortgage Agency 2015, U.S. credit card loans, leases charged off, 2013."}
{"_id":"q81c45934","title":"","text":"specific reserves, TDR portfolio, December 31, 2012"}
{"_id":"q8364ba86","title":"","text":"fuel surcharge program, freight revenue, percentage change, 2012, 2013"}
{"_id":"q83d6bbae","title":"","text":"global products, atoi, total atoi, segments, percentual growth, 2014, 2015"}
{"_id":"q824d9802","title":"","text":"residential mortgages, percentage increase, 2011, 2012"}
{"_id":"q85039a74","title":"","text":"Gross Unrealized Gains, Technology Corporate securities, December 31, 2015"}
{"_id":"q85a46076","title":"","text":"Nonaccrual Loans, 2010, As of September 30, financial data, banking sector, loan performance, asset quality."}
{"_id":"q84978ff0","title":"","text":"Treasury Stock, Retirement, Common Stock, Financial Year, Stock Buyback, Corporate Finance, Shareholder Equity, 2023, 2022, 2021, 2020, 2019."}
